{
    "author_name": "Honey Phillips",
    "base_id": 152,
    "book_description": "Can a grieving alien warrior and a desperate mother overcome their painful pasts through the shared love of a child?One year ago, Jade’s husband was killed and the baby she had wanted for so long disappeared. She has been searching for her daughter ever since. Nothing - not even being abducted by aliens - is going to stop her.She doesn’t expect to find a daughter who doesn’t know her; one who clings to a huge, green alien instead. Despite her own attraction to the older warrior, she will do whatever it takes to get her daughter back.Inzen lost his wife and daughter many years ago in the terrible plague that threatened to destroy the Cire race. When his ship rescued a group of abducted women and infants, he willingly took on the care of one of the children.Then a luscious human female appears, demanding the return of her daughter and he is faced with once again losing a child.When danger threatens, can Jade and Inzen come together for the sake of the child they both love?Each book in the Treasured by the Alien series can be read as a standalone romance. This sweet and steamy HEA is intended for mature readers.",
    "book_title": "Daughter of the Alien Warrior",
    "editions": [
        "English"
    ],
    "genres": {
        "adult": 2,
        "aliens": 20,
        "erotica": 2,
        "fantasy": 2,
        "paranormal": 3,
        "romance": 8,
        "science fiction": 12,
        "science fiction romance": 7
    },
    "inventory": [
        {
            "status": "available",
            "stock_number": "152_1"
        },
        {
            "status": "on_loan",
            "stock_number": "152_2"
        },
        {
            "status": "on_loan",
            "stock_number": "152_3"
        },
        {
            "status": "maintenance",
            "stock_number": "152_4"
        },
        {
            "status": "available",
            "stock_number": "152_5"
        }
    ],
    "metrics": {
        "rating_votes": 1187,
        "score": 4.34
    },
    "original_book_title": "B0882WM656",
    "pages": 640,
    "url": "https://www.goodreads.com/book/show/53337626-daughter-of-the-alien-warrior",
    "year_published": 2020
}