{
    "author_name": "GraceGoodwin",
    "base_id": 182,
    "book_description": "When a potential threat against her life forces Eva Daily to seek shelter on another world, she has only one option available to her. She must offer herself to the Interstellar Bride Program. After a deeply humiliating assessment of her suitability, Eva will be assigned a mate and transported to his world to become his bride.Upon arriving on the desert planet Trion, Eva soon learns that things are quite different than she is used to on Earth. Her assigned mate, the powerful, handsome High Councilor Tark, makes it clear that she will be expected to submit to him completely, and she quickly discovers that disobedience will earn her a painful, embarrassing spanking on her bare bottom.An intimate examination from her new mate leaves Eva blushing crimson, but to her surprise Tark’s mastery of her body arouses her beyond anything she could have ever imagined. Soon enough she finds herself naked, bound, and unable to resist the urge to beg for more as his skillful lovemaking brings her to one shattering climax after another.It doesn’t take long, however, for Eva to realize that there is much more to Tark than just a dominant brute who will not hesitate to take his misbehaving wife over his knee and redden her bare bottom thoroughly. But just as her passion for him begins to blossom into love, events back on Earth threaten to tear her away from him forever. Can Eva find a way to remain at Tark’s side and in his bed, or will she be left with nothing but memories of the man who has claimed both her body and her heart?Publisher’s Note: Assigned a Mate is an erotic romance novel that includes spankings, sexual scenes, medical play, anal play, elements of BDSM, and more. If such material offends you, please don’t buy this book.",
    "book_title": "Assigned a Mate",
    "editions": [
        "English"
    ],
    "genres": {
        "adult": 12,
        "aliens": 46,
        "bdsm": 44,
        "erotica": 50,
        "fantasy": 12,
        "paranormal": 13,
        "paranormal romance": 13,
        "romance": 69,
        "science fiction": 48,
        "science fiction romance": 21
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_number": "182_1"
        },
        {
            "status": "available",
            "stock_number": "182_2"
        },
        {
            "status": "available",
            "stock_number": "182_3"
        },
        {
            "status": "available",
            "stock_number": "182_4"
        },
        {
            "status": "on_loan",
            "stock_number": "182_5"
        },
        {
            "status": "maintenance",
            "stock_number": "182_6"
        },
        {
            "status": "on_loan",
            "stock_number": "182_7"
        },
        {
            "status": "on_loan",
            "stock_number": "182_8"
        },
        {
            "status": "on_loan",
            "stock_number": "182_9"
        }
    ],
    "metrics": {
        "rating_votes": 2391,
        "score": 3.79
    },
    "original_book_title": "Assigned A Mate",
    "pages": 699,
    "url": "https://www.goodreads.com/book/show/29225378-assigned-a-mate",
    "year_published": 2016
}