{
    "author_name": "Anna Carven",
    "base_id": 183,
    "book_description": "alternate cover edition of ASIN B01ECOIDHQThe PrincePrince Xalikian Kazharan has a dilemma on his hands. Now that the Kordolians have landed on Earth, he somehow has to convince an entire planet of Humans that his people mean them no harm. It's easier said than done, especially when one's race has a reputation for brutally conquering the Nine Galaxies. Perhaps this stubborn female journalist called Sera Aquinas, who thinks she can just walk up to his front door and ask for an interview, might be able to help him.But first, he has to gain her trust, and that's not so easy when her presence drives him to distraction.The JournalistSera Aquinas doesn't trust the charming amber-eyed Prince when he says he doesn't want to take over her planet. As a hardened journalist, she's seen her share of duplicity and corruption. So when Xal tells her the Kordolians are looking for Human females, she thinks he's messing with her. Seriously? Who would believe that lame excuse?She has to admit however, that Xal is one fine looking alien, and a part of her is curious.It's absolutely far fetched, but what if he's telling the truth?What if Humans and Kordolians are compatible?And when it comes to Xal, why does her body keep betraying her when her head is telling her to get the hell out of there?Warning: this book contains swearing, violence, sensual sex scenes, silver aliens with fangs and a little dose of insta-lust. If you're sensitive to any of these things, you may want to think twice before reading it. It's definitely recommended for readers aged 18 and over.Dark Planet Falling is Book Two in the Dark Planet Warriors Series. It will probably make more sense if you've read the other three books first, although that's probably not absolutely essential.",
    "book_title": "Dark Planet Falling",
    "editions": [
        "English"
    ],
    "genres": {
        "adult": 8,
        "aliens": 68,
        "erotica": 10,
        "fantasy": 13,
        "paranormal": 10,
        "paranormal romance": 13,
        "romance": 64,
        "science fiction": 66,
        "science fiction romance": 29,
        "space": 8
    },
    "inventory": [
        {
            "status": "available",
            "stock_number": "183_1"
        },
        {
            "status": "available",
            "stock_number": "183_2"
        },
        {
            "status": "available",
            "stock_number": "183_3"
        },
        {
            "status": "on_loan",
            "stock_number": "183_4"
        },
        {
            "status": "available",
            "stock_number": "183_5"
        },
        {
            "status": "available",
            "stock_number": "183_6"
        },
        {
            "status": "available",
            "stock_number": "183_7"
        },
        {
            "status": "on_loan",
            "stock_number": "183_8"
        },
        {
            "status": "on_loan",
            "stock_number": "183_9"
        }
    ],
    "metrics": {
        "rating_votes": 2697,
        "score": 4.08
    },
    "original_book_title": "English",
    "pages": 348,
    "url": "https://www.goodreads.com/book/show/29927354-dark-planet-falling",
    "year_published": 2016
}