{
    "author_name": "Morgan Hawke",
    "base_id": 200,
    "book_description": "Victoria Stark is an Imperial Navigations Pilot known among the sentient battleships as the Victorious Star—for sacrificing her captains to save her ships. Strong-willed and resourceful, she has never lost a ship she's flown—and never serviced a captain she's had.Captain Ravnos of the Mercenary dreadnaught Hellsbreath rules his crew with an iron will. First Officer Seht is a skeldhi prince whose specialty is erotic discipline. They're on a mission, and in need of a nav-pilot.Kidnapped into service on the Hellsbreath, Victoria is caught between two very different men locked in their own private and erotic power struggle. And then there's the mission…The Moribund Company has captured the Imperial Dreadnaught Arcane, and intends to auction the sentient ship to the highest bidder. Unfortunately, Moribund himself is attending the auction and Ravnos is forced to remain onboard the Hellsbreath for Moribund has a personal vendetta against the handsome captain. It is up to Victoria and First Officer Seht to go deep undercover at the Mordred Space Station to rescue the Arcane.To complete the mission and return to her duties as an Imperial Officer, Victoria must become Prince Seht's rehkyt—a pet, literally and figuratively. Not allowed on the furniture and kept at the end of a leash, Victoria discovers that there are worse things than servicing your captain. Or are there?Publisher's Note: This book contains explicit sexual content, graphic language, and situations that some readers may find objectionable: Anal play/intercourse, BDSM (including bondage, domination/submission, whipping), menage (m/m/f), and homoerotic sexual situations (m/m, f/f).",
    "book_title": "Victorious Star",
    "editions": [
        "English"
    ],
    "genres": {
        "aliens": 32,
        "bdsm": 160,
        "erotic romance": 31,
        "erotica": 122,
        "fantasy": 25,
        "male male romance": 34,
        "romance": 60,
        "science fiction": 142
    },
    "inventory": [
        {
            "status": "available",
            "stock_number": "200_1"
        },
        {
            "status": "maintenance",
            "stock_number": "200_2"
        }
    ],
    "metrics": {
        "rating_votes": 2554,
        "score": 3.93
    },
    "original_book_title": "Victorious Star (Interstellar Service & Discipline, #1)",
    "pages": 1016,
    "url": "https://www.goodreads.com/book/show/237020.Victorious_Star",
    "year_published": 2004
}