{
    "author_name": "Aleksandr Voinov",
    "base_id": 215,
    "book_description": "Fighting with your back to the wall is all well and good—as long as you’ve chosen the right wall.When the local authorities ask Kyle Juenger to hunt a shape-shifting Glyrinny spy, he can’t refuse. After all, he can use the reward to replace his paralyzed legs with cyberware, and maybe even to return to his home planet. Besides, he hates the morphs—those invasive, brain-eating monstrosities whose weapons cost him his legs.Kyle’s best lead is the Scorpion, a mercenary ship armed to the teeth. Grimm, the Scorpion’s pilot and captain, fascinates Kyle. He’s everything Kyle lost with his legs, and he’s from the same home world. He’s also of the warrior caste—half priest, half savior. But Grimm’s been twisted by life as a merc, and Kyle’s stuck undercover as a criminal on the run.That doesn’t stop Grimm from coming on to Kyle, or from insisting he’s more than the sum of his past and his useless legs. But Kyle has other concerns—like tracking a dangerous morph who could be wearing anyone’s face. And as if things weren’t complicated enough, Kyle can’t tell if Grimm is part of the solution . . . or part of the problem.",
    "book_title": "Incursion",
    "editions": [
        "English"
    ],
    "genres": {
        "aliens": 22,
        "disability": 13,
        "fantasy": 14,
        "lgbt": 19,
        "male male romance": 120,
        "military fiction": 18,
        "paranormal": 11,
        "romance": 47,
        "science fiction": 104,
        "shapeshifters": 18
    },
    "inventory": [
        {
            "status": "available",
            "stock_number": "215_1"
        },
        {
            "status": "maintenance",
            "stock_number": "215_2"
        },
        {
            "status": "on_loan",
            "stock_number": "215_3"
        },
        {
            "status": "available",
            "stock_number": "215_4"
        },
        {
            "status": "available",
            "stock_number": "215_5"
        },
        {
            "status": "on_loan",
            "stock_number": "215_6"
        },
        {
            "status": "on_loan",
            "stock_number": "215_7"
        }
    ],
    "metrics": {
        "rating_votes": 886,
        "score": 3.89
    },
    "original_book_title": "Incursion",
    "pages": 1121,
    "url": "https://www.goodreads.com/book/show/30979195-incursion",
    "year_published": 2012
}