{
    "author_name": "Amie Kaufman",
    "base_id": 25649,
    "book_description": "This morning, Kady thought breaking up with Ezra was the hardest thing she’d have to do. This afternoon, her planet was invaded.The year is 2575, and two rival mega-corporations are at war over a planet that’s little more than a speck at the edge of the universe. Now with enemy fire raining down on them, Kady and Ezra — who are barely even talking to each other—are forced to evacuate with a hostile warship in hot pursuit.But their problems are just getting started. A plague has broken out and is mutating with terrifying results; the fleet’s AI may actually be their enemy; and nobody in charge will say what’s really going on. As Kady hacks into a web of data to find the truth, it’s clear the only person who can help her is the ex-boyfriend she swore she’d never speak to again.Told through a fascinating dossier of hacked documents — including emails, maps, files, IMs, medical reports, interviews, and more — Illuminae is the first book in a heart-stopping trilogy about lives interrupted, the price of truth, and the courage of everyday heroes.",
    "book_title": "Illuminae",
    "editions": [
        "English"
    ],
    "genres": {
        "adventure": 236,
        "audiobook": 511,
        "dystopia": 523,
        "fantasy": 819,
        "fiction": 832,
        "romance": 1006,
        "science fiction": 4407,
        "space": 356,
        "thriller": 220,
        "young adult": 3760
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_number": "25649_1"
        },
        {
            "status": "on_loan",
            "stock_number": "25649_2"
        },
        {
            "status": "maintenance",
            "stock_number": "25649_3"
        }
    ],
    "metrics": {
        "rating_votes": 121166,
        "score": 4.27
    },
    "original_book_title": "Illuminae",
    "pages": 224,
    "url": "https://www.goodreads.com/book/show/23395680-illuminae",
    "year_published": 2015
}