{
    "author_name": "Milana Jacks",
    "base_id": 273,
    "book_description": "When life deals a wild card, play it no matter the cost.Since the day Rey’s defiance earned her a blinding blow to the head, fear has hovered as close as the guide dog that clings to her side. But the terror that grips her now is almost beyond description.Like her sister before her, Rey has been sold to satisfy the lusts of one of the alien Beasts that now rule the Earth. If the towering, leather-clad Alpha discovers his prize can’t see, he could kill her with a flick of his claw. Or worse, send her home—where the only mercy she’ll get is a bullet.From the moment the Alpha Beast spotted Rey smiling tenderly at her flowers, his desire to own her, body and soul, roared louder than his bike’s throaty engine. But the only smiles his new pair aims his way are forced—and oddly off target. She is liquid heat in his arms, yet ignores the notes and gifts he leaves for her.If he can’t win her over, he can’t trust her with his own truth. And the combined weight of their secrets could destroy everything.***This dystopian fairy tale features one brave heroine paired with one sweet, unapologetic, possessive, protective, and kinky Alpha male Beast. If you're looking for \"mating trope\" with fleshed out characters in a steamy romance novella and HEA click it.",
    "book_title": "Blind Beast Mate",
    "editions": [
        "English"
    ],
    "genres": {
        "aliens": 32,
        "bdsm": 11,
        "dystopia": 14,
        "erotica": 10,
        "fantasy": 12,
        "paranormal": 28,
        "paranormal romance": 13,
        "romance": 40,
        "science fiction": 35,
        "science fiction romance": 8
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_number": "273_1"
        },
        {
            "status": "on_loan",
            "stock_number": "273_2"
        },
        {
            "status": "available",
            "stock_number": "273_3"
        },
        {
            "status": "maintenance",
            "stock_number": "273_4"
        },
        {
            "status": "maintenance",
            "stock_number": "273_5"
        },
        {
            "status": "maintenance",
            "stock_number": "273_6"
        },
        {
            "status": "on_loan",
            "stock_number": "273_7"
        },
        {
            "status": "on_loan",
            "stock_number": "273_8"
        },
        {
            "status": "maintenance",
            "stock_number": "273_9"
        }
    ],
    "metrics": {
        "rating_votes": 2601,
        "score": 3.57
    },
    "original_book_title": "Blind Beast Mate",
    "pages": 798,
    "url": "https://www.goodreads.com/book/show/36102391-blind-beast-mate",
    "year_published": 2016
}