{
    "author_name": "Melissa Landers",
    "base_id": 3351,
    "book_description": "Two years ago, the aliens made contact. Now Cara Sweeney is going to be sharing a bathroom with one of them. Handpicked to host the first-ever L’eihr exchange student, Cara thinks her future is set. Not only does she get a free ride to her dream college, she’ll have inside information about the mysterious L’eihrs that every journalist would kill for. Cara’s blog following is about to skyrocket.Still, Cara isn’t sure what to think when she meets Aelyx. Humans and L’eihrs have nearly identical DNA, but cold, infuriatingly brilliant Aelyx couldn’t seem more alien. She’s certain about one thing, though: no human boy is this good-looking.But when Cara's classmates get swept up by anti-L'eihr paranoia, Midtown High School suddenly isn't safe anymore. Threatening notes appear in Cara's locker, and a police officer has to escort her and Aelyx to class.Cara finds support in the last person she expected. She realizes that Aelyx isn’t just her only friend; she's fallen hard for him. But Aelyx has been hiding the truth about the purpose of his exchange, and its potentially deadly consequences. Soon Cara will be in for the fight of her life—not just for herself and the boy she loves, but for the future of her planet.",
    "book_title": "Alienated",
    "editions": [
        "English"
    ],
    "genres": {
        "aliens": 494,
        "dystopia": 68,
        "fantasy": 279,
        "fiction": 68,
        "high school": 55,
        "paranormal": 145,
        "paranormal romance": 53,
        "romance": 520,
        "science fiction": 635,
        "young adult": 804
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_number": "3351_1"
        },
        {
            "status": "maintenance",
            "stock_number": "3351_2"
        },
        {
            "status": "on_loan",
            "stock_number": "3351_3"
        },
        {
            "status": "available",
            "stock_number": "3351_4"
        },
        {
            "status": "on_loan",
            "stock_number": "3351_5"
        },
        {
            "status": "available",
            "stock_number": "3351_6"
        }
    ],
    "metrics": {
        "rating_votes": 22136,
        "score": 3.9
    },
    "original_book_title": "Alienated",
    "pages": 1255,
    "url": "https://www.goodreads.com/book/show/13574417-alienated",
    "year_published": 2014
}