{
    "author_name": "Cia_",
    "base_id": 35,
    "book_description": "Saving Caeorleia: Book Two Dade, human-Caeorleian hybrid and ex-military grunt, doesn’t fit in—not with humans, not with aliens, not anywhere. He’s always on the outskirts, angry, and people aren’t sure they can trust him. When he encounters a compatible tziu named Yaseke, secrets, misunderstandings, and attacks nearly prevent the two from making a connection Dade sorely needs. Even after they unite, Dade and Yaseke face challenges that two newly joined males should never have to endure. From traitorous council members, to sadistic aliens who plan to sell them as slaves, to meeting a mysterious race of revered aliens called Collectors, Dade and Yaseke manage to stay together—and even rescue two youths related to Yaseke, who’ve lost their parents to the same betrayer. Someone from Dade’s past is at the root of everything he’s suffered. No way can he let them get away with what they’re planning, but Dade isn’t sure he can stop them on his own. If he doesn’t let go of his isolation and risk the pain letting others in will bring, he’ll never save Caeorleia in time.",
    "book_title": "Adverse Effects",
    "editions": [
        "English"
    ],
    "genres": {
        "abuse": 8,
        "aliens": 18,
        "dystopia": 3,
        "fiction": 3,
        "lgbt": 3,
        "male male romance": 26,
        "military fiction": 12,
        "romance": 14,
        "science fiction": 27,
        "vampires": 4
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_number": "35_1"
        },
        {
            "status": "on_loan",
            "stock_number": "35_2"
        },
        {
            "status": "maintenance",
            "stock_number": "35_3"
        },
        {
            "status": "on_loan",
            "stock_number": "35_4"
        },
        {
            "status": "available",
            "stock_number": "35_5"
        },
        {
            "status": "available",
            "stock_number": "35_6"
        },
        {
            "status": "maintenance",
            "stock_number": "35_7"
        },
        {
            "status": "on_loan",
            "stock_number": "35_8"
        }
    ],
    "metrics": {
        "rating_votes": 366,
        "score": 3.98
    },
    "original_book_title": "Adverse Effects",
    "pages": 679,
    "url": "https://www.goodreads.com/book/show/26445818-adverse-effects",
    "year_published": 2014
}