{
    "author_name": "Chana Porter",
    "base_id": 439,
    "book_description": "A blend of searing social commentary and speculative fiction, Chana Porter’s fresh, pointed debut is perfect for fans of Jeff VanderMeer and Carmen Maria Machado. Trina Goldberg-Oneka is a fifty-year-old trans woman whose life is irreversibly altered in the wake of a gentle—but nonetheless world-changing—invasion by an alien entity called The Seep. Through The Seep, everything is connected. Capitalism falls, hierarchies and barriers are broken down; if something can be imagined, it is possible.Trina and her wife, Deeba, live blissfully under The Seep’s utopian influence—until Deeba begins to imagine what it might be like to be reborn as a baby, which will give her the chance at an even better life. Using Seeptech to make this dream a reality, Deeba moves on to a new existence, leaving Trina devastated.Heartbroken and deep into an alcoholic binge, Trina follows a lost boy she encounters, embarking on an unexpected quest. In her attempt to save him from The Seep, she will confront not only one of its most avid devotees, but the terrifying void that Deeba has left behind. A strange new elegy of love and loss, The Seep explores grief, alienation, and the ache of moving on.",
    "book_title": "The Seep",
    "editions": [
        "English"
    ],
    "genres": {
        "LGBT (Transgender) ": 25,
        "adult": 40,
        "aliens": 20,
        "fantasy": 37,
        "fiction": 105,
        "lgbt": 106,
        "queer": 79,
        "science fiction": 184,
        "science fiction fantasy": 22,
        "speculative fiction": 20
    },
    "inventory": [
        {
            "status": "available",
            "stock_number": "439_1"
        }
    ],
    "metrics": {
        "rating_votes": 1715,
        "score": 3.68
    },
    "original_book_title": "The Seep",
    "pages": 398,
    "url": "https://www.goodreads.com/book/show/45448133-the-seep",
    "year_published": 2020
}