{
    "author_name": "Harmony Raines",
    "base_id": 45,
    "book_description": "The Earth is dying, the only hope of escape is to win the lottery and be taken to Karal to be an alien mate. But what if the lottery wasn't random? What if they want you for what you know, and to punish you for what you've done?Deceit:Chosen by the Karal (Book One) can be read as a standalone book.This is the fate awaiting Elissa. She didn't enter the lottery, but somehow she still won. As the puzzle unravels, she finds herself trapped, with no option but to go to the planet Karal. All she can hope, is that her chosen alien mate will see her for who she really is, and not for the person he thinks she is.Marin has been chosen to be the first prize in the Earth lottery. With no females of their own, the Karalians have no choice but to take females from the dying Earth. Only this time they are avoiding taking them by force, unless absolutely necessary. But with resistance to their presence on Earth, his mission soon changes. Not only does he have the responsibility of creating the first of the next generation of Karalians, he also has to find a way to change the attitude of the Earth female he has been given.But is there anyway to change the opinion of a woman who is responsible for the deaths of two of his species? Time is not on his side, because as soon as the female is with child, she will be sent to the breeding house, there to be shut away until she gives birth to their child.When he starts to fall for Elissa, he questions whether they are better off together. However, the Hierarchy rule Karal, can he persuade them to break with traditions?For adults only, contains scorching hot alien/human scenes ",
    "book_title": "Deceit",
    "editions": [
        "English"
    ],
    "genres": {
        "aliens": 20,
        "dystopia": 3,
        "fantasy": 4,
        "fiction": 3,
        "male female romance": 3,
        "paranormal": 4,
        "paranormal romance": 4,
        "romance": 11,
        "science fiction": 18,
        "science fiction romance": 12
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_number": "45_1"
        },
        {
            "status": "available",
            "stock_number": "45_2"
        },
        {
            "status": "available",
            "stock_number": "45_3"
        },
        {
            "status": "maintenance",
            "stock_number": "45_4"
        },
        {
            "status": "on_loan",
            "stock_number": "45_5"
        },
        {
            "status": "available",
            "stock_number": "45_6"
        },
        {
            "status": "on_loan",
            "stock_number": "45_7"
        }
    ],
    "metrics": {
        "rating_votes": 659,
        "score": 3.61
    },
    "original_book_title": "B010K42E3G",
    "pages": 687,
    "url": "https://www.goodreads.com/book/show/25811350-deceit",
    "year_published": 2015
}