{
    "author_name": "Sara Page",
    "base_id": 54,
    "book_description": "The sequel to Princess SOSI'm alive. I survived the wilds of that remote planet I crashed into, and I've been trying to get to know my new alien lover before I return home and introduce him to my father. Yeah, so not looking forward to that introduction but at least I'm not knocked up... yet. Everything is going great until we intercept a transmission from my home planet. Apparently my jerk of a stepbrother has been telling everyone I'm dead, and they believe it. There's been a funeral for me and everything. So now it's a race home to prove to everyone I'm still alive and breathing before they pass on my crown and title to the next girl in the line of succession. And if that's not enough on my plate, another alien has decided to step forward and he's claiming I'm his, like we're fated or something. Ha! And I don't even like the guy, seriously can not even stand him. And you'd think my current alien lover would be mad... But no, he insists on bringing the other alien guy along because he's convinced I need the extra protection. One Ravager? I think I can handle it. But two sexy red-eyed purple space demons? Two might prove to be too much for this princess... The Dark Princes is the second installment in the Ravager Chronicles series. ",
    "book_title": "The Dark Princes",
    "editions": [
        "English"
    ],
    "genres": {
        "adult": 2,
        "aliens": 19,
        "erotica": 9,
        "fantasy": 3,
        "paranormal": 4,
        "paranormal romance": 2,
        "polyamorous": 11,
        "romance": 11,
        "science fiction": 16,
        "science fiction romance": 3
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_number": "54_1"
        },
        {
            "status": "maintenance",
            "stock_number": "54_2"
        },
        {
            "status": "available",
            "stock_number": "54_3"
        },
        {
            "status": "maintenance",
            "stock_number": "54_4"
        },
        {
            "status": "available",
            "stock_number": "54_5"
        },
        {
            "status": "maintenance",
            "stock_number": "54_6"
        },
        {
            "status": "on_loan",
            "stock_number": "54_7"
        },
        {
            "status": "available",
            "stock_number": "54_8"
        },
        {
            "status": "available",
            "stock_number": "54_9"
        }
    ],
    "metrics": {
        "rating_votes": 568,
        "score": 3.81
    },
    "original_book_title": "B01BECUIF4",
    "pages": 203,
    "url": "https://www.goodreads.com/book/show/28904992-the-dark-princes",
    "year_published": 2016
}