{
    "author_name": "Gena Showalter",
    "base_id": 577,
    "book_description": "RIDDING THE WORLD OF EVIL, ONE ALIEN AT A TIME: THAT'S MIA SNOW'S MISSION.Snow is in the forecast.In a time and place not too far away, Mia Snow is an alien huntress for the New Chicago Police Department. Heading up her expert team of Alien Investigation and Removal agents, Mia's unmatched at battling the elusive enemy among us, and she's the perfect girl for the job. She's seen her brother die at the hands of aliens. She's earned each of her scars. And she'll die before she cries. Now, a series of killings have Mia and her partner Dallas tracking alien suspects—but a sudden blast of violence leaves Dallas fighting for his life.They are ice and fire.The chance to save Dallas appears in the form of a tall, erotic stranger. An alien. A murder suspect. Kyrin en Arr, of the deadly Arcadian species, holds the power to heal the injured agent but not without a price. For Mia Snow, that price is surrendering to Kyrin's forbidden seduction...and embracing their electric attraction. She's walking a knife's edge, risking her badge and even her life. The closer she gets to Kyrin, the more Mia learns about her own heart, her human needs—and the shocking secret that will shatter everything she's ever believed.",
    "book_title": "Awaken Me Darkly",
    "editions": [
        "English"
    ],
    "genres": {
        "adult": 61,
        "aliens": 213,
        "fantasy": 134,
        "fiction": 36,
        "futuristic": 37,
        "paranormal": 299,
        "paranormal romance": 391,
        "romance": 307,
        "science fiction": 134,
        "urban fantasy": 98
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_number": "577_1"
        },
        {
            "status": "maintenance",
            "stock_number": "577_2"
        }
    ],
    "metrics": {
        "rating_votes": 11516,
        "score": 3.89
    },
    "original_book_title": "Awaken Me Darkly",
    "pages": 847,
    "url": "https://www.goodreads.com/book/show/476492.Awaken_Me_Darkly",
    "year_published": 2005
}