{
    "author_name": "Marie Harte",
    "base_id": 59,
    "book_description": "Book one in the Talson Temptations series.Domineering, dangerous and downright huge, Roarke Talson owns Jamie for the next three years. It's 2109, and the government has found a way to deal with the national debt. Indentured service. She might have been duped into debt, but she's not stupid. Jamie made sure to put a no-sex clause in her contract. There's just one problem. She can't stop thinking about her boss. Sexy and commanding, he's the face of her ultimate fantasy, and a nightmare employer. She's met every challenge he's thrown at her and refuses to drop, no matter how hard he works her.When Jamie does the wrong thing for the right reason, she assumes Talson will throw her in jail and not think twice. In an effort to escape, she ambushes him and flees, but not before taking a kiss and a bit more from the man.She hadn't counted on him getting free so quickly, that he might be half alien, or that he'd hunt her down with more than vengeance on his mind.Publisher's Note: This title was previously published elsewhere and has been revised for Ellora's Cave.",
    "book_title": "Talson's Wait",
    "editions": [
        "English"
    ],
    "genres": {
        "aliens": 23,
        "bdsm": 11,
        "erotica": 30,
        "fantasy": 7,
        "futuristic": 9,
        "male female romance": 5,
        "paranormal": 13,
        "paranormal romance": 6,
        "romance": 31,
        "science fiction": 34
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_number": "59_1"
        },
        {
            "status": "on_loan",
            "stock_number": "59_2"
        },
        {
            "status": "on_loan",
            "stock_number": "59_3"
        },
        {
            "status": "on_loan",
            "stock_number": "59_4"
        },
        {
            "status": "available",
            "stock_number": "59_5"
        },
        {
            "status": "maintenance",
            "stock_number": "59_6"
        },
        {
            "status": "available",
            "stock_number": "59_7"
        },
        {
            "status": "on_loan",
            "stock_number": "59_8"
        },
        {
            "status": "maintenance",
            "stock_number": "59_9"
        }
    ],
    "metrics": {
        "rating_votes": 1052,
        "score": 3.56
    },
    "original_book_title": "9781419933615",
    "pages": 1175,
    "url": "https://www.goodreads.com/book/show/6904657-talson-s-wait",
    "year_published": 2006
}