{
    "author_name": "Lara Adrian",
    "base_id": 650,
    "book_description": "In Crave the Night, Adrian brings the Breed and its world to the brink of war, where even the deepest passion can shatter into violence.Born and raised to be an emotionless killing machine, Nathan is one of the most lethal Breed vampires in existence. A key member of the Order—an elite group of warriors charged with protecting both mortals and vampires—Nathan executes each mission with flawless precision and a total lack of mercy. Now he must pursue a powerful, hidden enemy. But Nathan’s hard discipline and training are no match for the fierce pull he feels toward a young woman he has no right to desire—a woman of wealth and high social standing who has long been promised to another Breed male, and who may also prove to be the key to rooting out Nathan’s elusive quarry.Jordana lives a life of glittering privilege as a member of a prominent Breed family in Boston. Surrounded by fine things and fawning admirers, Jordana wants for nothing—until she crosses paths with a dark, intense warrior from the Order and finds herself swept into an impulsive, sizzling kiss that neither of them will forget. As much as she tries to deny her deep feelings for Nathan, Jordana cannot resist the craving to be near him, to break through his forbidding walls and see the man he truly is. But getting close to Nathan will thrust Jordana into a treacherous new world, forcing her to risk all she has and all she knows about herself and her past. And loving this seductive man could be the most dangerous temptation of all.",
    "book_title": "Crave The Night",
    "editions": [
        "English"
    ],
    "genres": {
        "adult": 30,
        "aliens": 20,
        "audiobook": 17,
        "fantasy": 63,
        "fiction": 15,
        "paranormal": 202,
        "paranormal romance": 234,
        "romance": 139,
        "urban fantasy": 28,
        "vampires": 191
    },
    "inventory": [
        {
            "status": "available",
            "stock_number": "650_1"
        },
        {
            "status": "available",
            "stock_number": "650_2"
        },
        {
            "status": "on_loan",
            "stock_number": "650_3"
        },
        {
            "status": "available",
            "stock_number": "650_4"
        },
        {
            "status": "available",
            "stock_number": "650_5"
        },
        {
            "status": "available",
            "stock_number": "650_6"
        },
        {
            "status": "on_loan",
            "stock_number": "650_7"
        }
    ],
    "metrics": {
        "rating_votes": 7653,
        "score": 4.27
    },
    "original_book_title": "Crave the Night",
    "pages": 1159,
    "url": "https://www.goodreads.com/book/show/17184930-crave-the-night",
    "year_published": 2014
}