{
    "author_name": "M.K. Eidem",
    "base_id": 768,
    "book_description": "King Grim Vasteri is the most feared warrior in the Tornian Empire. He has been sent by his Emperor to find and retrieve compatible females for their dying civilization.King Grim Vasteri is the strongest and most feared warrior in the Tornian Empire, King of Luda, blood brother to the Emperor, but his line will die with him as no female would join with him, for once he was scarred, he was considered 'unfit'. The Tornian Empire has been dying ever since the great infection caused the birth of females to become a rarity. Since then they have been searching the known universes for compatible females. The Emperor's discovery of a compatible female on a slave ship changed that. He'd ordered Grim to find his Empress' home world so more 'unprotected' females could be obtained, knowing Grim would never be allowed to Join with one.Lisa Miller is a widowed mother of two little girls, Carly and Miki. Her husband died just a year ago, after a long battle with cancer and she misses him immensely. Friends want her to start dating again but in her heart, she knows there isn't a man on the planet she could love like her Mark. Who could love their girls like their own. Therefore, she'll stay alone.When Lisa is discovered 'unprotected' at her husband's grave, she wakes on an alien ship heading for an alien world. Refusing to accept this she confronts the large males, demanding she be returned to her children. Seeing his chance to have a female, Grim agrees to accept and protect her offspring, if she agrees to Join with him and only him. Realizing this is the only way she can retrieve her children Lisa agrees and the Tornian Empire changes forever.",
    "book_title": "Grim",
    "editions": [
        "English"
    ],
    "genres": {
        "adult": 34,
        "aliens": 244,
        "erotica": 42,
        "fantasy": 93,
        "paranormal": 80,
        "paranormal romance": 52,
        "romance": 228,
        "science fiction": 221,
        "science fiction romance": 70,
        "space": 22
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_number": "768_1"
        },
        {
            "status": "available",
            "stock_number": "768_2"
        },
        {
            "status": "maintenance",
            "stock_number": "768_3"
        },
        {
            "status": "available",
            "stock_number": "768_4"
        }
    ],
    "metrics": {
        "rating_votes": 9564,
        "score": 4.13
    },
    "original_book_title": "B00EW7DHBG",
    "pages": 288,
    "url": "https://www.goodreads.com/book/show/18468256-grim",
    "year_published": 2013
}