{
    "author_name": "Michelle M. Pillow",
    "base_id": 77,
    "book_description": "Paranormal Dragonshifter Romance The would-be heroine… Aeron wants nothing more than to continue to live out her very long, solitary life in a small metal room listening to communications for the Federation Military. It’s not glamorous. It’s not even charming. But it’s safe. There’s no chance of getting hurt. When she intercepts a communication about the impeding genocide of the Qurilixian people, she has no choice but to act. No one at the Federation seems inclined to do anything about the threat and suddenly it’s up to her to save a whole planet. Enlisting the help of her degenerate sister, Aeron finds herself signed up as a prospective bride to the very barbarians she’s trying to save. The man who did not need saved… High Duke of Draig, Lord Bron, is not looking forward to his seventh failed attempt at a marriage ceremony, but when he sees the lovely Aeron he knows instantly his years of waiting have finally paid off. The gods have blessed him with a life mate… or have they? His new bride is insistent she’s not there for marriage, but for a mission. It’s up to Bron to convince her to stay, or risk spending the rest of his life alone.",
    "book_title": "His Highness the Duke",
    "editions": [
        "English"
    ],
    "genres": {
        "aliens": 18,
        "dragons": 20,
        "erotica": 11,
        "fantasy": 13,
        "futuristic": 8,
        "paranormal": 16,
        "paranormal romance": 15,
        "romance": 24,
        "science fiction": 24,
        "shapeshifters": 13
    },
    "inventory": [
        {
            "status": "available",
            "stock_number": "77_1"
        },
        {
            "status": "available",
            "stock_number": "77_2"
        },
        {
            "status": "on_loan",
            "stock_number": "77_3"
        },
        {
            "status": "available",
            "stock_number": "77_4"
        }
    ],
    "metrics": {
        "rating_votes": 1044,
        "score": 3.9
    },
    "original_book_title": "B006WP6RWC",
    "pages": 540,
    "url": "https://www.goodreads.com/book/show/13412430-his-highness-the-duke",
    "year_published": 2012
}