{
    "author_name": "Lara Adrian",
    "base_id": 816,
    "book_description": "In a frozen wilderness steeped in darkness, the lines between good and evil, lover and enemy, are never black or white but drawn in Shades of Midnight.Something inhuman is stalking the frigid Alaskan wilds, leaving unspeakable carnage in its wake. For bush pilot Alexandra Maguire, the killings stir memories of a horrific event she witnessed as a child and evoke in her the inexplicable sense of otherness she has long felt within herself but never fully understood . . . until a darkly seductive stranger with secrets of his own enters her world.Sent from Boston on a mission to investigate the savage attacks and stop the slaughter, vampire warrior Kade has his own reasons for returning to the frigid, forbidding place of his birth. Haunted by a secret shame, Kade soon realizes the stunning truth of the threat he faces–a threat that will jeopardize the fragile bond he has formed with the courageous, determined young woman who arouses his deepest passions and most primal hungers. But in bringing Alex into his world of blood and darkness, Kade must confront both his own personal demons and the even greater evil that could destroy all he holds dear.",
    "book_title": "Shades of Midnight",
    "editions": [
        "English"
    ],
    "genres": {
        "adult": 65,
        "contemporary": 27,
        "fantasy": 130,
        "fiction": 42,
        "paranormal": 471,
        "paranormal romance": 590,
        "romance": 301,
        "supernatural": 26,
        "urban fantasy": 76,
        "vampires": 445
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_number": "816_1"
        },
        {
            "status": "maintenance",
            "stock_number": "816_2"
        },
        {
            "status": "maintenance",
            "stock_number": "816_3"
        },
        {
            "status": "on_loan",
            "stock_number": "816_4"
        }
    ],
    "metrics": {
        "rating_votes": 25701,
        "score": 4.28
    },
    "original_book_title": "Shades of Midnight",
    "pages": 1187,
    "url": "https://www.goodreads.com/book/show/6481245-shades-of-midnight",
    "year_published": 2009
}