{
    "author_name": "Lara Adrian",
    "base_id": 868,
    "book_description": "AT THE CROSSROADS OF DEATH AND DESIRE, A WOMAN TASTES A PLEASURE NO MORTAL IS MEANT TO SURVIVE. In the frozen Alaskan wilderness, former state trooper Jenna Darrow survives an unspeakable breach of body and soul. But with her narrow escape comes an even greater challenge. For strange changes are taking place within her, as she struggles to understand—and control—a new hunger. To do so, she will seek shelter in the Boston compound of the Order, an ancient race of vampire warriors whose very existence is shrouded in mystery. Perhaps the most mysterious of them all is Brock, a brooding, dark-eyed alpha male whose hands hold the power to comfort, heal . . . and arouse. As she recovers under Brock’s care, Jenna finds herself drawn to the Order’s mission: to stop a ruthless enemy and its army of assassins from subjecting Earth to a reign of terror. Yet in spite of their resolve, a purely physical relationship without strings soon binds Brock and Jenna together with a desire fiercer than life and stronger than death itself—until a secret from Brock’s past and Jenna’s own mortality challenges their forbidden love to the ultimate trial by fire.",
    "book_title": "Taken by Midnight",
    "editions": [
        "English"
    ],
    "genres": {
        "adult": 63,
        "aliens": 25,
        "contemporary": 27,
        "fantasy": 125,
        "fiction": 40,
        "paranormal": 441,
        "paranormal romance": 550,
        "romance": 277,
        "urban fantasy": 72,
        "vampires": 412
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_number": "868_1"
        }
    ],
    "metrics": {
        "rating_votes": 22777,
        "score": 4.27
    },
    "original_book_title": "Taken by Midnight (Midnight Breed, #8)",
    "pages": 924,
    "url": "https://www.goodreads.com/book/show/7384801-taken-by-midnight",
    "year_published": 2010
}