{
    "author_name": "Gini Koch",
    "base_id": 92,
    "book_description": "When rumors of a new super-drug surface, the FBI comes to Jeff and Kitty Katt-Martini for help. It becomes quickly apparent that the drug is merely the tip of a deadly iceberg and a much more insidious plan is underway involving Titan Security, Gaultier Enterprises, and YatesCorp.As newly discovered A-Cs and hybrids begin to surface, each with expanded and deadly talents, more and more signs point to a new evil genius who’s using the A-Cs and their enemies both as guinea pigs. Then Area 51 and the Dulce Science Center go silent while Alpha Team, Airborne, and most of the worldwide A-C Security team are there for training. And if that’s not bad enough, Centaurion Division is hit with more bad, and deadly, news: Chernobog the Ultimate, isn’t a hacker myth, he’s a real person -- and he’s on the bad guys’ side.Now Kitty and company must find the real Dr. Feelgood and stop him or her before the latest version of Surcenthumain hits the streets and more people they love are harmed, or worse. But when the inconceivable happens, Kitty’s focused on two things only: reviving the ACE entity before their enemies realize Earth’s best protection isn’t actually active…and revenge.",
    "book_title": "Alien Research",
    "editions": [
        "English"
    ],
    "genres": {
        "aliens": 18,
        "contemporary": 4,
        "fantasy": 9,
        "fiction": 6,
        "humor": 8,
        "paranormal romance": 8,
        "romance": 13,
        "science fiction": 42,
        "science fiction romance": 5,
        "urban fantasy": 19
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_number": "92_1"
        },
        {
            "status": "maintenance",
            "stock_number": "92_2"
        },
        {
            "status": "on_loan",
            "stock_number": "92_3"
        },
        {
            "status": "on_loan",
            "stock_number": "92_4"
        },
        {
            "status": "maintenance",
            "stock_number": "92_5"
        },
        {
            "status": "available",
            "stock_number": "92_6"
        },
        {
            "status": "available",
            "stock_number": "92_7"
        }
    ],
    "metrics": {
        "rating_votes": 950,
        "score": 4.23
    },
    "original_book_title": "Alien Research",
    "pages": 901,
    "url": "https://www.goodreads.com/book/show/17148003-alien-research",
    "year_published": 2013
}