{
    "author_name": "Michelle M. Pillow",
    "base_id": 93,
    "book_description": "Divinity Warriors 1: Lilith EnrapturedSeries One of the Divinity UniverseAlternate Reality Romance / Parallel UniverseSorin of Firewall lives in a land forever at war. In fact, the Starian men are so busy fighting, their marriage ceremony has been reduced to a \"will of the gods\" event where they simply pick a woman out of a lineup and claim her as a wife. With women becoming scarce, it's necessary to trade the offworld Divinity Corporation for brides. Duty-bound to attend the ceremony, he has no intention of picking a bride, let alone one from another dimension. Duty-bound to attend the ceremony, he has no intention of picking a bride, let alone one from another dimension. That is, until he sees Lilith, the bewitching woman sent by the gods to reward--or punish?--him..Lilith, a data analyst for Divinity, is betrayed by the Corporation and wakes up in a primitive, uncharted dimension filled with warriors who only know war and duty. But her initial fears of becoming a sex slave to a big beefy knight become all too real when a warrior of god-like proportions claims she's his new woman. As Lilith discovers, there are worse fates than being the focus of Sorin's skillful and earthy seduction.Rating: Contains graphic sexual content, adult language, and violenceThis novel contains adult content. Mustbe 18 years or older to read.If you like this book, check out:Divinity Warriors Series1. Lilith Enraptured - ASIN: B006Z0L7S82. Fighting Lady Jayne - ASIN: B0076OCDVM3. Keeping Paige - ASIN: B007EKXYAW4. Taking Karre - ASIN: B007MJCB90Note: The Divinity Universe continues with the book Divinity Healers 1: Ariella's KeeperFor Info: MichellePillow.com",
    "book_title": "Lilith Enraptured",
    "editions": [
        "English"
    ],
    "genres": {
        "adult": 5,
        "aliens": 19,
        "erotica": 14,
        "fantasy": 16,
        "futuristic": 8,
        "paranormal": 14,
        "paranormal romance": 11,
        "romance": 23,
        "science fiction": 31,
        "science fiction romance": 8
    },
    "inventory": [
        {
            "status": "available",
            "stock_number": "93_1"
        },
        {
            "status": "available",
            "stock_number": "93_2"
        },
        {
            "status": "available",
            "stock_number": "93_3"
        },
        {
            "status": "maintenance",
            "stock_number": "93_4"
        }
    ],
    "metrics": {
        "rating_votes": 1136,
        "score": 3.73
    },
    "original_book_title": "Lilith Enraptured",
    "pages": 757,
    "url": "https://www.goodreads.com/book/show/43399860-lilith-enraptured",
    "year_published": 2009
}