{
    "author": "Tim Hamilton",
    "base_id": "1009",
    "description": "\"Monday burn Millay, Wednesday Whitman, Friday Faulkner, burn 'em to ashes, then burn the ashes.\"For Guy Montag, a career fireman for whom kerosene is perfume, this is not just an official slogan. It is a mantra, a duty, a way of life in a tightly monitored world where thinking is dangerous and books are forbidden.In 1953, Ray Bradbury envisioned one of the world's most unforgettable dystopian futures, and in Ray Bradbury's Fahrenheit 451, the artist Tim Hamilton translates this frightening modern masterpiece into a gorgeously imagined graphic novel. As could only occur with Bradbury's full cooperation in this authorized adaptation, Hamilton has created a striking work of art that uniquely captures Montag's awakening to the evil of government-controlled thought and the inestimable value of philosophy, theology, and literature.Including an original foreword by Ray Bradbury and fully depicting the brilliance and force of his canonic and beloved masterwork, Ray Bradbury's Fahrenheit 451 is an exceptional, haunting work of graphic literature.",
    "editions": [
        "english",
        "spanish"
    ],
    "genres": {
        "academic (school)": 17,
        "classics": 169,
        "fiction": 123,
        "graphic novels comics": 23,
        "science fiction": 129,
        "science fiction (dystopia)": 90,
        "science fiction fantasy": 14,
        "sequential art (comics)": 92,
        "sequential art (graphic novels)": 291,
        "young adult": 21
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "1009_1"
        },
        {
            "status": "on_loan",
            "stock_id": "1009_2"
        },
        {
            "status": "on_loan",
            "stock_id": "1009_3"
        }
    ],
    "metrics": {
        "rating_votes": 16745,
        "score": 3.91
    },
    "pages": 910,
    "title": "Fahrenheit 451: The Authorized Adaptation",
    "url": "https://www.goodreads.com/book/show/5199185-fahrenheit-451",
    "year_published": 2009
}