{
    "author": "Piers Platt",
    "base_id": "101",
    "description": "On the cut-throat streets of Tarkis, orphaned teens like Rath end up jailed … or dead. So when the shadowy Janus Group offers Rath a chance to earn riches beyond his wildest dreams, he seizes it. But the Janus Group is as ruthless as the elite assassins it controls. Rath will have to survive their grueling, off-world training, and fulfill all fifty kills in his contract before a single cent comes his way. And ending so many lives comes with a price Rath can't anticipate. It'll certainly cost him what's left of his innocence. It may well cost him his life. Interview with the Author Q - What makes the Janus Group series special?A - Growing up, I loved books like Ender's Game and the Tom Clancy Jack Ryan series. When I sat down to write the Janus Group books, I wanted to capture what I liked best about those books - sci fi thrillers or action thrillers in a fast-paced style. The series is best characterized as cyberpunk science fiction thrillers, with a little detective and police procedural elements thrown in to boot. Finally, I like my characters to be relatable, and facing overwhelming odds - the plot is action-packed, and keeps you guessing. Beware: plot twists ahead!Q - What order should I read the books in? A - Last Pursuit is a short story set in the Janus Group world - it's the prequel, and the story that inspired me to write a full series. You can read that first (for free), then Books 1-3 (Rath's Deception, Rath's Gambit, and Rath's Reckoning) in order from there. Books 1-3 are a complete story arc - Book 3 resolves everything from Books 1 and 2.Q - Why should readers give these books a try? A - Because the Janus Group books are fast, inventive, page-turners that kick ass and take names! They've been described as \"Jason Bourne\" meets \"Bladerunner.\" Any fans of hitman books, science fiction assassin tales, or cyberpunk thrillers will enjoy them.Q - Can readers get the whole series in one bundle? A - Not yet - sorry, just haven't had a chance to get around to it! But sign up for my newsletter at http://piersplatt.com/newsletter (copy and paste into your browser), or follow me on my author page here at Amazon to find out when I do release a bundle.Thanks for reading!The Janus Group Series eBook Categories:Sci fi actionSci fi thrillerCyberpunkGalactic Empire / Corporations / ConspiraciesBounty hunter / KillerAction adventure / Suspense / PulpCrime / Detective / Mystery / MurderAIs /Artificial intelligenceSpace / Space travelGenes / Genetic engineeringSpace warrior / Military",
    "editions": [
        "english"
    ],
    "genres": {
        "action": 3,
        "audiobook": 5,
        "business (amazon)": 3,
        "fantasy": 2,
        "fiction": 11,
        "science fiction": 39,
        "science fiction (cyberpunk)": 4,
        "space": 3,
        "space (space opera)": 4,
        "thriller": 5
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_id": "101_1"
        }
    ],
    "metrics": {
        "rating_votes": 1134,
        "score": 3.96
    },
    "pages": 555,
    "title": "Rath's Deception",
    "url": "https://www.goodreads.com/book/show/27404848-rath-s-deception",
    "year_published": 2015
}