{
    "author": "R. Lee Smith",
    "base_id": 1010,
    "description": "It was her last chance:Amber Bierce had nothing left except her sister and two tickets on Earth’s first colony-ship. She entered her Sleeper with a five-year contract and the promise of a better life, but awakened in wreckage on an unknown world. For the survivors, there is no rescue, no way home and no hope until they are found by Meoraq—a holy warrior more deadly than any hungering beast on this hostile new world…but whose eyes show a different sort of hunger when he looks at her.It was his last year of freedom:Uyane Meoraq is a Sword of Sheul, God’s own instrument of judgment, victor of hundreds of trials, with a conqueror’s rights over all men. Or at least he was until his father’s death. Now, without divine intervention, he will be forced to assume stewardship over House Uyane and lose the life he has always known. At the legendary temple of Xi’Matezh, Meoraq hopes to find the deliverance he seeks, but the humans he encounters on his pilgrimage may prove too great a test even for him…especially the one called Amber, behind whose monstrous appearance burns a woman’s heart unlike any he has ever known.",
    "editions": [
        "English"
    ],
    "genres": {
        "adult": 43,
        "aliens": 203,
        "dark": 104,
        "erotica": 45,
        "fantasy": 127,
        "horror": 36,
        "paranormal": 40,
        "romance": 232,
        "science fiction": 308,
        "science fiction romance": 48
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_id": "1010_1"
        },
        {
            "status": "available",
            "stock_id": "1010_2"
        },
        {
            "status": "on_loan",
            "stock_id": "1010_3"
        }
    ],
    "metrics": {
        "rating_votes": 5474,
        "score": 4.09
    },
    "pages": 1342,
    "title": "The Last Hour of Gann",
    "url": "https://www.goodreads.com/book/show/18589656-the-last-hour-of-gann",
    "year_published": 2013
}