{
    "author_name": "Vernor Vinge",
    "base_id": 1015,
    "book_description": "Alternative Cover Edition can be found here. After thousands of years searching, humans stand on the verge of first contact with an alien race. Two human groups: the Qeng Ho, a culture of free traders, and the Emergents, a ruthless society based on the technological enslavement of minds.The group that opens trade with the aliens will reap unimaginable riches. But first, both groups must wait at the aliens' very doorstep for their strange star to relight and for their planet to reawaken, as it does every two hundred and fifty years....Then, following terrible treachery, the Qeng Ho must fight for their freedom and for the lives of the unsuspecting innocents on the planet below, while the aliens themselves play a role unsuspected by the Qeng Ho and Emergents alike.More than just a great science fiction adventure, A Deepness in the Sky is a universal drama of courage, self-discovery, and the redemptive power of love. A Deepness in the Sky is a 1999 Nebula Award Nominee for Best Novel and the winner of the 2000 Hugo Award for Best Novel.",
    "book_title": "A Deepness in the Sky",
    "editions": [
        "English"
    ],
    "genres": {
        "aliens": 31,
        "fantasy": 26,
        "fiction": 341,
        "hard science fiction": 23,
        "hugo awards": 75,
        "science fiction": 1044,
        "science fiction fantasy": 57,
        "space": 23,
        "space opera": 138,
        "speculative fiction": 25
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_number": "1015_1"
        },
        {
            "status": "available",
            "stock_number": "1015_2"
        },
        {
            "status": "available",
            "stock_number": "1015_3"
        },
        {
            "status": "maintenance",
            "stock_number": "1015_4"
        },
        {
            "status": "available",
            "stock_number": "1015_5"
        },
        {
            "status": "maintenance",
            "stock_number": "1015_6"
        }
    ],
    "metrics": {
        "rating_votes": 29911,
        "score": 4.31
    },
    "original_book_title": "A Deepness in the Sky",
    "pages": 475,
    "url": "https://www.goodreads.com/book/show/226004.A_Deepness_in_the_Sky",
    "year_published": 1999
}