{
    "author": "Kresley Cole",
    "base_id": 1023,
    "description": "Kresley Cole - Untouchable (Immortals After Dark #7)#1 NEW YORK TIMES BESTSELLING AUTHOR KRESLEY COLE delivers a breathtaking tale of a brutal vampire soldier about to know love for the first time... and a Valkyrie aching for his touch.Murdoch Wroth will stop at nothing to claim Daniela - the delicate Valkyrie who makes his heart beat for the first time in three hundred years. Yet the exquisite Danii is part ice fey, and her freezing skin can't be touched by anyone but her own kind without inflicting pain beyond measure. Can they conquer an agony of frustration and slake the overwhelming desire burning between them?Gena Showalter - Tempt Me Eternally (Alien Huntress #4.5)NEW YORK TIMES AND USA TODAY BESTSELLING AUTHOR GENA SHOWALTER puts a daring spin on a tale of huntress and hunted... and concocts a sensual chemistry that is positively explosive.With only skin-to-skin contact, Aleaha Love can change her appearance, assume any identity. Now she’s an AIR (Alien Investigation and Removal) agent on a mission to capture a group of otherworldly warriors. Only she is held captive when dangerously seductive Breean, a golden-skinned, iron-willed commander, threatens her new life - and for the first time, Aleaha wants only to be herself.",
    "editions": [
        "English"
    ],
    "genres": {
        "Anthologies": 141,
        "adult": 92,
        "demons": 46,
        "fantasy": 200,
        "paranormal": 643,
        "paranormal romance": 809,
        "romance": 497,
        "supernatural": 50,
        "urban fantasy": 103,
        "vampires": 315
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_id": "1023_1"
        },
        {
            "status": "available",
            "stock_id": "1023_2"
        },
        {
            "status": "available",
            "stock_id": "1023_3"
        }
    ],
    "metrics": {
        "rating_votes": 30315,
        "score": 4.21
    },
    "pages": 653,
    "title": "Deep Kiss of Winter",
    "url": "https://www.goodreads.com/book/show/6294553-deep-kiss-of-winter",
    "year_published": 2009
}