{
    "author": "Jennifer L. Armentrout",
    "base_id": 1025,
    "description": "When Evelyn Dasher crossed paths with Luc, she was thrown headfirst into the world of the Lux—only to discover that she was already far more involved in their world than she ever suspected.Because the Luxen aren’t the only ones with a hidden past. There’s a gap in Evie’s memory, lost months of her life and a lingering sense that something happened, something she can’t remember and nobody is willing to tell her. She needs to find out the truth about who she is—and who she was. But every answer she finds only brings up more questions.Her search for the truth brings her ever closer to Luc, the Origin at the center of it all. He’s powerful, arrogant, inhumanly beautiful, extremely dangerous…and possibly in love with her. But even as Evie falls for him, she can’t help but wonder if his attraction is to her, or to the memory of a girl who no longer exists.And all the while, a new threat looms: reports of a flu-like, fatal virus that the government insists is being spread by Luxen. A horrifying illness that changes whoever it touches, spreading panic across a country already at its breaking point.#1 New York Times, USA Today, and internationally bestselling author Jennifer L. Armentrout returns to the world of the Lux with this steamy, shocking second installment of the Origin series that will leave readers reeling.",
    "editions": [
        "English"
    ],
    "genres": {
        "aliens": 87,
        "dystopia": 19,
        "fantasy": 127,
        "paranormal": 94,
        "paranormal romance": 30,
        "romance": 139,
        "science fiction": 65,
        "urban fantasy": 21,
        "young adult": 141,
        "young adult fantasy": 16
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_id": "1025_1"
        },
        {
            "status": "on_loan",
            "stock_id": "1025_2"
        }
    ],
    "metrics": {
        "rating_votes": 7351,
        "score": 4.37
    },
    "pages": 1307,
    "title": "The Burning Shadow",
    "url": "https://www.goodreads.com/book/show/43263224-the-burning-shadow",
    "year_published": 2019
}