{
    "author": "Jennifer L. Armentrout",
    "base_id": 10497,
    "description": "BEING CONNECTED TO DAEMON BLACK SUCKS… Thanks to his alien mojo, Daemon’s determined to prove what he feels for me is more than a product of our bizarro connection. So I’ve sworn him off, even though he’s running more hot than cold these days. But we’ve got bigger problems.SOMETHING WORSE THAN ARUM HAS COME TO TOWN The Department of Defense is here. If they ever find out what Daemon can do and that we’re linked, I’m a goner. So is he. And there’s this new boy in school who’s got a secret of his own. He knows what’s happened to me and he can help, but to do so, I have to lie to Daemon and stay away from him. Like that’s possible. Against all common sense, I’m falling for Daemon. Hard.BUT THEN, EVERYTHING CHANGES I’ve seen someone who shouldn’t be alive. And I have to tell Daemon, even though I know he’s never going to stop searching until he gets the truth. What happened to his brother? Who betrayed him? And what does the DOD want from them—from me?NO ONE IS WHO THEY SEEM. AND NOT EVERYONE WILL SURVIVE THE LIES.",
    "editions": [
        "English"
    ],
    "genres": {
        "aliens": 1304,
        "fantasy": 1595,
        "fiction": 192,
        "paranormal": 1819,
        "paranormal romance": 595,
        "romance": 1670,
        "science fiction": 775,
        "supernatural": 369,
        "urban fantasy": 277,
        "young adult": 2271
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "10497_1"
        },
        {
            "status": "on_loan",
            "stock_id": "10497_2"
        },
        {
            "status": "maintenance",
            "stock_id": "10497_3"
        },
        {
            "status": "maintenance",
            "stock_id": "10497_4"
        },
        {
            "status": "available",
            "stock_id": "10497_5"
        }
    ],
    "metrics": {
        "rating_votes": 153429,
        "score": 4.27
    },
    "pages": 546,
    "title": "Onyx",
    "url": "https://www.goodreads.com/book/show/13047090-onyx",
    "year_published": 2012
}