{
    "author": "Cory Doctorow",
    "id": "1073",
    "description": "Cory Doctorow’s first adult novel in eight years: an epic tale of revolution, love, post-scarcity, and the end of death.Hubert Vernon Rudolph Clayton Irving Wilson Alva Anton Jeff Harley Timothy Curtis Cleveland Cecil Ollie Edmund Eli Wiley Marvin Ellis Espinoza—known to his friends as Hubert, Etc—was too old to be at that Communist party.But after watching the breakdown of modern society, he really has no where left to be—except amongst the dregs of disaffected youth who party all night and heap scorn on the sheep they see on the morning commute. After falling in with Natalie, an ultra-rich heiress trying to escape the clutches of her repressive father, the two decide to give up fully on formal society—and walk away.After all, now that anyone can design and print the basic necessities of life—food, clothing, shelter—from a computer, there seems to be little reason to toil within the system.It’s still a dangerous world out there, the empty lands wrecked by climate change, dead cities hollowed out by industrial flight, shadows hiding predators animal and human alike. Still, when the initial pioneer walkaways flourish, more people join them. Then the walkaways discover the one thing the ultra-rich have never been able to buy: how to beat death. Now it’s war – a war that will turn the world upside down.Fascinating, moving, and darkly humorous, Walkaway is a multi-generation SF thriller about the wrenching changes of the next hundred years…and the very human people who will live their consequences.At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.",
    "editions": [
        "english",
        "spanish",
        "french"
    ],
    "genres": {
        "adult": 13,
        "audiobook": 18,
        "fantasy": 14,
        "fiction": 234,
        "novels": 17,
        "science fiction": 339,
        "science fiction (cyberpunk)": 24,
        "science fiction (dystopia)": 89,
        "science fiction fantasy": 14,
        "speculative fiction": 25
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_id": "1073_1"
        },
        {
            "status": "available",
            "stock_id": "1073_2"
        },
        {
            "status": "available",
            "stock_id": "1073_3"
        },
        {
            "status": "on_loan",
            "stock_id": "1073_4"
        },
        {
            "status": "maintenance",
            "stock_id": "1073_5"
        },
        {
            "status": "maintenance",
            "stock_id": "1073_6"
        }
    ],
    "metrics": {
        "rating_votes": 6385,
        "score": 3.74
    },
    "pages": 1323,
    "title": "Walkaway",
    "url": "https://www.goodreads.com/book/show/40604388-walkaway",
    "year_published": 2017
}