{
  "author": "John Twelve Hawks",
  "id": "1084",
  "description": "The Traveler explores a parallel world that exists alongside our own. A world that exists in the shadows of our own. A conflict we will never see. One woman stands between those determined to control history and those who will risk their lives for freedom.A world that exists in the shadows of our own.A conflict we will never see.One woman stands between those determined to control history and those who will risk their lives for freedom.Maya is hiding in plain sight in London. The twenty-six-year-old has abandoned the dangerous obligations pressed upon her by her father, and chosen instead to live a normal life. But Maya comes from a long line of people who call themselves Harlequins—a fierce group of warriors willing to sacrifice their lives to protect a select few known as Travelers.Gabriel and Michael Corrigan are brothers living in Los Angeles. Since childhood, the young men have been shaped by stories that their late father was a Traveler, one of a small band of prophets who have vastly influenced the course of history. Travelers are able to attain pure enlightenment, and have for centuries ushered change into the world. Gabriel and Michael, who may have inherited their father's gifts, have always protected themselves by living “off the Grid”—that is, invisible to the real-life surveillance networks that monitor people in our modern society.Summoned by her ailing father, Maya is told of the existence of the brothers. The Corrigans are in severe danger, stalked by powerful men known as the Tabula—ruthless mercenaries who have hunted Travelers for generations. This group is determined to inflict order on the world by controlling it, and they view Travelers as an intolerable threat. As Maya races to California to protect the brothers, she is reluctantly pulled back into the cold and solitary Harlequin existence. A colossal battle looms—one that will reveal not only the identities of Gabriel and Michael Corrigan but also a secret history of our time.Moving from the back alleys of Prague to the heart of Los Angeles, from the high deserts of Arizona to a guarded research facility in New York, The Traveler explores a parallel world that exists alongside our own. John Twelve Hawks' stunningly suspenseful debut is an international publishing sensation that marks the arrival of a major new talent.",
  "editions": [
    "english"
  ],
  "genres": [
    "action",
    "adventure",
    "audiobook",
    "fantasy",
    "fantasy (urban fantasy)",
    "fiction",
    "science fiction",
    "science fiction (dystopia)",
    "science fiction fantasy",
    "thriller"
  ],
  "inventory": [
    {
      "status": "on_loan",
      "stock_id": "1084_1"
    },
    {
      "status": "on_loan",
      "stock_id": "1084_2"
    },
    {
      "status": "maintenance",
      "stock_id": "1084_3"
    },
    {
      "status": "maintenance",
      "stock_id": "1084_4"
    },
    {
      "status": "on_loan",
      "stock_id": "1084_5"
    },
    {
      "status": "available",
      "stock_id": "1084_6"
    }
  ],
  "metrics": {
    "rating_votes": 10757,
    "score": 3.83
  },
  "pages": 532,
  "title": "The Traveler",
  "url": "https://www.goodreads.com/book/show/80754.The_Traveler",
  "year_published": 2005
}
