{
    "author": "Ben H. Winters",
    "base_id": "1105",
    "description": "A shocking vision of our future that is one part Minority Report and one part Chinatown.Lazlo Ratesic is 54, a 19-year veteran of the Speculative Service, from a family of law enforcement and in a strange alternate society that values law and truth above all else. This is how Laz must, by law, introduce himself, lest he fail to disclose his true purpose or nature, and by doing so, be guilty of a lie.Laz is a resident of The Golden State, a nation resembling California, where like-minded Americans retreated after the erosion of truth and the spread of lies made public life, and governance, increasingly impossible. There, surrounded by the high walls of compulsory truth-telling, knowingly contradicting the truth--the Objectively So--is the greatest possible crime. Stopping those crimes, punishing them, is Laz's job. In its service, he is one of the few individuals permitted to harbor untruths--to \"speculate\" on what might have happened in the commission of a crime.But the Golden State is far less a paradise than its name might suggest. To monitor, verify, and enforce the Objectively So requires a veritable panopticon of surveillance, recording, and record-keeping. And when those in control of the truth twist it for nefarious means, the Speculators may be the only ones with the power to fight back.",
    "editions": [
        "english",
        "spanish",
        "french"
    ],
    "genres": {
        "audiobook": 17,
        "fiction": 195,
        "mystery": 90,
        "mystery (crime)": 17,
        "science fiction": 156,
        "science fiction (dystopia)": 114,
        "science fiction fantasy": 24,
        "speculative fiction": 27,
        "thriller": 19,
        "thriller (mystery thriller)": 19
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_id": "1105_1"
        },
        {
            "status": "maintenance",
            "stock_id": "1105_2"
        }
    ],
    "metrics": {
        "rating_votes": 5974,
        "score": 3.49
    },
    "pages": 1159,
    "title": "Golden State",
    "url": "https://www.goodreads.com/book/show/39599913-golden-state",
    "year_published": 2019
}