{
    "author": "Rebecca Roanhorse",
    "base_id": "1116",
    "description": "It’s been four weeks since the bloody showdown at Black Mesa, and Maggie Hoskie, Diné monster hunter, is trying to make the best of things. Only her latest bounty hunt has gone sideways, she’s lost her only friend, Kai Arviso, and she’s somehow found herself responsible for a girl with a strange clan power.Then the Goodacre twins show up at Maggie’s door with the news that Kai and the youngest Goodacre, Caleb, have fallen in with a mysterious cult, led by a figure out of Navajo legend called the White Locust. The Goodacres are convinced that Kai’s a true believer, but Maggie suspects there’s more to Kai’s new faith than meets the eye. She vows to track down the White Locust, then rescue Kai and make things right between them.Her search leads her beyond the Walls of Dinétah and straight into the horrors of the Big Water world outside. With the aid of a motley collection of allies, Maggie must battle body harvesters, newborn casino gods and, ultimately, the White Locust himself. But the cult leader is nothing like she suspected, and Kai might not need rescuing after all. When the full scope of the White Locust’s plans are revealed, Maggie’s burgeoning trust in her friends, and herself, will be pushed to the breaking point, and not everyone will survive.",
    "editions": [
        "english"
    ],
    "genres": {
        "adult": 47,
        "apocalyptic (post apocalyptic)": 71,
        "fantasy": 586,
        "fantasy (magic)": 35,
        "fantasy (mythology)": 44,
        "fantasy (paranormal)": 34,
        "fantasy (urban fantasy)": 263,
        "fiction": 112,
        "science fiction": 63,
        "science fiction (dystopia)": 94
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "1116_1"
        },
        {
            "status": "available",
            "stock_id": "1116_2"
        },
        {
            "status": "available",
            "stock_id": "1116_3"
        },
        {
            "status": "maintenance",
            "stock_id": "1116_4"
        }
    ],
    "metrics": {
        "rating_votes": 6921,
        "score": 4.21
    },
    "pages": 905,
    "title": "Storm of Locusts",
    "url": "https://www.goodreads.com/book/show/37920490-storm-of-locusts",
    "year_published": 2019
}