{
    "author": "Presley Hall",
    "base_id": 112,
    "description": "Recently jobless and homeless, now I've been kidnapped by aliens.I thought my day couldn't get any worse… until the disgusting Orkun warlords who abducted me tell me I'm meant to be a \"bride\" for their commander.No! No freaking way.But before I can figure out a way off this spaceship, I find myself caught in the middle of an uprising by their other captives: a breathtakingly masculine gladiator race called Kalixians.With their bronze skin, horns, and rippling muscles, the Kalixians look like gods.Their leader, Tordax, is the most stunning of all. His touch sets off fireworks in my body, and I'm drawn to him in a way I can't understand-especially considering we don't even speak the same language.But am I really safer now, or have I just traded one captor for another?What does this powerful alien want with me?And why does he keep looking at me like I'm his?Claimed is a full-length standalone sci-fi romance featuring hot alien gladiators with huge… horns, a sassy heroine who finds her courage in space, and a possessive alpha hero who would do anything to protect his fated mate.If you like sexy aliens, sweeping adventure, and steamy romance, you’ll love this series. No cheating, no cliffhanger, and a happily ever after guaranteed!Fated Mates of the Kalixian Warriors series:Book 1: Claimed (Rose & Tordax)Book 2: Seized (Harper & Malav)Book 3: Rescued (Autumn & Sorsir)Book 4: BoundBook 5: Broken",
    "editions": [
        "English"
    ],
    "genres": {
        "adult": 3,
        "aliens": 20,
        "erotica": 5,
        "fantasy": 5,
        "paranormal": 4,
        "paranormal romance": 2,
        "romance": 15,
        "science fiction": 14,
        "science fiction romance": 12,
        "space": 2
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_id": "112_1"
        }
    ],
    "metrics": {
        "rating_votes": 1352,
        "score": 3.9
    },
    "pages": 676,
    "title": "Claimed",
    "url": "https://www.goodreads.com/book/show/51607596-claimed",
    "year_published": 2020
}