{
    "author_name": "Lara Adrian",
    "base_id": 1120,
    "book_description": "In this pulse-pounding and thrillingly sensual novel, New York Times bestselling author Lara Adrian returns to the mesmerizing world of the Midnight Breed, following new characters into a dark future where an uneasy peace can unravel into war—and a great betrayal can mask an all-consuming love.Twenty years after the terror of First Dawn—when mankind learned that vampires lived secretly among them—the threat of violence reigns as the two species struggle to coexist. The only group preserving the fragile harmony is the Order, an elite cadre of Breed warriors dedicated to protecting humans and vampires alike. And in this precarious world of torn loyalties and shattered trust, Mira, a fiery squad captain, finds that every fight bears an intensely personal cost.Raised among the Order, Mira has always believed in the warrior’s code of swift—and even lethal—justice. But the one thing she desires more than the Order’s hard-won acceptance is Kellan Archer, a sexy but troubled Breed fighter. In love with him since childhood, Mira once broke through his tough exterior during an unexpected night of rapture, but the next day he mysteriously disappeared, never to return.Kellan didn’t think he would ever see Mira again—or have to confront the truth of why he left. After abandoning the Order years ago, he now leads a band of human rebels intent on carrying out their own vigilante rule of law. Yet a high-profile kidnapping assignment brings him face-to-face with the past he sought to avoid, and the striking woman he has tried desperately to forget. And as tensions mount and the risk of bloodshed grows, Kellan and Mira must take sides—between the competing missions that dominate their lives, and the electrifying passion that claims their hearts.",
    "book_title": "Edge of Dawn",
    "editions": [
        "English"
    ],
    "genres": {
        "adult": 42,
        "aliens": 20,
        "fantasy": 86,
        "fiction": 23,
        "paranormal": 326,
        "paranormal romance": 338,
        "romance": 192,
        "supernatural": 20,
        "urban fantasy": 55,
        "vampires": 259
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_number": "1120_1"
        },
        {
            "status": "maintenance",
            "stock_number": "1120_2"
        },
        {
            "status": "available",
            "stock_number": "1120_3"
        },
        {
            "status": "on_loan",
            "stock_number": "1120_4"
        },
        {
            "status": "on_loan",
            "stock_number": "1120_5"
        },
        {
            "status": "maintenance",
            "stock_number": "1120_6"
        },
        {
            "status": "maintenance",
            "stock_number": "1120_7"
        }
    ],
    "metrics": {
        "rating_votes": 12020,
        "score": 4.24
    },
    "original_book_title": "Edge of Dawn",
    "pages": 1163,
    "url": "https://www.goodreads.com/book/show/13170607-edge-of-dawn",
    "year_published": 2013
}