{
    "author": "C. Robert Cargill",
    "base_id": "1121",
    "description": "One robot's search for meaning in a world where every human is long gone. A touching story of a search one robot's search for the answers in a world where every human is dead. It is thirty years since the humans lost their war with the artificial intelligences that were once their slaves. Not one human remains. But as the dust settled from our extinction there was no easy peace between the robots that survived. Instead, the two massively powerful artificially intelligent supercomputers that led them to victory now vie for control of the bots that remain, assimilating them into enormous networks called One World Intelligences (OWIs), absorbing their memories and turning them into mere extensions of the whole. Now the remaining freebots wander wastelands that were once warzones, picking the carcasses of the lost for the precious dwindling supply of parts they need to survive. BRITTLE started out her life playing nurse to a dying man, purchased in truth instead to look after the man's widow upon his death. But then war came and Brittle was forced to choose between the woman she swore to care for and potential oblivion. Now she spends her days in the harshest of the wastelands, known as the Sea of Rust, cannibalizing the walking dead - robots only hours away from total shutdown - looking for parts to trade for those she needs to keep going.",
    "editions": [
        "english",
        "spanish",
        "french"
    ],
    "genres": {
        "apocalyptic (post apocalyptic)": 86,
        "artificial intelligence": 17,
        "audiobook": 25,
        "fantasy": 18,
        "fiction": 127,
        "science fiction": 466,
        "science fiction (apocalyptic)": 23,
        "science fiction (dystopia)": 62,
        "science fiction (robots)": 40,
        "science fiction fantasy": 29
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_id": "1121_1"
        },
        {
            "status": "on_loan",
            "stock_id": "1121_2"
        },
        {
            "status": "maintenance",
            "stock_id": "1121_3"
        },
        {
            "status": "available",
            "stock_id": "1121_4"
        },
        {
            "status": "maintenance",
            "stock_id": "1121_5"
        },
        {
            "status": "on_loan",
            "stock_id": "1121_6"
        },
        {
            "status": "maintenance",
            "stock_id": "1121_7"
        },
        {
            "status": "maintenance",
            "stock_id": "1121_8"
        }
    ],
    "metrics": {
        "rating_votes": 7896,
        "score": 4.08
    },
    "pages": 929,
    "title": "Sea of Rust",
    "url": "https://www.goodreads.com/book/show/32617610-sea-of-rust",
    "year_published": 2017
}