{
    "author": "John Scalzi",
    "base_id": 1130,
    "description": "Hugo-award winning author, John Scalzi returns to his best-selling Old Man's War universe with the direct sequel to 2013’s The Human DivisionHumans expanded into space…only to find a universe populated with multiple alien species bent on their destruction. Thus was the Colonial Union formed, to help protect us from a hostile universe. The Colonial Union used the Earth and its excess population for colonists and soldiers. It was a good arrangement...for the Colonial Union. Then the Earth said: no more.　Now the Colonial Union is living on borrowed time—a couple of decades at most, before the ranks of the Colonial Defense Forces are depleted and the struggling human colonies are vulnerable to the alien species who have been waiting for the first sign of weakness, to drive humanity to ruin. And there’s another problem: A group, lurking in the darkness of space, playing human and alien against each other—and against their own kind —for their own unknown reasons.　In this collapsing universe, CDF Lieutenant Harry Wilson and the Colonial Union diplomats he works with race against the clock to discover who is behind attacks on the Union and on alien races, to seek peace with a suspicious, angry Earth, and keep humanity’s union intact...or else risk oblivion, and extinction—and the end of all things.",
    "editions": [
        "English"
    ],
    "genres": {
        "aliens": 25,
        "audiobook": 43,
        "fantasy": 12,
        "fiction": 169,
        "military fiction": 24,
        "military science fiction": 18,
        "science fiction": 748,
        "science fiction fantasy": 42,
        "space": 28,
        "space opera": 116
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_id": "1130_1"
        },
        {
            "status": "on_loan",
            "stock_id": "1130_2"
        },
        {
            "status": "maintenance",
            "stock_id": "1130_3"
        },
        {
            "status": "maintenance",
            "stock_id": "1130_4"
        },
        {
            "status": "available",
            "stock_id": "1130_5"
        },
        {
            "status": "available",
            "stock_id": "1130_6"
        },
        {
            "status": "maintenance",
            "stock_id": "1130_7"
        },
        {
            "status": "on_loan",
            "stock_id": "1130_8"
        },
        {
            "status": "available",
            "stock_id": "1130_9"
        }
    ],
    "metrics": {
        "rating_votes": 18711,
        "score": 3.98
    },
    "pages": 961,
    "title": "The End of All Things",
    "url": "https://www.goodreads.com/book/show/23168809-the-end-of-all-things",
    "year_published": 2015
}