{
    "author": "GraceGoodwin",
    "base_id": 115,
    "description": "Desperate to escape a powerful man set on making an example of her for daring to defy him, Leah’s only option is to volunteer for the Interstellar Bride Program. She is assigned to the planet Viken, but upon her arrival she is shocked to discover that she has been matched to not one huge, handsome warrior, but three of them.Drogan, Tor, and Lev were born as identical triplets to the royal family of Viken, but they were separated at birth in a last ditch effort to prevent a catastrophic war. In the years since a fragile peace has held, but now a terrible threat from deep space is growing more pressing by the day and there is only one way for the three brothers to save their people. They must take a mate and produce a sole heir to the throne as soon as possible.Though being shared by three men is far from what she expected when she left Earth, Leah cannot hide her intense arousal as the brothers begin to teach her what it means to be mastered by warriors of Viken. It isn’t long before her hesitance to fully submit to her dominant husbands earns Leah a sound spanking on her bare bottom, yet even that shameful chastisement merely increases her desire for them. With her own future and that of the planet at stake, will she stubbornly resist her body’s demands, or will she surrender herself to be claimed by her mates?Publisher’s Note: Claimed by Her Mates is a stand-alone book set in the same world as Assigned a Mate and Mated to the Warriors. It is an erotic romance novel that includes spankings, sexual scenes, elements of BDSM, and more. If such material offends you, please don’t buy this book.",
    "editions": [
        "English"
    ],
    "genres": {
        "adult": 8,
        "aliens": 17,
        "bdsm": 14,
        "erotica": 27,
        "fantasy": 8,
        "paranormal": 9,
        "paranormal romance": 10,
        "romance": 29,
        "science fiction": 21
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_id": "115_1"
        },
        {
            "status": "maintenance",
            "stock_id": "115_2"
        },
        {
            "status": "maintenance",
            "stock_id": "115_3"
        },
        {
            "status": "available",
            "stock_id": "115_4"
        },
        {
            "status": "maintenance",
            "stock_id": "115_5"
        },
        {
            "status": "available",
            "stock_id": "115_6"
        },
        {
            "status": "on_loan",
            "stock_id": "115_7"
        }
    ],
    "metrics": {
        "rating_votes": 1857,
        "score": 3.85
    },
    "pages": 1238,
    "title": "Claimed By Her Mates",
    "url": "https://www.goodreads.com/book/show/30056457-claimed-by-her-mates",
    "year_published": 2016
}