{
    "author": "Amie Kaufman",
    "base_id": 11594,
    "description": "Moving to a space station at the edge of the galaxy was always going to be the death of Hanna’s social life. Nobody said it might actually get her killed.The sci-fi saga that began with the breakout bestseller Illuminae continues on board the Jump Station Heimdall, where two new characters will confront the next wave of the BeiTech assault.Hanna is the station captain’s pampered daughter; Nik the reluctant member of a notorious crime family. But while the pair are struggling with the realities of life aboard the galaxy’s most boring space station, little do they know that Kady Grant and the Hypatia are headed right toward Heimdall, carrying news of the Kerenza invasion.When an elite BeiTech strike team invades the station, Hanna and Nik are thrown together to defend their home. But alien predators are picking off the station residents one by one, and a malfunction in the station’s wormhole means the space-time continuum might be ripped in two before dinner. Soon Hanna and Nik aren’t just fighting for their own survival; the fate of everyone on the Hypatia—and possibly the known universe—is in their hands.But relax. They’ve totally got this. They hope.",
    "editions": [
        "English"
    ],
    "genres": {
        "adventure": 141,
        "audiobook": 314,
        "dystopia": 203,
        "fantasy": 340,
        "fiction": 357,
        "romance": 437,
        "science fiction": 2239,
        "space": 202,
        "young adult": 1864,
        "young adult science fiction": 94
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "11594_1"
        },
        {
            "status": "on_loan",
            "stock_id": "11594_2"
        },
        {
            "status": "available",
            "stock_id": "11594_3"
        },
        {
            "status": "available",
            "stock_id": "11594_4"
        },
        {
            "status": "maintenance",
            "stock_id": "11594_5"
        },
        {
            "status": "maintenance",
            "stock_id": "11594_6"
        },
        {
            "status": "maintenance",
            "stock_id": "11594_7"
        },
        {
            "status": "available",
            "stock_id": "11594_8"
        },
        {
            "status": "maintenance",
            "stock_id": "11594_9"
        }
    ],
    "metrics": {
        "rating_votes": 60123,
        "score": 4.46
    },
    "pages": 1051,
    "title": "Gemina",
    "url": "https://www.goodreads.com/book/show/29236299-gemina",
    "year_published": 2016
}