{
    "author": "Lia Black",
    "base_id": 117,
    "description": "Librarian's Note: This is an alternate/new cover for ASIN B00LR78V6UUndercover agent Alex Kley is a long way from home. Six months of investigation have brought him to Willow House, a high class brothel on Omanai Station, as beautiful on the outside as it is corrupt on the inside. Sold into sexual slavery to infiltrate an illegal prostitution ring, Alex must find the evidence he needs to bring down the leader of a powerful criminal cartel—a man who may not even be human. Illythe, the manager of Willow House, is a long way from freedom. The jet-skinned beauty with the face of an angel walks the halls of Willow House with serenity and authority, but underneath his cold and beautiful facade, Illythe is as much a slave as any of the young men working in the brothel. In an undercover operation, falling in love is the worst thing an agent can do, but Illythe is a mystery that Alex can’t resist. It doesn’t take long for Alex to realize that Illythe is not in his role by choice. Yet Illythe holds the holds the information Alex needs. The more Alex learns, the clearer it becomes, that when the cartel falls, Illythe will be buried in the rubble. In the end, Alex must make a choice: save Illythe and forfeit the mission, or leave him behind in a place where willows won’t grow. Important Note to Readers: This work of fiction is for adults only. Please see content warnings in \"story info\" front matter before download. This story was written as part of the M/M Romance Group’s 2014 “Love's Landscapes” event.",
    "editions": [
        "English"
    ],
    "genres": {
        "abuse": 19,
        "aliens": 17,
        "bdsm": 41,
        "dark": 18,
        "erotica": 11,
        "fantasy": 18,
        "futuristic": 9,
        "male male romance": 72,
        "romance": 25,
        "science fiction": 49
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "117_1"
        },
        {
            "status": "maintenance",
            "stock_id": "117_2"
        },
        {
            "status": "on_loan",
            "stock_id": "117_3"
        },
        {
            "status": "on_loan",
            "stock_id": "117_4"
        },
        {
            "status": "on_loan",
            "stock_id": "117_5"
        },
        {
            "status": "available",
            "stock_id": "117_6"
        },
        {
            "status": "maintenance",
            "stock_id": "117_7"
        }
    ],
    "metrics": {
        "rating_votes": 562,
        "score": 3.72
    },
    "pages": 1000,
    "title": "Where Willows Won't Grow",
    "url": "https://www.goodreads.com/book/show/23484561-where-willows-won-t-grow",
    "year_published": 2014
}