{
  "author": "J.R.R. Tolkien",
  "id": "11835",
  "description": "One Ring to rule them all, One Ring to find them, One Ring to bring them all and in the darkness bind themIn ancient times the Rings of Power were crafted by the Elven-smiths, and Sauron, the Dark Lord, forged the One Ring, filling it with his own power so that he could rule all others. But the One Ring was taken from him, and though he sought it throughout Middle-earth, it remained lost to him. After many ages it fell by chance into the hands of the hobbit Bilbo Baggins.From Sauron's fastness in the Dark Tower of Mordor, his power spread far and wide. Sauron gathered all the Great Rings to him, but always he searched for the One Ring that would complete his dominion.When Bilbo reached his eleventy-first birthday he disappeared, bequeathing to his young cousin Frodo the Ruling Ring and a perilous quest: to journey across Middle-earth, deep into the shadow of the Dark Lord, and destroy the Ring by casting it into the Cracks of Doom.The Lord of the Rings tells of the great quest undertaken by Frodo and the Fellowship of the Ring: Gandalf the Wizard; the hobbits Merry, Pippin, and Sam; Gimli the Dwarf; Legolas the Elf; Boromir of Gondor; and a tall, mysterious stranger called Strider.",
  "editions": [
    "english"
  ],
  "genres": [
    "adventure",
    "classics",
    "fantasy",
    "fantasy (epic fantasy)",
    "fantasy (high fantasy)",
    "fiction",
    "literature",
    "novels",
    "science fiction fantasy",
    "young adult"
  ],
  "inventory": [
    {
      "status": "on_loan",
      "stock_id": "11835_1"
    },
    {
      "status": "on_loan",
      "stock_id": "11835_2"
    },
    {
      "status": "available",
      "stock_id": "11835_3"
    },
    {
      "status": "maintenance",
      "stock_id": "11835_4"
    },
    {
      "status": "available",
      "stock_id": "11835_5"
    }
  ],
  "metrics": {
    "rating_votes": 581951,
    "score": 4.5
  },
  "pages": 285,
  "title": "The Lord of the Rings",
  "url": "https://www.goodreads.com/book/show/33.The_Lord_of_the_Rings",
  "year_published": 1955
}
