{
    "author": "James Dashner",
    "base_id": "1201",
    "description": "From the New York Times bestselling author of the Maze Runner series comes The Rule of Thoughts, the exciting sequel to The Eye of Minds. Fans of the Divergent series by Veronica Roth and The Hunger Games will love the new Mortality Doctrine series.  Michael completed the Path. What he found at the end turned everything he’d ever known about his life—and the world—completely upside down.He barely survived. But it was the only way VirtNet Security knew to find the cyber-terrorist Kaine—and to make the Sleep safe for gamers once again. And, the truth Michael discovered about Kaine is more complex than they anticipated, and more terrifying than even the worst of their fears.Kaine is a tangent, a computer program that has become sentient. And Michael’s completing the Path was the first stage in turning Kaine’s master plan, the Mortality Doctrine, into a reality.The Mortality Doctrine will populate Earth entirely with human bodies harboring tangent minds. Any gamer who sinks into the VirtNet risks coming out with a tangent intelligence in control of their body. And the takeover has already begun.",
    "editions": [
        "english"
    ],
    "genres": {
        "action": 15,
        "adventure": 37,
        "fantasy": 69,
        "fiction": 64,
        "mystery": 16,
        "science fiction": 214,
        "science fiction (dystopia)": 127,
        "science fiction (virtual reality)": 15,
        "young adult": 240,
        "young adult (teen)": 18
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_id": "1201_1"
        },
        {
            "status": "on_loan",
            "stock_id": "1201_2"
        },
        {
            "status": "maintenance",
            "stock_id": "1201_3"
        },
        {
            "status": "maintenance",
            "stock_id": "1201_4"
        },
        {
            "status": "maintenance",
            "stock_id": "1201_5"
        }
    ],
    "metrics": {
        "rating_votes": 15514,
        "score": 3.98
    },
    "pages": 1380,
    "title": "The Rule of Thoughts",
    "url": "https://www.goodreads.com/book/show/17700320-the-rule-of-thoughts",
    "year_published": 2014
}