{
    "author": "Karen Thompson Walker",
    "id": "12062",
    "description": "“It’s never the disasters you see coming that finally come to pass—it’s the ones you don’t expect at all,” says Julia, in this spellbinding novel of catastrophe and survival by a superb new writer. Luminous, suspenseful, unforgettable, The Age of Miracles tells the haunting and beautiful story of Julia and her family as they struggle to live in a time of extraordinary change.   On an ordinary Saturday in a California suburb, Julia awakens to discover that something has happened to the rotation of the earth. The days and nights are growing longer and longer; gravity is affected; the birds, the tides, human behavior, and cosmic rhythms are thrown into disarray. In a world that seems filled with danger and loss, Julia also must face surprising developments in herself, and in her personal world: divisions widening between her parents; strange behavior by her friends; the pain and vulnerability of first love; a growing sense of isolation; and a surprising, rebellious new strength. With crystalline prose and the indelible magic of a born storyteller, Karen Thompson Walker paints a breathtaking portrait of people finding ways to go on in an ever-evolving world.",
    "editions": [
        "english",
        "spanish",
        "french"
    ],
    "genres": {
        "adult": 160,
        "adult fiction": 172,
        "apocalyptic (post apocalyptic)": 181,
        "audiobook": 155,
        "fantasy": 208,
        "fiction": 1648,
        "science fiction": 819,
        "science fiction (dystopia)": 465,
        "young adult": 905,
        "young adult (coming of age)": 307
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "12062_1"
        },
        {
            "status": "maintenance",
            "stock_id": "12062_2"
        },
        {
            "status": "maintenance",
            "stock_id": "12062_3"
        },
        {
            "status": "available",
            "stock_id": "12062_4"
        },
        {
            "status": "on_loan",
            "stock_id": "12062_5"
        },
        {
            "status": "maintenance",
            "stock_id": "12062_6"
        }
    ],
    "metrics": {
        "rating_votes": 89171,
        "score": 3.65
    },
    "pages": 739,
    "title": "The Age of Miracles",
    "url": "https://www.goodreads.com/book/show/12401556-the-age-of-miracles",
    "year_published": 2012
}