{
    "author": "Mike Chen",
    "base_id": "1231",
    "description": "To save his daughter, he’ll go anywhere—and any-when…Kin Stewart is an everyday family man: working in IT, trying to keep the spark in his marriage, struggling to connect with his teenage daughter, Miranda. But his current life is a far cry from his previous career…as a time-traveling secret agent from 2142.Stranded in suburban San Francisco since the 1990s after a botched mission, Kin has kept his past hidden from everyone around him, despite the increasing blackouts and memory loss affecting his time-traveler’s brain. Until one afternoon, his “rescue” team arrives—eighteen years too late.Their mission: return Kin to 2142, where he’s only been gone weeks, not years, and where another family is waiting for him. A family he can’t remember.Torn between two lives, Kin is desperate for a way to stay connected to both. But when his best efforts threaten to destroy the agency and even history itself, his daughter’s very existence is at risk. It’ll take one final trip across time to save Miranda—even if it means breaking all the rules of time travel in the process.A uniquely emotional genre-bending debut, Here and Now and Then captures the perfect balance of heart, playfulness, and imagination, offering an intimate glimpse into the crevices of a father’s heart and its capacity to stretch across both space and time to protect the people that mean the most.",
    "editions": [
        "english",
        "spanish"
    ],
    "genres": {
        "adult": 50,
        "adult fiction": 14,
        "audiobook": 38,
        "family": 21,
        "fantasy": 82,
        "fiction": 225,
        "science fiction": 395,
        "science fiction (time travel)": 353,
        "science fiction fantasy": 32,
        "speculative fiction": 26
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_id": "1231_1"
        }
    ],
    "metrics": {
        "rating_votes": 6046,
        "score": 3.76
    },
    "pages": 1118,
    "title": "Here and Now and Then",
    "url": "https://www.goodreads.com/book/show/39217756-here-and-now-and-then",
    "year_published": 2019
}