{
    "author": "Mina Carter",
    "base_id": 124,
    "description": "She’s pregnant without nookie. Someone slap her ass and call her Mary…A ‘guest’ of the Lathar, Jess has become used to being at court, especially as it allows her to be close to a certain tall, handsome healer. But Laarn might as well not know she exists, far more interested in his tests and her genetic code than her as a woman… maybe. A hot encounter after a combat trial prove that Laarn HAS noticed her, more than noticed her. But before they can act on the attraction between them, Laarn is called away to the battlefield leaving Jess all alone at court.Not wanting to bother any of the other healers when she feels unwell, Jess gets treatment from the automated systems in Laarn’s lab, only to get worse days later. She’s pregnant, without a sniff of between the sheets action and worse, there’s a bunch of fanatics loose in the palace trying to kill her and her baby…He aches to claim her, but saving his people must come first. To do that, he can’t waste time with a female…Lord Healer for the Lathar, Laarn must find a way to save his people from the plague that claimed all their women a generation ago. Now it is speeding up and if he doesn’t do something, the Lathar will be gone in a generation. Salvation arrives in the form of humanity, descendants of a lost Lathar colony, who might just hold the key to reversing the damage to the Lathar genetic code.His scars mark his rank, but will they also lose him the woman he loves?Laarn never thought anything of his scars before. In his culture they mark his rank as the best healer in the empire, but he starts to cover them when Jessica, the delicate little human female who holds his interest, won’t look at them. He wants her, but his duty lies elsewhere until everything changes…Between a pregnancy, mating marks and a fanatic out to kill the woman he loves, can Laarn remain detached enough to do his duty… or will he give into emotion and save his heart?",
    "editions": [
        "English"
    ],
    "genres": {
        "adult": 4,
        "aliens": 25,
        "erotica": 7,
        "fantasy": 3,
        "military fiction": 3,
        "paranormal": 10,
        "paranormal romance": 5,
        "romance": 27,
        "science fiction": 25,
        "science fiction romance": 12
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "124_1"
        },
        {
            "status": "on_loan",
            "stock_id": "124_2"
        },
        {
            "status": "maintenance",
            "stock_id": "124_3"
        },
        {
            "status": "available",
            "stock_id": "124_4"
        },
        {
            "status": "on_loan",
            "stock_id": "124_5"
        }
    ],
    "metrics": {
        "rating_votes": 1423,
        "score": 4.27
    },
    "pages": 388,
    "title": "Pregnant by the Alien Healer",
    "url": "https://www.goodreads.com/book/show/36289717-pregnant-by-the-alien-healer",
    "year_published": 2017
}