{
    "author": "Becky Chambers",
    "base_id": 12511,
    "description": "Follow a motley crew on an exciting journey through space-and one adventurous young explorer who discovers the meaning of family in the far reaches of the universe-in this light-hearted debut space opera from a rising sci-fi star.Rosemary Harper doesn’t expect much when she joins the crew of the aging Wayfarer. While the patched-up ship has seen better days, it offers her a bed, a chance to explore the far-off corners of the galaxy, and most importantly, some distance from her past. An introspective young woman who learned early to keep to herself, she’s never met anyone remotely like the ship’s diverse crew, including Sissix, the exotic reptilian pilot, chatty engineers Kizzy and Jenks who keep the ship running, and Ashby, their noble captain.Life aboard the Wayfarer is chaotic and crazy—exactly what Rosemary wants. It’s also about to get extremely dangerous when the crew is offered the job of a lifetime. Tunneling wormholes through space to a distant planet is definitely lucrative and will keep them comfortable for years. But risking her life wasn’t part of the plan. In the far reaches of deep space, the tiny Wayfarer crew will confront a host of unexpected mishaps and thrilling adventures that force them to depend on each other. To survive, Rosemary’s got to learn how to rely on this assortment of oddballs—an experience that teaches her about love and trust, and that having a family isn’t necessarily the worst thing in the universe.",
    "editions": [
        "English"
    ],
    "genres": {
        "adult": 350,
        "audiobook": 282,
        "fantasy": 310,
        "fiction": 1326,
        "lgbt": 708,
        "queer": 353,
        "science fiction": 4289,
        "science fiction fantasy": 283,
        "space": 339,
        "space opera": 575
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "12511_1"
        },
        {
            "status": "available",
            "stock_id": "12511_2"
        },
        {
            "status": "maintenance",
            "stock_id": "12511_3"
        }
    ],
    "metrics": {
        "rating_votes": 80637,
        "score": 4.15
    },
    "pages": 1022,
    "title": "The Long Way to a Small, Angry Planet",
    "url": "https://www.goodreads.com/book/show/22733729-the-long-way-to-a-small-angry-planet",
    "year_published": 2014
}