{
    "author": "Pierce Brown",
    "base_id": "12596",
    "description": "As a Red, Darrow grew up working the mines deep beneath the surface of Mars, enduring backbreaking labor while dreaming of the better future he was building for his descendants. But the Society he faithfully served was built on lies. Darrow’s kind have been betrayed and denied by their elitist masters, the Golds—and their only path to liberation is revolution. And so Darrow sacrifices himself in the name of the greater good for which Eo, his true love and inspiration, laid down her own life. He becomes a Gold, infiltrating their privileged realm so that he can destroy it from within. A lamb among wolves in a cruel world, Darrow finds friendship, respect, and even love—but also the wrath of powerful rivals. To wage and win the war that will change humankind’s destiny, Darrow must confront the treachery arrayed against him, overcome his all-too-human desire for retribution—and strive not for violent revolt but a hopeful rebirth. Though the road ahead is fraught with danger and deceit, Darrow must choose to follow Eo’s principles of love and justice to free his people. He must live for more.",
    "editions": [
        "english",
        "spanish",
        "french"
    ],
    "genres": {
        "adult": 192,
        "adventure": 162,
        "audiobook": 311,
        "fantasy": 1460,
        "fiction": 1072,
        "science fiction": 2787,
        "science fiction (dystopia)": 1043,
        "science fiction fantasy": 206,
        "space": 142,
        "young adult": 928
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_id": "12596_1"
        },
        {
            "status": "available",
            "stock_id": "12596_2"
        },
        {
            "status": "available",
            "stock_id": "12596_3"
        }
    ],
    "metrics": {
        "rating_votes": 153097,
        "score": 4.44
    },
    "pages": 226,
    "title": "Golden Son",
    "url": "https://www.goodreads.com/book/show/18966819-golden-son",
    "year_published": 2015
}