{
    "author": "Ninni Holmqvist",
    "base_id": "1259",
    "description": "One day in early spring, Dorrit Weger is checked into the Second Reserve Bank Unit for biological material. She is promised a nicely furnished apartment inside the Unit, where she will make new friends, enjoy the state of the art recreation facilities, and live the few remaining days of her life in comfort with people who are just like her. Here, women over the age of fifty and men over sixty-single, childless, and without jobs in progressive industries--are sequestered for their final few years; they are considered outsiders.In the Unit they are expected to contribute themselves for drug and psychological testing, and ultimately donate their organs, little by little, until the final donation. Despite the ruthless nature of this practice, the ethos of this near-future society and the Unit is to take care of others, and Dorrit finds herself living under very pleasant conditions: well-housed, well-fed, and well-attended. She is resigned to her fate and discovers her days there to be rather consoling and peaceful.But when she meets a man inside the Unit and falls in love, the extraordinary becomes a reality and life suddenly turns unbearable. Dorrit is faced with compliance or escape, and...well, then what?",
    "editions": [
        "english"
    ],
    "genres": {
        "adult": 24,
        "adult fiction": 24,
        "cultural (sweden)": 27,
        "european literature (scandinavian literature)": 18,
        "european literature (swedish literature)": 24,
        "fiction": 287,
        "science fiction": 187,
        "science fiction (dystopia)": 254,
        "science fiction fantasy": 24,
        "speculative fiction": 33
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_id": "1259_1"
        },
        {
            "status": "maintenance",
            "stock_id": "1259_2"
        }
    ],
    "metrics": {
        "rating_votes": 8443,
        "score": 3.73
    },
    "pages": 1321,
    "title": "The Unit",
    "url": "https://www.goodreads.com/book/show/5730888-the-unit",
    "year_published": 2006
}