{
    "author": "Lionel Shriver",
    "base_id": "1289",
    "description": "The year is 2029, and nothing is as it should be. The very essence of American life, the dollar, is under attack. In a coordinated move by the rest of the world’s governments, the dollar loses all its value. The American President declares that the States will default on all its loans–prices skyrocket, currency becomes essentially worthless, and we watch one family struggle to survive through it all.The Mandibles can count on their inheritance no longer, and each member must come to terms with this in their own way–from the elegant expat author Nollie, in her middle age, returning to the U.S. from Paris after many years abroad, to her precocious teenage nephew Willing, who is the only one to actually understand the crisis, to the brilliant Georgetown economics professor Lowell, who watches his whole vision of the world disintegrate before his eyes.As ever, in her new novel, Shriver draws larger than life characters who illuminate this complicated, ever-changing world. One of our sharpest observers of human nature, Shriver challenges us to think long and hard about the society we live in and what, ultimately, we hold most dear.",
    "editions": [
        "english",
        "spanish"
    ],
    "genres": {
        "contemporary": 9,
        "economics": 26,
        "fiction": 295,
        "literary fiction": 16,
        "novels": 21,
        "politics": 10,
        "science fiction": 53,
        "science fiction (dystopia)": 59,
        "speculative fiction": 12,
        "unfinished": 15
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_id": "1289_1"
        },
        {
            "status": "maintenance",
            "stock_id": "1289_2"
        }
    ],
    "metrics": {
        "rating_votes": 8494,
        "score": 3.67
    },
    "pages": 813,
    "title": "The Mandibles: A Family, 2029–2047",
    "url": "https://www.goodreads.com/book/show/27064345-the-mandibles",
    "year_published": 2016
}