{
  "author": "Douglas E. Richards",
  "id": "1311",
  "description": "A stunningly unique time travel thriller. The 27th bestselling Kindle book of 2017--out of almost 6 million titles. What if you found a way to send something back in time? But not weeks, days, or even minutes back. What if you could only send something back a fraction of a second? Would this be of any use? You wouldn't have nearly enough time to right a wrong, change an event, or win a lottery.Nathan Wexler is a brilliant physicist who thinks he's found a way to send matter a split second back into the past. But before he can even confirm his findings, he and his wife-to-be, Jenna Morrison, find themselves in a battle for their very lives. Because while time travel to an instant earlier seems useless, Jenna comes to learn that no capability in history has ever been more profound or far-reaching.Now, as Jenna fights to defeat the powerful forces arrayed against her, nothing less than the fate of humanity hangs in the balance. . .SPLIT SECOND is a roller-coaster ride of a thriller, one that will have readers pondering the nature of time, and of reality, long after they've read the last page.\"Richards is a worthy successor to Michael Crichton.\" (SF Book.com)\"Richards is an extraordinary writer,\" (Dean Koontz) who can \"keep you turning the pages all night long.\" (Douglas Preston)Near Future Science Fiction Thrillers by Douglas E. RichardsWIRED (Wired 1)AMPED (Wired 2)MIND'S EYE (Nick Hall 1)BRAINWEB (Nick Hall 2)MIND WAR (Nick Hall 3) -- New in 2016SPLIT SECOND (Split Second 1)TIME FRAME (Split Second 2) -- New in January, 2018QUANTUM LENSGAME CHANGER -- New in 2016INFINITY BORN -- New in 2017Kids Science Fiction Thrillers (9 and up, enjoyed by kids and adults alike)TRAPPED (Prometheus Project 1)CAPTURED (Prometheus Project 2)STRANDED (Prometheus Project 3)OUT OF THIS WORLDTHE DEVIL'S SWORD",
  "editions": [
    "english",
    "spanish"
  ],
  "genres": [
    "action",
    "business (amazon)",
    "drama",
    "fiction",
    "mystery",
    "science fiction",
    "science fiction (time travel)",
    "suspense",
    "thriller",
    "thriller (mystery thriller)"
  ],
  "inventory": [
    {
      "status": "available",
      "stock_id": "1311_1"
    },
    {
      "status": "on_loan",
      "stock_id": "1311_2"
    },
    {
      "status": "on_loan",
      "stock_id": "1311_3"
    },
    {
      "status": "available",
      "stock_id": "1311_4"
    },
    {
      "status": "available",
      "stock_id": "1311_5"
    },
    {
      "status": "on_loan",
      "stock_id": "1311_6"
    },
    {
      "status": "available",
      "stock_id": "1311_7"
    },
    {
      "status": "on_loan",
      "stock_id": "1311_8"
    },
    {
      "status": "on_loan",
      "stock_id": "1311_9"
    }
  ],
  "metrics": {
    "rating_votes": 27290,
    "score": 3.9
  },
  "pages": 460,
  "title": "Split Second",
  "url": "https://www.goodreads.com/book/show/26216031-split-second",
  "year_published": 2015
}
