{
    "author_name": "Lee Savino",
    "base_id": 132,
    "book_description": "Captured in space. Imprisoned. Sold to the highest bidder. But my biggest problem is this bossy, aggravating, impossible, alien who’s supposed to rescue me. The bossy alien I kissed. That might have been a mistake.Kadir is dangerous. I’ve seen him fight, and his body is littered with scars. He’s a soldier. A warrior. And when he loses control, he turns into a big scary dragon and breathes fire.Everyone’s terrified of him. I’m not. No, call me the biggest fool in the galaxy, because I’m attracted to the big jerk.***Kadir:When I first met the small human I was sent to rescue, she punched me in the jaw. And broke her wrist in the process. Irrational woman.Then she insists that the two of us set out immediately to find her missing friend. No, what I have to do is get Alice Hernandez to safety. She’s soft, yet she’s strong. Fragile, yet so brave. She’s everything I’ve never known I wanted. Everything I can’t let myself have. When the scientists tortured me, they broke me. And when Alice finds out the truth about the fearsome, raging dragon inside me, I will lose her.",
    "book_title": "Draekon Warrior",
    "editions": [
        "English"
    ],
    "genres": {
        "abuse": 4,
        "aliens": 17,
        "dragons": 15,
        "erotica": 4,
        "fantasy": 3,
        "paranormal": 4,
        "romance": 15,
        "science fiction": 14,
        "science fiction romance": 9,
        "shapeshifters": 10
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_number": "132_1"
        },
        {
            "status": "on_loan",
            "stock_number": "132_2"
        },
        {
            "status": "on_loan",
            "stock_number": "132_3"
        },
        {
            "status": "maintenance",
            "stock_number": "132_4"
        }
    ],
    "metrics": {
        "rating_votes": 1062,
        "score": 4.29
    },
    "original_book_title": "Draekon Warrior (Rebel Force, #1)",
    "pages": 716,
    "url": "https://www.goodreads.com/book/show/53173307-draekon-warrior",
    "year_published": 2019
}