{
    "author_name": "Ernest Cline",
    "base_id": 13248,
    "book_description": "Zack Lightman has spent his life dreaming. Dreaming that the real world could be a little more like the countless science-fiction books, movies, and videogames he’s spent his life consuming. Dreaming that one day, some fantastic, world-altering event will shatter the monotony of his humdrum existence and whisk him off on some grand space-faring adventure. But hey, there’s nothing wrong with a little escapism, right? After all, Zack tells himself, he knows the difference between fantasy and reality. He knows that here in the real world, aimless teenage gamers with anger issues don’t get chosen to save the universe. And then he sees the flying saucer. Even stranger, the alien ship he’s staring at is straight out of the videogame he plays every night, a hugely popular online flight simulator called Armada—in which gamers just happen to be protecting the earth from alien invaders.No, Zack hasn’t lost his mind. As impossible as it seems, what he’s seeing is all too real. And his skills—as well as those of millions of gamers across the world—are going to be needed to save the earth from what’s about to befall it. It’s Zack’s chance, at last, to play the hero. But even through the terror and exhilaration, he can’t help thinking back to all those science-fiction stories he grew up with, and wondering: Doesn’t something about this scenario seem a little…familiar? At once gleefully embracing and brilliantly subverting science-fiction conventions as only Ernest Cline could, Armada is a rollicking, surprising thriller, a classic coming of age adventure, and an alien invasion tale like nothing you’ve ever read before—one whose every page is infused with the pop-culture savvy that has helped make Ready Player One a phenomenon.",
    "book_title": "Armada",
    "editions": [
        "English"
    ],
    "genres": {
        "adult": 119,
        "adventure": 180,
        "aliens": 154,
        "audiobook": 489,
        "fantasy": 331,
        "fiction": 1117,
        "science fiction": 2309,
        "science fiction fantasy": 218,
        "space": 89,
        "young adult": 537
    },
    "inventory": [
        {
            "status": "available",
            "stock_number": "13248_1"
        },
        {
            "status": "maintenance",
            "stock_number": "13248_2"
        },
        {
            "status": "maintenance",
            "stock_number": "13248_3"
        },
        {
            "status": "available",
            "stock_number": "13248_4"
        },
        {
            "status": "maintenance",
            "stock_number": "13248_5"
        }
    ],
    "metrics": {
        "rating_votes": 102732,
        "score": 3.54
    },
    "original_book_title": "Armada",
    "pages": 1219,
    "url": "https://www.goodreads.com/book/show/16278318-armada",
    "year_published": 2015
}