{
    "author": "Walter Jon Williams",
    "id": "135",
    "description": "Aristide, a semi-retired computer scientist turned swordsman, is a scholar of the implied spaces, seeking meaning amid the accidents of architecture in a universe where reality itself has been sculpted and designed by superhuman machine intelligence. While exploring the pre-technological world Midgarth, one of four dozen pocket universes created within a series of vast, orbital matrioshka computer arrays, Aristide uncovers a fiendish plot threatening to set off a nightmare scenario, perhaps even bringing about the ultimate Existential Crisis: the end of civilization itself. Traveling the pocket universes with his wormhole-edged sword Tecmesssa in hand and talking cat Bitsy, avatar of the planet-sized computer Endora, at his side, Aristide must find a way to save the multiverse from subversion, sabotage, and certain destruction.Skyhorse Publishing, under our Night Shade and Talos imprints, is proud to publish a broad range of titles for readers interested in science fiction (space opera, time travel, hard SF, alien invasion, near-future dystopia), fantasy (grimdark, sword and sorcery, contemporary urban fantasy, steampunk, alternative history), and horror (zombies, vampires, and the occult and supernatural), and much more. While not every title we publish becomes a New York Times bestseller, a national bestseller, or a Hugo or Nebula award-winner, we are committed to publishing quality books from a diverse group of authors.",
    "editions": [
        "english",
        "spanish",
        "french"
    ],
    "genres": {
        "fantasy": 15,
        "fiction": 31,
        "novels": 3,
        "own": 2,
        "science fiction": 105,
        "science fiction (cyberpunk)": 13,
        "science fiction fantasy": 5,
        "space": 2,
        "space (space opera)": 8,
        "speculative fiction": 3
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "135_1"
        },
        {
            "status": "maintenance",
            "stock_id": "135_2"
        },
        {
            "status": "maintenance",
            "stock_id": "135_3"
        },
        {
            "status": "available",
            "stock_id": "135_4"
        },
        {
            "status": "available",
            "stock_id": "135_5"
        },
        {
            "status": "maintenance",
            "stock_id": "135_6"
        }
    ],
    "metrics": {
        "rating_votes": 1278,
        "score": 3.74
    },
    "pages": 898,
    "title": "Implied Spaces",
    "url": "https://www.goodreads.com/book/show/2059573.Implied_Spaces",
    "year_published": 2008
}