{
    "author_name": "Ilona Andrews",
    "base_id": 1368,
    "book_description": "Maud Demille was a daughter of Innkeepers. She knew that a simple life wasn't in the cards, but she never anticipated what Fate would throw at her.Once a wife to a powerful vampire knight, Maud and her daughter, Helen, had been exiled for the sins of her husband to the desolate planet of Karhari. Karhari killed her husband, and Maud had spent a year and a half avenging his debts. But now all the debts are paid. Rescued by her sister Dina, Maud had swore off all things vampire. Except she met Arland, the Marshal of House Krahr. One thing led to another and he asked for her hand in marriage. She declined.Try as she might, she can't just walk away from Arland. It doesn't help that being human is a lot harder for Maud than being a vampire.To sort it all out, she accepts his invitation to visit his home planet. House Krahr is a powerful vampire House, and Maud knows that a woman who turned down the proposal from its most beloved son wouldn't get a warm reception. But Maud Demille never shied from a fight and House Krahr may soon discover that there is more to this human woman than they ever thought possible.Published as an online free serial before the book is compiled and self-published shortly after completion.",
    "book_title": "Sweep of the Blade",
    "editions": [
        "English"
    ],
    "genres": {
        "aliens": 72,
        "fantasy": 539,
        "fiction": 53,
        "magic": 84,
        "paranormal": 185,
        "paranormal romance": 78,
        "romance": 251,
        "science fiction": 224,
        "urban fantasy": 400,
        "vampires": 189
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_number": "1368_1"
        },
        {
            "status": "maintenance",
            "stock_number": "1368_2"
        },
        {
            "status": "maintenance",
            "stock_number": "1368_3"
        },
        {
            "status": "maintenance",
            "stock_number": "1368_4"
        },
        {
            "status": "maintenance",
            "stock_number": "1368_5"
        },
        {
            "status": "on_loan",
            "stock_number": "1368_6"
        }
    ],
    "metrics": {
        "rating_votes": 13863,
        "score": 4.53
    },
    "original_book_title": "Sweep of the Blade",
    "pages": 221,
    "url": "https://www.goodreads.com/book/show/37712577-sweep-of-the-blade",
    "year_published": 2018
}