{
    "author_name": "Evangeline Anderson",
    "base_id": 1374,
    "book_description": "Olivia Waterhouse has just graduated from nursing school and has her whole life ahead of her—until she gets drafted. Problem is, she isn’t being forced into the Army, she’s been chosen as a Kindred bride. The Kindred are huge alien warriors—a race of genetic traders whose population is ninety-five percent male. After saving Earth from the threat of invasion they demand a reward—the right to find brides among the population. The chances of being chosen are about the same as those of winning the lottery—guess it’s just Liv’s lucky day. Baird is a Beast Kindred who recently escaped imprisonment and torture at the hands of the malevolent Scourge. Through the torment and pain only one thing kept him sane—the thought of finding and claiming his bride—Olivia. His need to possess her is a burning intensity that threatens to consume them both.Angry at having her future and her family taken away from her, Liv vows to fight back the only way she can—by resisting. She has one month on the Kindred Mothership with Baird—their claiming period. If she can keep from having bonding sex with him during that time, she can go home and get on with her life on Earth. But Baird isn’t going to make it easy for her. Every week he is allowed to touch Liv more and more intimately and according to the contract she signed, she has to let him. She’s determined to resist him but his touch sets her on fire. And just as she thinks she knows what she wants, a twist of fate and an attack by the faceless Scourge AllFather changes everything…",
    "book_title": "Claimed",
    "editions": [
        "English"
    ],
    "genres": {
        "adult": 90,
        "aliens": 345,
        "erotic romance": 58,
        "erotica": 310,
        "fantasy": 157,
        "paranormal": 256,
        "paranormal romance": 171,
        "romance": 451,
        "science fiction": 390,
        "science fiction romance": 110
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_number": "1374_1"
        },
        {
            "status": "available",
            "stock_number": "1374_2"
        }
    ],
    "metrics": {
        "rating_votes": 17049,
        "score": 3.77
    },
    "original_book_title": "Claimed",
    "pages": 664,
    "url": "https://www.goodreads.com/book/show/10439221-claimed",
    "year_published": 2011
}