{
    "author_name": "Cynthia Sax",
    "base_id": 138,
    "book_description": "Can love redeem a monster?The Refuge is home to some of the most violent beings in the universe. Kralj, its leader, reigns over the remote outpost with terrifying ease, ruthlessly squashing any rumors of rebellion, killing anyone who breaks his rules. Primitive, deadly, powerful, he’s a monster, scarred both on his face and his soul. He has never met a being he couldn’t control.Until he meets her.Dita has one mission—to kill the three targets claiming sanctuary within the Refuge. Or so she claims. For the first time in his long lifespan, Kralj isn’t certain of another being’s intentions. The tiny assassin is immune to his powers, her thoughts unreadable. He can’t predict her movements, can’t control her, can’t stop wanting her.Dita is rare, as unique as he is, and, to keep the residents of the Refuge safe, Kralj will have to kill her. But first, he’ll touch her, taste her, show her how passionate the beast inside him can be.Dark Thoughts is a STAND-ALONE SciFi Romance. The hero might be tall, dark, and scarred but don’t be fooled by his appearance. He’s truly a monster. This story is not for readers with delicate sensibilities.",
    "book_title": "Dark Thoughts",
    "editions": [
        "English"
    ],
    "genres": {
        "aliens": 24,
        "dark": 16,
        "erotica": 8,
        "fantasy": 9,
        "paranormal": 12,
        "paranormal romance": 11,
        "romance": 27,
        "science fiction": 33,
        "science fiction romance": 10
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_number": "138_1"
        },
        {
            "status": "on_loan",
            "stock_number": "138_2"
        },
        {
            "status": "on_loan",
            "stock_number": "138_3"
        },
        {
            "status": "available",
            "stock_number": "138_4"
        }
    ],
    "metrics": {
        "rating_votes": 1148,
        "score": 3.95
    },
    "original_book_title": "B01MRAABGC",
    "pages": 550,
    "url": "https://www.goodreads.com/book/show/34022035-dark-thoughts",
    "year_published": 2017
}