{
    "author": "Paul Antony Jones",
    "base_id": "139",
    "description": "Word count: 77,000What would you do if you suddenly found yourself twenty-five years in the past? For the nine-billion people of the year 2042 it's no longer a question ... it is a realityWhen a seemingly simple experiment goes disastrously wrong, James Baston finds himself stranded alongside the rest of mankind, twenty-five years in the past. A past where the old are once more young, the dead live and the world has been thrust into chaos.Contacted by the scientist responsible for the disaster, James is recruited to help avert an even greater catastrophe. Along with a team of scientists, a reincarnated murder victim and a frustrated genius trapped in her six-year old body, James must stop the certain extinction of humanity. But if the deluded leader of the Church of Second Redemption has his way, humanity will disappear into potentiality, and he is willing to do anything to ensure that happens. A serial killer, a murder victim, a dead priest, and James' lives are all inextricably bound together as they plummet towards an explosive final confrontation, the winner of which will decide the fate of humanity. *** Thanks for considering downloading Towards Yesterday. If you have a second, could I ask you to scroll to the tag section at the bottom of this page and, if you agree with them, confirm the tags you find there. This will make Towards Yesterday easier for others to find. Thank you ***",
    "editions": [
        "english",
        "spanish",
        "french"
    ],
    "genres": {
        "apocalyptic (post apocalyptic)": 12,
        "audiobook": 2,
        "business (amazon)": 3,
        "fantasy": 6,
        "fiction": 14,
        "science fiction": 45,
        "science fiction (apocalyptic)": 5,
        "science fiction (dystopia)": 3,
        "science fiction (time travel)": 54,
        "young adult": 4
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_id": "139_1"
        },
        {
            "status": "maintenance",
            "stock_id": "139_2"
        }
    ],
    "metrics": {
        "rating_votes": 1347,
        "score": 3.73
    },
    "pages": 346,
    "title": "Towards Yesterday",
    "url": "https://www.goodreads.com/book/show/11294761-towards-yesterday",
    "year_published": 2011
}