{
    "author": "Anna Hackett",
    "base_id": 140,
    "description": "Scientist Ever Haynes was shocked when she was abducted by alien slavers...but the last thing she expected was to find herself pregnant with a cyborg's baby.Ever has been fighting for her life since her abduction, and the only good thing to happen to her was one heated night with a mysterious prisoner--a connection, a flash of light in the darkness. But then he was rescued and she was left behind. Now, weeks later, she's been saved by the House of Galen gladiators...and by the man she shared the hottest night of her life with. But cool, emotionless cyborg Magnus Rone has no memory of their night together and finding out that she's expecting his baby is a shock to everyone.Created in a military program, Magnus is genetically and cybernetically enhanced--emotionless, ruthless, focused. He vows to protect Ever and the baby she carries, and despite his lack of memory, everything about tough, levelheaded Ever draws him in. All his life, his emotional dampeners and training have limited his ability to feel emotions...but one small Earth woman cuts through all that and leaves him feeling.As they work together to hunt down the deadly desert arena of Zaabha and the final human woman trapped there, Ever and Magnus find a stunning passion neither can resist or ignore. But in the dangerous desert sands of Carthago, with the House of Galen gladiators by their sides, deadly enemies are closing in. Ever and Magnus will be dragged back into the darkness, and Magnus will do anything and sacrifice everything to keep her safe.Note to readers: This sci fi romance contains a lot of action (think wild gladiatorial fights and daring rescues), tough gladiators (the warriors of the House of Galen and the House of Rone) and a steamy romance (between a sexy, emotionless cyborg and a resilient survivor from Earth). So if you like it fast, and gritty, and sexy, this is for you!Includes a preview of Marcus, Book 1 of Hell Squad.",
    "editions": [
        "English"
    ],
    "genres": {
        "action": 5,
        "aliens": 18,
        "erotic romance": 3,
        "erotica": 4,
        "fantasy": 8,
        "paranormal": 7,
        "paranormal romance": 7,
        "romance": 49,
        "science fiction": 29,
        "science fiction romance": 9
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_id": "140_1"
        },
        {
            "status": "available",
            "stock_id": "140_2"
        },
        {
            "status": "available",
            "stock_id": "140_3"
        },
        {
            "status": "available",
            "stock_id": "140_4"
        },
        {
            "status": "maintenance",
            "stock_id": "140_5"
        },
        {
            "status": "maintenance",
            "stock_id": "140_6"
        },
        {
            "status": "on_loan",
            "stock_id": "140_7"
        },
        {
            "status": "maintenance",
            "stock_id": "140_8"
        }
    ],
    "metrics": {
        "rating_votes": 1400,
        "score": 4.38
    },
    "pages": 1377,
    "title": "Cyborg",
    "url": "https://www.goodreads.com/book/show/39338693-cyborg",
    "year_published": 2018
}