{
    "author": "Jonathan Stroud",
    "base_id": "1401",
    "description": "It is 950 B.C.E., and King Solomon rules Jerusalem with a steely hand; a hand on which gleams a magic ring of immense and unforgiving power. Solomon has just begun work on his marvelous temple, charging Khaba, a formidable magician in his royal court, to oversee its construction. The workforce is an ill-behaved bunch of demons, a particularly unruly djinni named Bartimaeus among them. True to form, Bartimaeus promptly gets kicked off the temple project and assigned the even more miserable task of hunting bandits in the desert. There he crosses paths with Asmira, a highly skilled and loyal captain of the Queen of Sheba’s guard, on a suicidal mission to save her country from Solomon’s imminent attack. Of course, Bartimaeus has no intention of helping her. That is, until Asmira makes him an offer he cannot refuse. . . .A spellbinding addition to Jonathan Stroud’s New York Times bestselling Bartimaeus audiobooks, The Ring of Solomon brims with dazzling wit, unforgettable characters, and powerful themes of freedom and slavery, with or without magical bonds.",
    "editions": [
        "english",
        "spanish"
    ],
    "genres": {
        "adventure": 82,
        "audiobook": 55,
        "childrens (middle grade)": 45,
        "fantasy": 1528,
        "fantasy (magic)": 107,
        "fiction": 202,
        "historical (historical fiction)": 36,
        "humor": 71,
        "young adult": 372,
        "young adult (young adult fantasy)": 41
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_id": "1401_1"
        },
        {
            "status": "on_loan",
            "stock_id": "1401_2"
        },
        {
            "status": "maintenance",
            "stock_id": "1401_3"
        },
        {
            "status": "maintenance",
            "stock_id": "1401_4"
        },
        {
            "status": "maintenance",
            "stock_id": "1401_5"
        },
        {
            "status": "on_loan",
            "stock_id": "1401_6"
        },
        {
            "status": "on_loan",
            "stock_id": "1401_7"
        },
        {
            "status": "maintenance",
            "stock_id": "1401_8"
        },
        {
            "status": "on_loan",
            "stock_id": "1401_9"
        }
    ],
    "metrics": {
        "rating_votes": 27683,
        "score": 4.2
    },
    "pages": 1398,
    "title": "The Ring of Solomon",
    "url": "https://www.goodreads.com/book/show/7640705-the-ring-of-solomon",
    "year_published": 2010
}