{
    "author": "Gerard Way",
    "base_id": "1411",
    "description": "The team is despondent following the near apocalypse created by one of their own and the death of their beloved mentor Pogo. So it's a great time for another catastrophic event to rouse the team into action. Trouble is—each member of the team is distracted by some very real problems of their own. The White Violin is bedridden due to an unfortunate blow to the head. Rumor has lost her voice—the source of her power. Spaceboy has eaten himself into a near-catatonic state, while Number Five dives into some shady dealings at the dog track and the Kraken starts looking at his littlest brother as the key to unraveling a mysterious series of massacres…all leading to a blood-drenched face-off with maniacal assassins, and a plot to kill JFK!  • Chosen as BookExpo America's 2009 Hot Graphic Novel for Libraries and Teens!  • The first volume of The Umbrella Academy has sold over 45,000 copies!  • \"It's the X-Men for cool people.\"—Grant Morrison (All-Star Superman)  • 2009 Eisner Award nominations (The Umbrella Academy: Apocalypse Suite):  Gerard Way and Gabriel Bá: Best Graphic Album  Gabriel Bá: Best Cover Artist, Best Penciller/Inker James Jean: Best Cover Artist Dave Stewart: Best Coloring  • A New York Times bestseller!",
    "editions": [
        "english",
        "spanish",
        "french"
    ],
    "genres": {
        "adult": 36,
        "comics (comic book)": 85,
        "comics (superheroes)": 72,
        "fantasy": 176,
        "fiction": 135,
        "graphic novels comics": 140,
        "science fiction": 109,
        "science fiction (time travel)": 53,
        "sequential art (comics)": 846,
        "sequential art (graphic novels)": 891
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "1411_1"
        },
        {
            "status": "available",
            "stock_id": "1411_2"
        },
        {
            "status": "on_loan",
            "stock_id": "1411_3"
        },
        {
            "status": "available",
            "stock_id": "1411_4"
        },
        {
            "status": "on_loan",
            "stock_id": "1411_5"
        }
    ],
    "metrics": {
        "rating_votes": 19732,
        "score": 4.01
    },
    "pages": 1272,
    "title": "The Umbrella Academy, Vol. 2: Dallas",
    "url": "https://www.goodreads.com/book/show/6413286-the-umbrella-academy-vol-2",
    "year_published": 2009
}