{
    "author": "K.C. Burn",
    "base_id": 142,
    "description": "The Galactic Alliance’s most important negotiator, Jathan One-Moon, is responsible for ensuring the yearly negotiations with the Ankylos are successful. If he fails and the Ankylos go to war, the human race will likely be exterminated. As if that wasn’t enough, he’s under pressure to marry and produce an heir. When he mistakes the brothel owner, Kazha Deinos, for his escort prior to the negotiations, the resulting evening makes Jathan realize his life is missing a man who can be a true partner to him.Kaz never met his most important client, and Jathan’s misconception allows Kaz the freedom to give in to desires he’s never let himself indulge in before. But Kaz has a business to run, one that a rival is trying to steal, which will force him to reveal his true identity to Jay. There’s also the little issue of Jathan’s impending marriage. Kaz is not interested in being a boy on the side of Jay’s marriage, no matter how much he’s come to care for Jathan. Will Jathan and Kaz find a way to be together, or will losing the man Jathan’s grown to love be yet another price he must pay for saving the human race?32,900 words",
    "editions": [
        "English"
    ],
    "genres": {
        "aliens": 17,
        "bdsm": 21,
        "erotica": 19,
        "fantasy": 12,
        "futuristic": 12,
        "gay": 15,
        "lgbt": 10,
        "male male romance": 105,
        "romance": 50,
        "science fiction": 81
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_id": "142_1"
        },
        {
            "status": "maintenance",
            "stock_id": "142_2"
        },
        {
            "status": "available",
            "stock_id": "142_3"
        },
        {
            "status": "maintenance",
            "stock_id": "142_4"
        }
    ],
    "metrics": {
        "rating_votes": 887,
        "score": 3.74
    },
    "pages": 916,
    "title": "Spice ‘n’ Solace",
    "url": "https://www.goodreads.com/book/show/10324166-spice-n-solace",
    "year_published": 2011
}