{
    "author": "Scarlett Starkleigh",
    "base_id": 143,
    "description": "Alternative Cover Edition of ASIN: B01MQVDCQYI got tricked and now I'm on another planet. We're here to be matched with alien males who haven't had access to women in years. They are aching for wives, desperate to have children. I got tricked and then the government wouldn't let me opt-out. They say I need to sleep with one of the aliens within 72 hours in order to get life-saving antibodies otherwise I'll die.So, I slept with a hot 7-foot tall alien after he and 3 other hotties battled for the right to marry me. I told him I'd sleep with him, no-strings, to break his dry spell and save me from death. But now the alien considers me to be his WIFE. He's hot, alpha, bossy but sweet, and I might be in love with him. Even if I don't want to admit it.HOT ALPHA ALIEN HUSBANDS: This is book one in a new series by author DD Prince, writing as Scarlett Starkleigh.They look like us, but better. Taller, nicer skin, more muscles. They live a lot like us, but better. They’ve got a lot of the technology that we have but…yep, you guessed it: theirs is better. Their planet is reportedly beautiful, clean, unpolluted and extraordinarily colorful.Medically, they’re superior, too. Except that they were powerless to stop a super-bug that quickly all but wiped out their female population and over 99% of their women were suddenly --- poof --- gone.Their men are lonely and restless. They’re inherently alpha, protective, a family-driven species, and they’re carnally deprived so that’s having an impact on the otherwise peaceful planet. They have gone without women for years and so they’re chomping at the bit and it means fighting, threat of war, general unease / unrest, and threats to pillage other planets for women if something wasn't done to get these men what they needed. Tests were run and since we’re biologically compatible deals were made.I was tricked onto the space ship. I was also tricked into getting married without my knowledge. I'm fighting my emotions but Daxx is doing all sorts of things to try to break down my defenses... the scheming, insatiable, hot, bossy, swoony, alpha.Dirty-talking, steamy panty-melting scenes, over-the-top alpha male insta-love. A fun, light read in the sci-fi romance genre with only a little bit of world-building but a whole lot of steamy insta-love fun & a happily ever after. Future books will follow but this is a complete story with an HEA & no cheating. ",
    "editions": [
        "English"
    ],
    "genres": {
        "Romance (Contemporary Romance) ": 2,
        "adult": 2,
        "aliens": 20,
        "erotica": 12,
        "fantasy": 9,
        "humor": 2,
        "paranormal": 14,
        "romance": 16,
        "science fiction": 24,
        "science fiction romance": 5
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_id": "143_1"
        },
        {
            "status": "maintenance",
            "stock_id": "143_2"
        },
        {
            "status": "maintenance",
            "stock_id": "143_3"
        },
        {
            "status": "maintenance",
            "stock_id": "143_4"
        },
        {
            "status": "available",
            "stock_id": "143_5"
        }
    ],
    "metrics": {
        "rating_votes": 648,
        "score": 3.81
    },
    "pages": 855,
    "title": "Daxx and Jetta",
    "url": "https://www.goodreads.com/book/show/38355143-daxx-and-jetta",
    "year_published": 2016
}