{
    "author_name": "Wendy Higgins",
    "base_id": 148,
    "book_description": "USA Today and New York Times bestselling author, Wendy Higgins, brings you the gripping, sensual conclusion to her apocalyptic trilogy.Amber Tate never dreamed their heart-wrenching escape from the enemy’s attack would lead them to the most beautiful place she’s ever seen, marred by one ugly fact; it’s under enemy control. Like everywhere else in the world, Elmendorf military base in Alaska has been captured, and it’s time to take it back—all of it—one base, one city at a time. After losing so much, Amber clings to the only precious person she has left, and vows to sacrifice everything to help save the Earth.Remy Haines is a lover, not a fighter, so when she finds herself in enemy territory, expected to feign allegiance while gathering intel for the rebel cause, she’s never been more out of her element. Tensions only increase when her feelings for Jacob “Tater” Tate won’t go away, and the enemy’s leader takes an interest in her. She’s torn between what her heart wants, and what she knows she should do. As for what her body needs…well, it’s always had a mind of its own.",
    "book_title": "Undone",
    "editions": [
        "None"
    ],
    "genres": {
        "aliens": 18,
        "apocalyptic": 6,
        "dystopia": 24,
        "fiction": 4,
        "military fiction": 6,
        "new adult": 38,
        "paranormal": 6,
        "post apocalyptic": 6,
        "romance": 30,
        "science fiction": 13
    },
    "inventory": [
        {
            "status": "available",
            "stock_number": "148_1"
        },
        {
            "status": "available",
            "stock_number": "148_2"
        },
        {
            "status": "available",
            "stock_number": "148_3"
        },
        {
            "status": "maintenance",
            "stock_number": "148_4"
        },
        {
            "status": "on_loan",
            "stock_number": "148_5"
        }
    ],
    "metrics": {
        "rating_votes": 955,
        "score": 4.28
    },
    "original_book_title": "\nUnknown#3 ",
    "pages": 492,
    "url": "https://www.goodreads.com/book/show/32867161-undone",
    "year_published": 2017
}