{
    "author": "Arthur Koestler",
    "base_id": "1539",
    "description": "Darkness at Noon (from the German: Sonnenfinsternis) is a novel by the Hungarian-born British novelist Arthur Koestler, first published in 1940. His best-known work tells the tale of Rubashov, a Bolshevik 1917 revolutionary who is cast out, imprisoned and tried for treason by the Soviet government he'd helped create.Darkness at Noon stands as an unequaled fictional portrayal of the nightmare politics of our time. Its hero is an aging revolutionary, imprisoned and psychologically tortured by the Party to which he has dedicated his life. As the pressure to confess preposterous crimes increases, he relives a career that embodies the terrible ironies and human betrayals of a totalitarian movement masking itself as an instrument of deliverance. Almost unbearably vivid in its depiction of one man's solitary agony, it asks questions about ends and means that have relevance not only for the past but for the perilous present. It is —- as the Times Literary Supplement has declared —- \"A remarkable book, a grimly fascinating interpretation of the logic of the Russian Revolution, indeed of all revolutionary dictatorships, and at the same time a tense and subtly intellectualized drama.\"",
    "editions": [
        "english",
        "spanish",
        "french"
    ],
    "genres": {
        "classics": 452,
        "cultural (russia)": 162,
        "fiction": 1019,
        "historical (historical fiction)": 279,
        "literature": 161,
        "literature (20th century)": 62,
        "novels": 130,
        "politics": 188,
        "science fiction (dystopia)": 80,
        "thriller": 56
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_id": "1539_1"
        },
        {
            "status": "available",
            "stock_id": "1539_2"
        },
        {
            "status": "available",
            "stock_id": "1539_3"
        }
    ],
    "metrics": {
        "rating_votes": 26724,
        "score": 4.05
    },
    "pages": 205,
    "title": "Darkness at Noon",
    "url": "https://www.goodreads.com/book/show/30672.Darkness_at_Noon",
    "year_published": 1940
}