{
    "author": "China Miéville",
    "base_id": "1580",
    "description": "On board the moletrain Medes, Sham Yes ap Soorap watches in awe as he witnesses his first moldywarpe hunt: the giant mole bursting from the earth, the harpoonists targeting their prey, the battle resulting in one’s death and the other’s glory. But no matter how spectacular it is, Sham can't shake the sense that there is more to life than traveling the endless rails of the railsea–even if his captain can think only of the hunt for the ivory-coloured mole she’s been chasing since it took her arm all those years ago. When they come across a wrecked train, at first it's a welcome distraction. But what Sham finds in the derelict—a series of pictures hinting at something, somewhere, that should be impossible—leads to considerably more than he'd bargained for. Soon he's hunted on all sides, by pirates, trainsfolk, monsters and salvage-scrabblers. And it might not be just Sham's life that's about to change. It could be the whole of the railsea. From China Miéville comes a novel for readers of all ages, a gripping and brilliantly imagined take on Herman Melville's Moby-Dick that confirms his status as \"the most original and talented voice to appear in several years.\" (Science Fiction Chronicle)",
    "editions": [
        "english",
        "spanish",
        "french"
    ],
    "genres": {
        "adventure": 64,
        "apocalyptic (post apocalyptic)": 42,
        "fantasy": 739,
        "fiction": 254,
        "science fiction": 317,
        "science fiction (dystopia)": 74,
        "science fiction (steampunk)": 238,
        "speculative fiction": 51,
        "weird fiction (new weird)": 47,
        "young adult": 240
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_id": "1580_1"
        },
        {
            "status": "maintenance",
            "stock_id": "1580_2"
        },
        {
            "status": "maintenance",
            "stock_id": "1580_3"
        },
        {
            "status": "available",
            "stock_id": "1580_4"
        },
        {
            "status": "available",
            "stock_id": "1580_5"
        },
        {
            "status": "available",
            "stock_id": "1580_6"
        }
    ],
    "metrics": {
        "rating_votes": 11699,
        "score": 3.89
    },
    "pages": 1050,
    "title": "Railsea",
    "url": "https://www.goodreads.com/book/show/12392681-railsea",
    "year_published": 2012
}