{
    "author": "Hope Hart",
    "base_id": 159,
    "description": "The aliens who abducted me made a mistake. The Grivath have sold us on Gule- a planet known for dealing in human flesh. The women who are being held captive with me are in high demand and they all look like models. Me? I’m 5'2 shy, curvy, and a kindergarten teacher. Maybe they really meant to take my pageant queen sister?If that's not bad enough, our ship has crashed and half of the women are missing. Did I mention the locals want to eat us? Insert the tall, sexy warrior aliens, who saved us. Things are looking up, except that one of them is eyeing me like a snack, and not in a cannibalistic way-- if you catch my drift.Terex is rough, fierce, and bossy, and doesn't seem to understand that I can't stay and be his snuggle bunny. I'm not quite sure why he isn't chasing after one of the other women when every man I've ever known has overlooked me.But not Terex. When he looks at me, he doesn’t seem to see chubby, awkward Ellie. And his gaze burns brighter instead of shifting away.Now, I've just got to convince him to help me find the other women and get back to Earth.Should be a piece of cake… Right? Taken by the Alien Warrior is a full-length romance with no cliffhanger and a guaranteed HEA. While this is a spin-off series from the hugely popular Arcav Alien Invasion series, this is a standalone series. If you like hot, dominant aliens, kick-ass heroines, and steamy romance, you'll love Warriors of Agron- Hope Hart's new sci-fi romance series. Read it Now.",
    "editions": [
        "None"
    ],
    "genres": {
        "aliens": 24,
        "erotica": 2,
        "fantasy": 3,
        "fiction": 3,
        "paranormal": 3,
        "paranormal romance": 6,
        "romance": 15,
        "science fiction": 17,
        "science fiction romance": 8,
        "space": 3
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "159_1"
        },
        {
            "status": "maintenance",
            "stock_id": "159_2"
        },
        {
            "status": "on_loan",
            "stock_id": "159_3"
        },
        {
            "status": "available",
            "stock_id": "159_4"
        },
        {
            "status": "available",
            "stock_id": "159_5"
        },
        {
            "status": "available",
            "stock_id": "159_6"
        },
        {
            "status": "maintenance",
            "stock_id": "159_7"
        },
        {
            "status": "on_loan",
            "stock_id": "159_8"
        }
    ],
    "metrics": {
        "rating_votes": 1677,
        "score": 4.08
    },
    "pages": 277,
    "title": "Taken by the Alien Warrior",
    "url": "https://www.goodreads.com/book/show/50618401-taken-by-the-alien-warrior",
    "year_published": 2020
}