{
    "author": "Anne Bishop",
    "id": "1591",
    "description": "In this thrilling and suspenseful fantasy, set in the world of the New York Times bestselling Others series, Vicki DeVine and her lodger, the shapeshifter Aggie Crowe, stumble onto a dead body . . . and find themselves enmeshed in danger and dark secrets.Human laws do not apply in the territory controlled by the Others–vampires, shapeshifters, and paranormal beings even more deadly. And this is a fact that humans should never, ever forget . . . After her divorce, Vicki DeVine took over a rustic resort near Lake Silence, in a human town that is not human controlled. Towns like Vicki’s have no distance from the Others, the dominant predators that rule most of the land and all of the water throughout the world. And when a place has no boundaries, you never really know what’s out there watching you.Vicki was hoping to find a new career and a new life. But when her lodger, Aggie Crowe–one of the shapeshifting Others–discovers a dead body, Vicki finds trouble instead. The detectives want to pin the man’s death on her, despite the evidence that nothing human could have killed the victim. As Vicki and her friends search for answers, things get dangerous–and it’ll take everything they have to stay alive.",
    "editions": [
        "english",
        "spanish"
    ],
    "genres": {
        "adult": 77,
        "audiobook": 39,
        "fantasy": 693,
        "fantasy (paranormal)": 299,
        "fantasy (supernatural)": 38,
        "fantasy (urban fantasy)": 538,
        "fiction": 65,
        "mystery": 41,
        "paranormal (shapeshifters)": 97,
        "paranormal (vampires)": 159
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_id": "1591_1"
        },
        {
            "status": "maintenance",
            "stock_id": "1591_2"
        },
        {
            "status": "on_loan",
            "stock_id": "1591_3"
        },
        {
            "status": "on_loan",
            "stock_id": "1591_4"
        },
        {
            "status": "on_loan",
            "stock_id": "1591_5"
        },
        {
            "status": "available",
            "stock_id": "1591_6"
        },
        {
            "status": "maintenance",
            "stock_id": "1591_7"
        },
        {
            "status": "on_loan",
            "stock_id": "1591_8"
        }
    ],
    "metrics": {
        "rating_votes": 11651,
        "score": 4.28
    },
    "pages": 395,
    "title": "Lake Silence",
    "url": "https://www.goodreads.com/book/show/35463752-lake-silence",
    "year_published": 2018
}