{
    "author": "Jonathan Stroud",
    "base_id": "1600",
    "description": "Five months after the events in THE CREEPING SHADOW, we join Lockwood, Lucy, George, Holly, and their associate Quill Kipps on a perilous night mission: they have broken into the booby-trapped Fittes Mausoleum, where the body of the legendary psychic heroine Marissa Fittes lies. Or does it? This is just one of the many questions to be answered in Book 5 of the Lockwood & Co. series. Will Lockwood ever reveal more about his family's past to Lucy? Will their trip to the Other Side leave Lucy and Lockwood forever changed? Will Penelope Fittes succeed in shutting down their agency forever? The young agents must survive attacks from foes both spectral and human before they can take on their greatest enemy in a climactic and chaotic battle. And to prevail they will have to rely on help from some surprising--and shadowy--allies. Jonathan Stroud once again delivers a rousing adventure full of danger, laughs, twists, and frights. The revelations will send readers back to Book 1 to start the series all over again.",
    "editions": [
        "english"
    ],
    "genres": {
        "childrens (middle grade)": 137,
        "fantasy": 495,
        "fantasy (paranormal)": 165,
        "fantasy (supernatural)": 69,
        "fantasy (urban fantasy)": 61,
        "fiction": 86,
        "horror": 202,
        "mystery": 183,
        "paranormal (ghosts)": 106,
        "young adult": 264
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_id": "1600_1"
        },
        {
            "status": "available",
            "stock_id": "1600_2"
        },
        {
            "status": "on_loan",
            "stock_id": "1600_3"
        },
        {
            "status": "on_loan",
            "stock_id": "1600_4"
        },
        {
            "status": "maintenance",
            "stock_id": "1600_5"
        },
        {
            "status": "on_loan",
            "stock_id": "1600_6"
        },
        {
            "status": "available",
            "stock_id": "1600_7"
        }
    ],
    "metrics": {
        "rating_votes": 9849,
        "score": 4.6
    },
    "pages": 1042,
    "title": "The Empty Grave",
    "url": "https://www.goodreads.com/book/show/32324555-the-empty-grave",
    "year_published": 2017
}