{
  "author": "Eoin Colfer",
  "id": "1609",
  "description": "AN ENGLISHMAN'S CONTINUING SEARCH THROUGH SPACE AND TIME FOR A DECENT CUP OF TEA...Arthur Dent's accidental association with that wholly remarkable book The Hitchhiker's Guide to the Galaxy has not been entirely without incident.Arthur has traveled the length, breadth, and depth of known, and unknown, space. He has stumbled forward and backward through time. He has been blown up, reassembled, cruelly imprisoned, horribly released, and colorfully insulted more than is strictly necessary. And of course Arthur Dent has comprehensively failed to grasp the meaning of life, the universe, and everything.Arthur has finally made it home to Earth, but that does not mean he has escaped his fate.Arthur's chances of getting his hands on a decent cuppa have evaporated rapidly, along with all the world's oceans. For no sooner has he touched down on the planet Earth than he finds out that it is about to be blown up...again.And Another Thing...is the rather unexpected, but very welcome, sixth installment of the Hitchhiker's Guide to the Galaxy series. It features a pantheon of unemployed gods, everyone's favorite renegade Galactic President, a lovestruck green alien, an irritating computer, and at least one very large slab of cheese.",
  "editions": [
    "english"
  ],
  "genres": [
    "adult",
    "adventure",
    "audiobook",
    "fantasy",
    "fiction",
    "humor",
    "humor (comedy)",
    "novels",
    "science fiction",
    "science fiction fantasy"
  ],
  "inventory": [
    {
      "status": "on_loan",
      "stock_id": "1609_1"
    },
    {
      "status": "on_loan",
      "stock_id": "1609_2"
    },
    {
      "status": "maintenance",
      "stock_id": "1609_3"
    },
    {
      "status": "available",
      "stock_id": "1609_4"
    },
    {
      "status": "available",
      "stock_id": "1609_5"
    },
    {
      "status": "maintenance",
      "stock_id": "1609_6"
    },
    {
      "status": "available",
      "stock_id": "1609_7"
    },
    {
      "status": "available",
      "stock_id": "1609_8"
    }
  ],
  "metrics": {
    "rating_votes": 28170,
    "score": 3.58
  },
  "pages": 470,
  "title": "And Another Thing",
  "url": "https://www.goodreads.com/book/show/6359434-and-another-thing",
  "year_published": 2009
}
