{
    "author": "Sara Page",
    "base_id": 161,
    "description": "I went into space looking for my sister... what I found is an alien claiming I'm his.Five years ago, Earth made contact with the Twenty-Three Tribunal, a government of twenty-three superior alien races that rule over the known universe. Deemed too primitive to protect ourselves, the Tribunal slapped a 'Protected' status on Earth, declaring us off-limits to the more advanced races that would exploit or enslave us.Someone has been violating the status.Last year, like so many others before her, my sister Isla disappeared without a trace. And with the Tribunal unwilling or simply unable to help us, I'll do anything, even something really crazy, to get her back.With the help of my best friend and an alien smuggler I've captured, I've got a crazy plan. A plan that involves a neurotransmitter, a one-way ticket off of Earth, and a very powerful drug that will help me infiltrate an illegal alien slave market.I expect to be used, abused, and violated in my quest to gather evidence.What I don't expect is to be captured and claimed by a huge silver alien ... \nThis is a standalone book with a HEA.\n",
    "editions": [
        "English"
    ],
    "genres": {
        "action": 3,
        "aliens": 30,
        "erotica": 6,
        "fantasy": 7,
        "paranormal": 4,
        "paranormal romance": 6,
        "romance": 29,
        "science fiction": 28,
        "science fiction romance": 9,
        "space": 2
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "161_1"
        },
        {
            "status": "on_loan",
            "stock_id": "161_2"
        },
        {
            "status": "available",
            "stock_id": "161_3"
        },
        {
            "status": "on_loan",
            "stock_id": "161_4"
        },
        {
            "status": "available",
            "stock_id": "161_5"
        },
        {
            "status": "on_loan",
            "stock_id": "161_6"
        },
        {
            "status": "on_loan",
            "stock_id": "161_7"
        },
        {
            "status": "on_loan",
            "stock_id": "161_8"
        },
        {
            "status": "available",
            "stock_id": "161_9"
        }
    ],
    "metrics": {
        "rating_votes": 1224,
        "score": 4.11
    },
    "pages": 830,
    "title": "Craving Maul",
    "url": "https://www.goodreads.com/book/show/36255951-craving-maul",
    "year_published": 2017
}