{
    "author": "Kelly Link",
    "id": "1618",
    "description": "She has been hailed by Michael Chabon as “the most darkly playful voice in American fiction” and by Neil Gaiman as “a national treasure.” Now Kelly Link’s eagerly awaited new collection--her first for adult readers in a decade--proves indelibly that this bewitchingly original writer is among the finest we have. Link has won an ardent following for her ability to take readers deep into an unforgettable, brilliantly constructed fictional universe with each new story. In “The Summer People,” a young girl in rural North Carolina serves as uneasy caretaker to the mysterious, never-quite-glimpsed visitors who inhabit the cottage behind her house. In “I Can See Right Through You,” a middle-aged movie star makes a disturbing trip to the Florida swamp where his former on- and off-screen love interest is shooting a ghost-hunting reality show. In “The New Boyfriend,” a suburban slumber party takes an unusual turn, and a teenage friendship is tested, when the spoiled birthday girl opens her big present: a life-size animated doll. Hurricanes, astronauts, evil twins, bootleggers, Ouija boards, iguanas, The Wizard of Oz, superheroes, the Pyramids...These are just some of the talismans of an imagination as capacious and as full of wonder as that of any writer today. But as fantastical as these stories can be, they are always grounded in sly humor and an innate generosity of feeling for the frailty--and the hidden strengths--of human beings. In Get in Trouble, this one-of-a-kind talent expands the boundaries of what short fiction can do.",
    "editions": [
        "english"
    ],
    "genres": {
        "adult": 37,
        "audiobook": 32,
        "fantasy": 395,
        "fiction": 204,
        "horror": 104,
        "magical realism": 139,
        "science fiction": 84,
        "short stories": 1126,
        "short stories (short story collection)": 32,
        "speculative fiction": 34
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_id": "1618_1"
        },
        {
            "status": "on_loan",
            "stock_id": "1618_2"
        },
        {
            "status": "maintenance",
            "stock_id": "1618_3"
        },
        {
            "status": "maintenance",
            "stock_id": "1618_4"
        }
    ],
    "metrics": {
        "rating_votes": 9740,
        "score": 3.69
    },
    "pages": 436,
    "title": "Get in Trouble",
    "url": "https://www.goodreads.com/book/show/22125258-get-in-trouble",
    "year_published": 2015
}