{
    "author": "Saladin Ahmed",
    "base_id": "1624",
    "description": "The Crescent Moon Kingdoms, home to djenn and ghuls, holy warriors and heretics, are at the boiling point of a power struggle between the iron-fisted Khalif and the mysterious master thief known as the Falcon Prince. In the midst of this brewing rebellion a series of brutal supernatural murders strikes at the heart of the Kingdoms. It is up to a handful of heroes to learn the truth behind these killings:Doctor Adoulla Makhslood, “the last real ghul hunter in the great city of Dhamsawaat,” just wants a quiet cup of tea. Three score and more years old, he has grown weary of hunting monsters and saving lives, and is more than ready to retire from his dangerous and demanding vocation. But when an old flame’s family is murdered, Adoulla is drawn back to the hunter’s path.Raseed bas Raseed, Adoulla’s young assistant, is a hidebound holy warrior whose prowess is matched only by his piety. But even as Raseed’s sword is tested by ghuls and manjackals, his soul is tested when he and Adoulla cross paths with the tribeswoman Zamia.Zamia Badawi, Protector of the Band, has been gifted with the near-mythical power of the lion-shape, but shunned by her people for daring to take up a man’s title. She lives only to avenge her father’s death. Until she learns that Adoulla and his allies also hunt her father’s killer. Until she meets Raseed.When they learn that the murders and the Falcon Prince’s brewing revolution are connected, the companions must race against time—and struggle against their own misgivings—to save the life of a vicious despot. In so doing they discover a plot for the Throne of the Crescent Moon that threatens to turn Dhamsawaat, and the world itself, into a blood-soaked ruin.",
    "editions": [
        "english",
        "spanish"
    ],
    "genres": {
        "adult": 33,
        "adventure": 58,
        "audiobook": 26,
        "fantasy": 1878,
        "fantasy (epic fantasy)": 58,
        "fantasy (high fantasy)": 48,
        "fantasy (magic)": 37,
        "fiction": 260,
        "science fiction": 30,
        "science fiction fantasy": 58
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "1624_1"
        },
        {
            "status": "maintenance",
            "stock_id": "1624_2"
        },
        {
            "status": "available",
            "stock_id": "1624_3"
        },
        {
            "status": "available",
            "stock_id": "1624_4"
        },
        {
            "status": "available",
            "stock_id": "1624_5"
        },
        {
            "status": "on_loan",
            "stock_id": "1624_6"
        },
        {
            "status": "available",
            "stock_id": "1624_7"
        },
        {
            "status": "available",
            "stock_id": "1624_8"
        },
        {
            "status": "available",
            "stock_id": "1624_9"
        }
    ],
    "metrics": {
        "rating_votes": 10513,
        "score": 3.64
    },
    "pages": 631,
    "title": "Throne of the Crescent Moon",
    "url": "https://www.goodreads.com/book/show/11487807-throne-of-the-crescent-moon",
    "year_published": 2012
}