{
    "author": "Amanda Milo",
    "base_id": 166,
    "description": "BASH:I dislike people.I despise humans.A cruel mandate from one of my region's rulers has saddled me with a slew of little alien humans: I'm to put them to work.One problem?I run a rock quarry, where humans' thin skin is a detriment to productivity.Overseeing these humans is like trying to herd yanaks. If I don't burn, beat, or strangle them to death by the day's end, it will be a miracle.ISLA:I can tell the boss likes me, because I'm not dead. Bash is abrasive and acerbic, like an alien love child of Michael Caine and Miss Hannigan. And maybe Ebenezer Scrooge. Bash is a little... anti-human race.But he's not all bad. Sure, he's a little growly and he sets things on fire when he gets mad, but even villains need a friend. And here? Bash is everybody's villain.Everyone's but mine.Warning: This book is the slowest of slow burns. It's a 127K story with the personal puzzle parts not snapping together until the last stretch of the book. If you want to sink your teeth into a romance that hits the fireworks level fast, skip on this one. But if you want a sweet slow burn, then this one might be the book for you. (Especially if you love super grouchy heroes with big horns and bigger attitudes.)",
    "editions": [
        "None"
    ],
    "genres": {
        "aliens": 29,
        "disability": 2,
        "fantasy": 4,
        "humor": 5,
        "male female romance": 2,
        "romance": 16,
        "science fiction": 15,
        "science fiction romance": 5
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "166_1"
        },
        {
            "status": "available",
            "stock_id": "166_2"
        },
        {
            "status": "available",
            "stock_id": "166_3"
        },
        {
            "status": "maintenance",
            "stock_id": "166_4"
        }
    ],
    "metrics": {
        "rating_votes": 1127,
        "score": 4.15
    },
    "pages": 324,
    "title": "The Quarry Master",
    "url": "https://www.goodreads.com/book/show/54622047-the-quarry-master",
    "year_published": 2020
}