{
    "author_name": "M.A. Church",
    "base_id": 167,
    "book_description": "We are not alone. In the year 2050 mankind’s never-ending quest for proof life exists in the universe is answered—in the form of massive space ships that appear without warning above the capitals of all major nations. The name of their planet is Tah’Nar—and is dying. The United States sets up a lottery system, and each young man between the ages of twenty-three and twenty-eight is assigned a number. Once a year, for the next five years, numbers will be drawn and a new set of one thousand males will be collected. The media coined the expression ‘The Harvest’ for when the Tah’Narian’s collect these young men.Captain Keyno Landium Shou is a Tah’Narian starship captain who has been granted the right to take a mate, any mate, he wants during the last harvest on Earth. Dale was seventeen when the aliens first appeared. His parents assumed he’d be safe since the final collection would be done before he turned twenty-three. He didn’t fall within the guidelines established, so they took for granted he had nothing to fear. They were wrong.",
    "book_title": "Taken",
    "editions": [
        "English"
    ],
    "genres": {
        "aliens": 69,
        "bdsm": 21,
        "erotica": 21,
        "fantasy": 21,
        "gay": 21,
        "male male romance": 88,
        "paranormal": 11,
        "romance": 47,
        "science fiction": 68
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_number": "167_1"
        },
        {
            "status": "maintenance",
            "stock_number": "167_2"
        },
        {
            "status": "on_loan",
            "stock_number": "167_3"
        },
        {
            "status": "on_loan",
            "stock_number": "167_4"
        },
        {
            "status": "on_loan",
            "stock_number": "167_5"
        },
        {
            "status": "maintenance",
            "stock_number": "167_6"
        },
        {
            "status": "maintenance",
            "stock_number": "167_7"
        },
        {
            "status": "available",
            "stock_number": "167_8"
        }
    ],
    "metrics": {
        "rating_votes": 1635,
        "score": 3.82
    },
    "original_book_title": "9781626330252",
    "pages": 933,
    "url": "https://www.goodreads.com/book/show/23298360-taken",
    "year_published": 2013
}