{
    "author": "Laurann Dohner",
    "base_id": 17,
    "description": "Ral's WomanAriel never knew aliens existed until she finds herself kidnapped and taken from Earth. When the Anzon declare humans useless, she learns her fate-prize for the winner of a brutal fight between large, muscled alien men. Ral is a Zorn warrior. He has also been kidnapped by the Anzon, along with his crew. Forced into slavery, he's got one thing on his mind-freeing his people. That is, until he sees the small human woman he's willing to fight to win. He doesn't just want her body, he wants her heart forever. In the hands of a hot alien, Ariel is about to discover how pleasurable captivity can be.Kidnapping Casey All Casey wants is to avoid being arrested on trumped-up charges from her persistent ex-boyfriend. Running through the woods to escape two deputies sounds like a great plan until they catch her. Thinking it's all over, waiting to hear the snap of the handcuffs, she instead hears a roar. A huge, tall, muscular man comes to her rescue. She's being saved by Bigfoot-and he's the sexiest thing she's ever seen. The attraction between them is instant, and after spending a little time with him, Casey wants to take him home and keep him. There are a few problems with that plan. He's not the legendary creature, but he definitely isn't human. Argernon is a warrior from Zorn. They do have one thing in common-he wants to take her home and keep her. He's kidnapping Casey.",
    "editions": [
        "English"
    ],
    "genres": {
        "aliens": 18,
        "erotic romance": 6,
        "erotica": 13,
        "fantasy": 5,
        "futuristic": 4,
        "paranormal": 6,
        "paranormal romance": 9,
        "romance": 10,
        "science fiction": 19,
        "science fiction romance": 8
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_id": "17_1"
        }
    ],
    "metrics": {
        "rating_votes": 1782,
        "score": 4.34
    },
    "pages": 961,
    "title": "Loving Zorn (Zorn Warriors, #1-2",
    "url": "https://www.goodreads.com/book/show/9072098-loving-zorn",
    "year_published": 2010
}