{
    "author": "China Miéville",
    "id": "1742",
    "description": "Aboard a vast seafaring vessel, a band of prisoners and slaves, their bodies remade into grotesque biological oddities, is being transported to the fledgling colony of Nova Esperium. But the journey is not theirs alone. They are joined by a handful of travelers, each with a reason for fleeing the city. Among them is Bellis Coldwine, a linguist whose services as an interpreter grant her passage—and escape from horrific punishment. For she is linked to Isaac Dan der Grimnebulin, the brilliant renegade scientist who has unwittingly unleashed a nightmare upon New Crobuzon.For Bellis, the plan is clear: live among the new frontiersmen of the colony until it is safe to return home. But when the ship is besieged by pirates on the Swollen Ocean, the senior officers are summarily executed. The surviving passengers are brought to Armada, a city constructed from the hulls of pirated ships, a floating, landless mass ruled by the bizarre duality called the Lovers. On Armada, everyone is given work, and even Remade live as equals to humans, Cactacae, and Cray. Yet no one may ever leave.Lonely and embittered in her captivity, Bellis knows that to show dissent is a death sentence. Instead, she must furtively seek information about Armada’s agenda. The answer lies in the dark, amorphous shapes that float undetected miles below the waters—terrifying entities with a singular, chilling mission. . . .",
    "editions": [
        "english"
    ],
    "genres": {
        "fantasy": 1701,
        "fantasy (urban fantasy)": 62,
        "fantasy (weird fiction)": 90,
        "fiction": 463,
        "horror": 67,
        "science fiction": 426,
        "science fiction (steampunk)": 329,
        "science fiction fantasy": 93,
        "speculative fiction": 59,
        "weird fiction (new weird)": 126
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_id": "1742_1"
        },
        {
            "status": "maintenance",
            "stock_id": "1742_2"
        },
        {
            "status": "maintenance",
            "stock_id": "1742_3"
        },
        {
            "status": "maintenance",
            "stock_id": "1742_4"
        }
    ],
    "metrics": {
        "rating_votes": 28529,
        "score": 4.17
    },
    "pages": 369,
    "title": "The Scar",
    "url": "https://www.goodreads.com/book/show/68497.The_Scar",
    "year_published": 2002
}