{
    "author": "Honey Phillips",
    "base_id": 178,
    "description": "Anna Elliott wanted to get away. But an alien spaceship was not on the itinerary.All Anna needed was a calm, relaxing vacation. Instead, she finds herself enslaved aboard an alien spacecraft and forced to help an injured prisoner — a huge, golden-skinned warrior. Even wounded, he arouses her in ways she’s never known. But if he dies, so does she.When the spaceship crashes on a strange planet, she must put her trust in him to survive. But the passion he stirs in her may cause her to lose her heart as well.Jakkar is a Sardoran mercenary searching desperately for a new planet to replace his dying home world. He never expected to be injured, captured, and then shipwrecked. Forbidden to mate outside his species, he can’t help but be tempted by Anna’s curvy body and her caring heart.Now he’s responsible for the small group of survivors — and the luscious little human he’s determined to claim as his own.Can a girl and her alien find happiness on a deserted planet at the far end of the galaxy?Each book in the Alien Abduction series features a different couple and can be enjoyed as a standalone romance.",
    "editions": [
        "English"
    ],
    "genres": {
        "adult": 2,
        "aliens": 41,
        "erotica": 9,
        "fantasy": 6,
        "fiction": 2,
        "male female romance": 2,
        "paranormal": 6,
        "romance": 21,
        "science fiction": 35,
        "science fiction romance": 12
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "178_1"
        },
        {
            "status": "available",
            "stock_id": "178_2"
        },
        {
            "status": "on_loan",
            "stock_id": "178_3"
        },
        {
            "status": "on_loan",
            "stock_id": "178_4"
        },
        {
            "status": "available",
            "stock_id": "178_5"
        },
        {
            "status": "available",
            "stock_id": "178_6"
        },
        {
            "status": "maintenance",
            "stock_id": "178_7"
        }
    ],
    "metrics": {
        "rating_votes": 1613,
        "score": 3.96
    },
    "pages": 647,
    "title": "Anna and the Alien",
    "url": "https://www.goodreads.com/book/show/42076632-anna-and-the-alien",
    "year_published": 2018
}