{
    "author": "Rosemary Wells",
    "base_id": "180",
    "description": "Trains and time travel spur one boy's thrilling adventure as he seeks to rejoin his father in a new classic from Rosemary Wells and Bagram Ibatoulline. (Age 10 and up)One day in a house at the end of Lucifer Street, on the Mississippi River side of Cairo, Illinois, eleven-year-old Oscar Ogilvie's life is changed forever. The Crash of 1929 has rippled across the country, and Oscar's dad must sell their home--with all their cherished model trains--and head west in search of work. Forced to move in with his humorless aunt, Carmen and his teasing cousin, Willa Sue, Oscar is lonely and miserable--until he meets a mysterious drifter and witnesses a crime so stunning it catapults Oscar on an incredible train journey from coast to coast, from one decade to another. Filled with suspense and peppered with witty encounters with Hollywood stars and other bigwigs of history, this captivating novel by Rosemary Wells, gorgeously illustrated by Bagram Ibatoulline, resonates with warmth, humor, and the true magic of a timeless adventure.",
    "editions": [
        "english"
    ],
    "genres": {
        "adventure": 21,
        "childrens": 21,
        "childrens (juvenile)": 13,
        "childrens (middle grade)": 16,
        "fantasy": 41,
        "fiction": 16,
        "historical (historical fiction)": 49,
        "science fiction": 9,
        "science fiction (time travel)": 24,
        "young adult": 9
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "180_1"
        },
        {
            "status": "on_loan",
            "stock_id": "180_2"
        },
        {
            "status": "maintenance",
            "stock_id": "180_3"
        },
        {
            "status": "on_loan",
            "stock_id": "180_4"
        }
    ],
    "metrics": {
        "rating_votes": 834,
        "score": 3.89
    },
    "pages": 1319,
    "title": "On the Blue Comet",
    "url": "https://www.goodreads.com/book/show/8036437-on-the-blue-comet",
    "year_published": 2010
}