{
  "author": "Katherine Arden",
  "id": "18077",
  "description": "At the edge of the Russian wilderness, winter lasts most of the year and the snowdrifts grow taller than houses. But Vasilisa doesn't mind—she spends the winter nights huddled around the embers of a fire with her beloved siblings, listening to her nurse's fairy tales. Above all, she loves the chilling story of Frost, the blue-eyed winter demon, who appears in the frigid night to claim unwary souls. Wise Russians fear him, her nurse says, and honor the spirits of house and yard and forest that protect their homes from evil.After Vasilisa's mother dies, her father goes to Moscow and brings home a new wife. Fiercely devout, city-bred, Vasilisa's new stepmother forbids her family from honoring the household spirits. The family acquiesces, but Vasilisa is frightened, sensing that more hinges upon their rituals than anyone knows.And indeed, crops begin to fail, evil creatures of the forest creep nearer, and misfortune stalks the village. All the while, Vasilisa's stepmother grows ever harsher in her determination to groom her rebellious stepdaughter for either marriage or confinement in a convent.As danger circles, Vasilisa must defy even the people she loves and call on dangerous gifts she has long concealed—this, in order to protect her family from a threat that seems to have stepped from her nurse's most frightening tales.The Bear and the Nightingale is a magical debut novel from a gifted and gorgeous voice. It spins an irresistible spell as it announces the arrival of a singular talent.",
  "editions": [
    "english"
  ],
  "genres": [
    "adult",
    "audiobook",
    "cultural (russia)",
    "fantasy",
    "fantasy (fairy tales)",
    "fantasy (mythology)",
    "fiction",
    "historical",
    "historical (historical fiction)",
    "young adult"
  ],
  "inventory": [
    {
      "status": "available",
      "stock_id": "18077_1"
    },
    {
      "status": "maintenance",
      "stock_id": "18077_2"
    }
  ],
  "metrics": {
    "rating_votes": 131134,
    "score": 4.09
  },
  "pages": 737,
  "title": "The Bear and the Nightingale",
  "url": "https://www.goodreads.com/book/show/25489134-the-bear-and-the-nightingale",
  "year_published": 2017
}
