{
    "author": "V.E. Schwab",
    "base_id": "18087",
    "description": "A masterful tale of ambition, jealousy, desire, and superpowers.Victor and Eli started out as college roommates—brilliant, arrogant, lonely boys who recognized the same sharpness and ambition in each other. In their senior year, a shared research interest in adrenaline, near-death experiences, and seemingly supernatural events reveals an intriguing possibility: that under the right conditions, someone could develop extraordinary abilities. But when their thesis moves from the academic to the experimental, things go horribly wrong.Ten years later, Victor breaks out of prison, determined to catch up to his old friend (now foe), aided by a young girl whose reserved nature obscures a stunning ability. Meanwhile, Eli is on a mission to eradicate every other super-powered person that he can find—aside from his sidekick, an enigmatic woman with an unbreakable will. Armed with terrible power on both sides, driven by the memory of betrayal and loss, the archnemeses have set a course for revenge—but who will be left alive at the end?In Vicious, V. E. Schwab brings to life a gritty comic-book-style world in vivid prose: a world where gaining superpowers doesn't automatically lead to heroism, and a time when allegiances are called into question.",
    "editions": [
        "english",
        "spanish",
        "french"
    ],
    "genres": {
        "adult": 1203,
        "adult fiction": 283,
        "comics (superheroes)": 357,
        "fantasy": 5758,
        "fantasy (paranormal)": 741,
        "fantasy (supernatural)": 198,
        "fantasy (urban fantasy)": 498,
        "fiction": 1278,
        "science fiction": 1772,
        "young adult": 545
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_id": "18087_1"
        },
        {
            "status": "maintenance",
            "stock_id": "18087_2"
        },
        {
            "status": "available",
            "stock_id": "18087_3"
        },
        {
            "status": "available",
            "stock_id": "18087_4"
        },
        {
            "status": "on_loan",
            "stock_id": "18087_5"
        }
    ],
    "metrics": {
        "rating_votes": 114238,
        "score": 4.2
    },
    "pages": 1294,
    "title": "Vicious",
    "url": "https://www.goodreads.com/book/show/40874032-vicious",
    "year_published": 2013
}