{
    "author": "Amy A. Bartol",
    "base_id": 1826,
    "description": "Kricket Hollowell is normally not one to wish upon stars; she believes they’re rarely in her favor. Well versed at dodging caseworkers from Chicago’s foster care system, the past few years on her own have made Kricket an expert at the art of survival and blending in. With her 18th birthday fast approaching, she dreams of the day when she can stop running and find what her heart needs most: a home. Trey Allairis hates Earth and doubts that anyone from his world can thrive here. What he’s learning of Kricket and her existence away from her true home only confirms his theory. But, when he and Kricket lie together under the stars of Ethar, counting them all may be easier than letting her go. Kyon Ensin’s secrets number the stars; he knows more about Kricket's gifts than anyone and plans to possess her because of them. He also knows she’s more valuable than any fire in the night sky. He’ll move the heavens and align them all in order to make her his own. When everything in their world can be broken, will Kricket rely upon love to save her under different stars?",
    "editions": [
        "English"
    ],
    "genres": {
        "aliens": 92,
        "dystopia": 43,
        "fantasy": 377,
        "fiction": 59,
        "new adult": 69,
        "paranormal": 122,
        "paranormal romance": 51,
        "romance": 250,
        "science fiction": 186,
        "young adult": 275
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "1826_1"
        },
        {
            "status": "available",
            "stock_id": "1826_2"
        },
        {
            "status": "available",
            "stock_id": "1826_3"
        },
        {
            "status": "on_loan",
            "stock_id": "1826_4"
        },
        {
            "status": "on_loan",
            "stock_id": "1826_5"
        },
        {
            "status": "maintenance",
            "stock_id": "1826_6"
        },
        {
            "status": "available",
            "stock_id": "1826_7"
        },
        {
            "status": "on_loan",
            "stock_id": "1826_8"
        },
        {
            "status": "maintenance",
            "stock_id": "1826_9"
        }
    ],
    "metrics": {
        "rating_votes": 17813,
        "score": 4.21
    },
    "pages": 1002,
    "title": "Under Different Stars",
    "url": "https://www.goodreads.com/book/show/19504931-under-different-stars",
    "year_published": 2013
}