{
    "author": "Haruki Murakami",
    "id": "18354",
    "description": "The year is 1984 and the city is Tokyo.A young woman named Aomame follows a taxi driver’s enigmatic suggestion and begins to notice puzzling discrepancies in the world around her. She has entered, she realizes, a parallel existence, which she calls 1Q84 —“Q is for ‘question mark.’ A world that bears a question.” Meanwhile, an aspiring writer named Tengo takes on a suspect ghostwriting project. He becomes so wrapped up with the work and its unusual author that, soon, his previously placid life begins to come unraveled. As Aomame’s and Tengo’s narratives converge over the course of this single year, we learn of the profound and tangled connections that bind them ever closer: a beautiful, dyslexic teenage girl with a unique vision; a mysterious religious cult that instigated a shoot-out with the metropolitan police; a reclusive, wealthy dowager who runs a shelter for abused women; a hideously ugly private investigator; a mild-mannered yet ruthlessly efficient bodyguard; and a peculiarly insistent television-fee collector.A love story, a mystery, a fantasy, a novel of self-discovery, a dystopia to rival George Orwell’s — 1Q84 is Haruki Murakami’s most ambitious undertaking yet: an instant best seller in his native Japan, and a tremendous feat of imagination from one of our most revered contemporary writers.",
    "editions": [
        "english",
        "spanish",
        "french"
    ],
    "genres": {
        "asian literature (japanese literature)": 632,
        "contemporary": 427,
        "cultural (japan)": 887,
        "fantasy": 1751,
        "fiction": 4432,
        "literature": 354,
        "magical realism": 997,
        "novels": 331,
        "science fiction": 772,
        "science fiction (dystopia)": 269
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "18354_1"
        },
        {
            "status": "available",
            "stock_id": "18354_2"
        },
        {
            "status": "maintenance",
            "stock_id": "18354_3"
        },
        {
            "status": "available",
            "stock_id": "18354_4"
        },
        {
            "status": "on_loan",
            "stock_id": "18354_5"
        }
    ],
    "metrics": {
        "rating_votes": 210012,
        "score": 3.92
    },
    "pages": 1352,
    "title": "1Q84",
    "url": "https://www.goodreads.com/book/show/10357575-1q84",
    "year_published": 2009
}