{
    "author": "Alan Moore",
    "id": "1851",
    "description": "\"I shall tell you where we are. We're in the most extreme and utter region of the human mind. A dim, subconscious underworld. A radiant abyss where men meet themselves. Hell, Netley. We're in Hell.\" Having proved himself peerless in the arena of reinterpreting superheroes, Alan Moore turned his ever-incisive eye to the squalid, enigmatic world of Jack the Ripper and the Whitechapel murders of 1888. Weighing in at 576 pages, From Hell is certainly the most epic of Moore's works and remarkably and is possibly his finest effort yet in a career punctuated by such glorious highlights as Watchmen and V for Vendetta. Going beyond the myriad existing theories, which range from the sublime to the ridiculous, Moore presents an ingenious take on the slaughter. His Ripper's brutal activities are the epicentre of a conspiracy involving the very heart of the British Establishment, including the Freemasons and The Royal Family. A popular claim, which is transformed through Moore's exquisite and thoroughly gripping vision, of the Ripper crimes being the womb from which the 20th century, so enmeshed in the celebrity culture of violence, received its shocking, visceral birth. Bolstered by meticulous research that encompasses a wide spectrum of Ripper studies and myths and coupled with his ability to evoke sympathies in such monstrous characters, Moore has created perhaps the finest examination of the Ripper legacy, observing far beyond society's obsessive need to expose Evil's visage. Ultimately, as Moore observes, Jack's identity and his actions are inconsequential to the manner in which society embraced the Fear: \"It's about us. It's about our minds and how they dance. Jack mirrors our hysterias. Faceless, he is the receptacle for each new social panic.\" Eddie Campbell's stunning black and white artwork, replete with a scratchy, dirty sheen, is perfectly matched to the often-unshakeable intensity of Moore's writing. Between them, each murder is rendered in horrifying detail, providing the book's most unnerving scenes, made more so in uncomfortable, yet lyrical moments as when the villain embraces an eviscerated corpse, craving understanding; pleading that they \"are wed in legend, inextricable within eternity\". Though technically a comic, the term hardly begins to describe From Hell's inimitable grandeur and finesse, as it takes the medium to fresh heights of ingenuity and craftsmanship. Moore and Campbell's autopsy on the emaciated corpse of the Ripper myth has divulged a deeply disturbing yet undeniably captivating masterpiece. —Danny Graydon",
    "editions": [
        "english",
        "spanish"
    ],
    "genres": {
        "comics (comic book)": 126,
        "fiction": 375,
        "graphic novels comics": 169,
        "historical": 78,
        "historical (historical fiction)": 365,
        "horror": 657,
        "mystery": 105,
        "mystery (crime)": 163,
        "sequential art (comics)": 1474,
        "sequential art (graphic novels)": 1814
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_id": "1851_1"
        },
        {
            "status": "on_loan",
            "stock_id": "1851_2"
        },
        {
            "status": "maintenance",
            "stock_id": "1851_3"
        },
        {
            "status": "maintenance",
            "stock_id": "1851_4"
        },
        {
            "status": "on_loan",
            "stock_id": "1851_5"
        },
        {
            "status": "on_loan",
            "stock_id": "1851_6"
        },
        {
            "status": "available",
            "stock_id": "1851_7"
        },
        {
            "status": "on_loan",
            "stock_id": "1851_8"
        },
        {
            "status": "on_loan",
            "stock_id": "1851_9"
        }
    ],
    "metrics": {
        "rating_votes": 34013,
        "score": 4.18
    },
    "pages": 700,
    "title": "From Hell",
    "url": "https://www.goodreads.com/book/show/23529.From_Hell",
    "year_published": 1999
}