{
    "author": "Jonathan Stroud",
    "base_id": "1857",
    "description": "As a massive outbreak of supernatural Visitors baffles Scotland Yard and causes protests throughout London, Lockwood & Co. continue to demonstrate their effectiveness in exterminating spirits. Anthony Lockwood is dashing, George insightful, and Lucy dynamic, while the skull in the jar utters sardonic advice from the sidelines. There is a new spirit of openness in the team now that Lockwood has shared some of his childhood secrets, and Lucy is feeling more and more as if her true home is at Portland Row. It comes as a great shock, then, when Lockwood and George introduce her to an annoyingly perky and hyper-efficient new assistant, Holly Munro.Meanwhile, there are reports of many new hauntings, including a house where bloody footprints are appearing, and a department store full of strange sounds and shadowy figures. But ghosts seem to be the least of Lockwood & Co.'s concerns when assassins attack during a carnival in the center of the city. Can the team get past their personal issues to save the day on all fronts, or will bad feelings attract yet more trouble?Danger abounds, tensions escalate, and new loyalties form in this third delightfully terrifying adventure in the critically acclaimed Lockwood & Co. series.",
    "editions": [
        "english",
        "spanish",
        "french"
    ],
    "genres": {
        "adventure": 82,
        "childrens (middle grade)": 168,
        "fantasy": 633,
        "fantasy (paranormal)": 221,
        "fantasy (supernatural)": 84,
        "fiction": 123,
        "horror": 261,
        "mystery": 264,
        "paranormal (ghosts)": 143,
        "young adult": 359
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "1857_1"
        }
    ],
    "metrics": {
        "rating_votes": 13903,
        "score": 4.37
    },
    "pages": 678,
    "title": "The Hollow Boy",
    "url": "https://www.goodreads.com/book/show/24397043-the-hollow-boy",
    "year_published": 2015
}