{
    "author": "Amie Kaufman",
    "base_id": 1897,
    "description": "A year ago, Flynn Cormac and Jubilee Chase made the now infamous Avon Broadcast, calling on the galaxy to witness for their planet, and protect them from destruction. Some say Flynn’s a madman, others whisper about conspiracies. Nobody knows the truth. A year before that, Tarver Merendsen and Lilac LaRoux were rescued from a terrible shipwreck—now, they live a public life in front of the cameras, and a secret life away from the world’s gaze.Now, in the center of the universe on the planet of Corinth, all four are about to collide with two new players, who will bring the fight against LaRoux Industries to a head. Gideon Marchant is an eighteen-year-old computer hacker—a whiz kid and an urban warrior. He’ll climb, abseil and worm his way past the best security measures to pull off onsite hacks that others don’t dare touch.Sofia Quinn has a killer smile, and by the time you’re done noticing it, she’s got you offering up your wallet, your car, and anything else she desires. She holds LaRoux Industries responsible for the mysterious death of her father and is out for revenge at any cost.When a LaRoux Industries security breach interrupts Gideon and Sofia’s separate attempts to infiltrate their headquarters, they’re forced to work together to escape. Each of them has their own reason for wanting to take down LaRoux Industries, and neither trusts the other. But working together might be the best chance they have to expose the secrets LRI is so desperate to hide.",
    "editions": [
        "English"
    ],
    "genres": {
        "adventure": 36,
        "aliens": 67,
        "audiobook": 66,
        "dystopia": 77,
        "fantasy": 203,
        "fiction": 63,
        "romance": 347,
        "science fiction": 603,
        "space": 88,
        "young adult": 514
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "1897_1"
        },
        {
            "status": "maintenance",
            "stock_id": "1897_2"
        },
        {
            "status": "available",
            "stock_id": "1897_3"
        },
        {
            "status": "available",
            "stock_id": "1897_4"
        },
        {
            "status": "maintenance",
            "stock_id": "1897_5"
        },
        {
            "status": "on_loan",
            "stock_id": "1897_6"
        },
        {
            "status": "available",
            "stock_id": "1897_7"
        },
        {
            "status": "maintenance",
            "stock_id": "1897_8"
        },
        {
            "status": "on_loan",
            "stock_id": "1897_9"
        }
    ],
    "metrics": {
        "rating_votes": 11978,
        "score": 4.12
    },
    "pages": 676,
    "title": "Their Fractured Light",
    "url": "https://www.goodreads.com/book/show/13138736-their-fractured-light",
    "year_published": 2015
}