{
    "author": "Clint McElroy",
    "base_id": "1905",
    "description": "Welcome to the Adventure Zone!SEE! The illustrated exploits of three lovable dummies set loose in a classic fantasy adventure!READ! Their journey from small-time bodyguards to world-class artifact hunters!MARVEL! At the sheer metafictional chutzpah of a graphic novel based on a story created in a podcast where three dudes and their dad play a tabletop role playing game in real time!Join Taako the elf wizard, Merle the dwarf cleric, and Magnus the human warrior for an adventure they are poorly equipped to handle AT BEST, guided (\"guided\") by their snarky DM, in a graphic novel that, like the smash-hit podcast it's based on, will tickle your funny bone, tug your heartstrings, and probably pants you if you give it half a chance.With endearingly off-kilter storytelling from master goofballs Clint McElroy and the McElroy brothers, and vivid, adorable art by Carey Pietsch, The Adventure Zone: Here There be Gerblins is the comics equivalent of role-playing in your friend's basement at 2am, eating Cheetos and laughing your ass off as she rolls critical failure after critical failure.",
    "editions": [
        "english",
        "spanish"
    ],
    "genres": {
        "adult": 38,
        "adventure": 77,
        "comics (comic book)": 42,
        "fantasy": 858,
        "fiction": 166,
        "graphic novels comics": 76,
        "humor": 177,
        "humor (comedy)": 40,
        "sequential art (comics)": 558,
        "sequential art (graphic novels)": 854
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "1905_1"
        },
        {
            "status": "maintenance",
            "stock_id": "1905_2"
        },
        {
            "status": "on_loan",
            "stock_id": "1905_3"
        },
        {
            "status": "maintenance",
            "stock_id": "1905_4"
        },
        {
            "status": "available",
            "stock_id": "1905_5"
        }
    ],
    "metrics": {
        "rating_votes": 19599,
        "score": 4.32
    },
    "pages": 1027,
    "title": "Here There Be Gerblins",
    "url": "https://www.goodreads.com/book/show/35684941-here-there-be-gerblins",
    "year_published": 2018
}