{
  "author": "Justin Cronin",
  "id": "19551",
  "description": "IT HAPPENED FAST.THIRTY-TWO MINUTES FOR ONE WORLD TO DIE, ANOTHER TO BE BORN.First, the unthinkable: a security breach at a secret U.S. government facility unleashes the monstrous product of a chilling military experiment. Then, the unspeakable: a night of chaos and carnage gives way to sunrise on a nation, and ultimately a world, forever altered. All that remains for the stunned survivors is the long fight ahead and a future ruled by fear—of darkness, of death, of a fate far worse.As civilization swiftly crumbles into a primal landscape of predators and prey, two people flee in search of sanctuary. FBI agent Brad Wolgast is a good man haunted by what he's done in the line of duty. Six-year-old orphan Amy Harper Bellafonte is a refugee from the doomed scientific project that has triggered apocalypse. Wolgast is determined to protect her from the horror set loose by her captors, but for Amy, escaping the bloody fallout is only the beginning of a much longer odyssey—spanning miles and decades—toward the time an place where she must finish what should never have begun.With The Passage, award-winning author Justin Cronin has written both a relentlessly suspenseful adventure and an epic chronicle of human endurance in the face of unprecedented catastrophe and unimaginable danger. Its inventive storytelling, masterly prose, and depth of human insight mark it as a crucial and transcendent work of modern fiction.",
  "editions": [
    "english",
    "spanish",
    "french"
  ],
  "genres": [
    "apocalyptic (post apocalyptic)",
    "fantasy",
    "fantasy (paranormal)",
    "fiction",
    "horror",
    "paranormal (vampires)",
    "science fiction",
    "science fiction (apocalyptic)",
    "science fiction (dystopia)",
    "thriller"
  ],
  "inventory": [
    {
      "status": "available",
      "stock_id": "19551_1"
    }
  ],
  "metrics": {
    "rating_votes": 194624,
    "score": 4.03
  },
  "pages": 239,
  "title": "The Passage",
  "url": "https://www.goodreads.com/book/show/6690798-the-passage",
  "year_published": 2010
}
