{
    "author_name": "Kora Knight",
    "base_id": 196,
    "book_description": "Emergency landing. Uncharted planet. Erotic captivity of epic proportions. Right when Captain Alec Hamlin thinks it can’t get any crazier, his team is sold to their captors’ mighty sovereign. King Zercy of the Kríe. Ruler of the planet’s most formidable species. Man, is he imposing. So regal and larger than life. And way too savagely handsome for Alec’s liking. From the first moment he laid eyes on him, he knew the Kríe was trouble, knew he needed to steer clear of him at all costs. But when Zercy chooses Alec to be his personal pet, all plans to dodge the male fall by the wayside. Alec is forced to spend each evening in the alluring king’s company, each night bound to the seductive king’s bed. Wholly at his mercy. Utterly defenseless, in his own mind and most especially his restless body. His struggle is real. Because the more Alec gets to know Zercy, the more he realizes two things. The Kríe king is damaged—unstable, not right, making him unpredictable and highly dangerous. But he is also innately kind beneath the raging storm that torments him. Kind and genuine, with a sad but beautiful soul. Something Alec fights with all he is, not to acknowledge. He can’t fall for Zercy. Zercy is the enemy. The captor of both Alec and his team. Which means Alec needs to get them out of there, before it’s too late. Before emotions overthrow logic and take control of the wheel. If only his body didn’t crave Zercy so fiercely, and his heart didn’t want him just as badly. With Search and Rescue due any day, and Alec’s team getting antsy, Alec is forced to make a decision. He can’t have it both ways. Is he the captain of his men, bound to obligation, or is he a man in love with a Kríe? Warning: Contains explicitly scorching gay sex with exotic and shamelessly kinky males of otherworldly descent.",
    "book_title": "Zercy",
    "editions": [
        "English"
    ],
    "genres": {
        "aliens": 35,
        "erotica": 16,
        "fantasy": 20,
        "lgbt": 7,
        "male male romance": 50,
        "paranormal": 12,
        "paranormal romance": 7,
        "romance": 28,
        "science fiction": 30
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_number": "196_1"
        },
        {
            "status": "maintenance",
            "stock_number": "196_2"
        },
        {
            "status": "maintenance",
            "stock_number": "196_3"
        },
        {
            "status": "on_loan",
            "stock_number": "196_4"
        },
        {
            "status": "on_loan",
            "stock_number": "196_5"
        },
        {
            "status": "maintenance",
            "stock_number": "196_6"
        },
        {
            "status": "on_loan",
            "stock_number": "196_7"
        },
        {
            "status": "on_loan",
            "stock_number": "196_8"
        }
    ],
    "metrics": {
        "rating_votes": 1013,
        "score": 4.38
    },
    "original_book_title": "Zercy",
    "pages": 1207,
    "url": "https://www.goodreads.com/book/show/37660056-zercy",
    "year_published": 2017
}