{
    "author": "Jim McCann",
    "base_id": "203",
    "description": "Welcome to Anorev, a world in between time, where children have played so long it’s almost become work, machines have worked so long they have begun to play and all the clocks have stopped at the same time. This is how this land has remained, until 314 dapper-looking gentlemen rain down from the sky and set off in different directions to start the world again. Now Ayden, the only boy to still ask questions; Zoe, the robot girl all other machines hold dear; and the Dapper Man known only as \"41” must discover what happened that made time stop, understand what their true places are in this world, and learn what \"tomorrow” really means. The sun is setting for the first time in memory, and once that happens, everything changes.Return of the Dapper Men is a visually stunning fairy tale that combines steampunk with fantasy and science fiction with Renaissance style, brought to life from the minds of award-winning playwright and comic book writer Jim McCann (New Avengers: The Reunion) and critically acclaimed visual artist Janet Lee. Together these two have created a world where J.M. Barrie, Lewis Carroll and Maurice Sendak meet Jim Henson and Tim Burton. All sharply dressed in a pin-stripe suit and a dapper bowler hat. Tick tock, time is about to start.",
    "editions": [
        "english"
    ],
    "genres": {
        "art": 5,
        "childrens": 8,
        "fantasy": 45,
        "fiction": 24,
        "graphic novels comics": 7,
        "science fiction": 9,
        "science fiction (steampunk)": 33,
        "sequential art (comics)": 75,
        "sequential art (graphic novels)": 116,
        "young adult": 9
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_id": "203_1"
        },
        {
            "status": "on_loan",
            "stock_id": "203_2"
        },
        {
            "status": "maintenance",
            "stock_id": "203_3"
        },
        {
            "status": "on_loan",
            "stock_id": "203_4"
        }
    ],
    "metrics": {
        "rating_votes": 1043,
        "score": 3.7
    },
    "pages": 332,
    "title": "Return of the Dapper Men",
    "url": "https://www.goodreads.com/book/show/7842325-return-of-the-dapper-men",
    "year_published": 2010
}