{
    "author_name": "Ilona Andrews",
    "base_id": 2038,
    "book_description": "Dina DeMille isn't your typical Bed and Breakfast owner. Her inn defies laws of physics, her dog is secretly a monster, and the only permanent guest of the inn is a former Galactic tyrant with a price on her head. The inn needs guests to thrive and guests have been scarce, so when an Arbitrator shows up at Dina's door and asks her to host a peace summit between three warring species, she jumps on the chance. Unfortunately, for Dina, bridging the gap between space vampires, the Hope-Crushing Horde, and the merchants of Baha-char is much easier said than done. To make the summit a success, she must find a chef, remodel the inn, keep her guests from murdering each other, and risk everything, even her life, to save the man she might fall in love with. But then it's all in the day's work for an Innkeeper.…“Andrews is an auto-buy no matter what the genre!” —Romantic Times“If there is one author that defines Urban fantasy, it is Ilona Andrews.” —Annie Tegelan, Fresh Fiction\"One of the brightest voices in urban fantasy and one of my favorite authors. Ilona Andrews delivers only the best.\" —New York Times bestselling author Jeaniene Frost",
    "book_title": "Sweep in Peace",
    "editions": [
        "English"
    ],
    "genres": {
        "aliens": 143,
        "fantasy": 1146,
        "magic": 353,
        "paranormal": 499,
        "romance": 290,
        "science fiction": 343,
        "shapeshifters": 120,
        "urban fantasy": 1130,
        "vampires": 366,
        "werewolves": 121
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_number": "2038_1"
        },
        {
            "status": "maintenance",
            "stock_number": "2038_2"
        },
        {
            "status": "maintenance",
            "stock_number": "2038_3"
        },
        {
            "status": "on_loan",
            "stock_number": "2038_4"
        },
        {
            "status": "on_loan",
            "stock_number": "2038_5"
        },
        {
            "status": "available",
            "stock_number": "2038_6"
        },
        {
            "status": "on_loan",
            "stock_number": "2038_7"
        },
        {
            "status": "available",
            "stock_number": "2038_8"
        },
        {
            "status": "on_loan",
            "stock_number": "2038_9"
        }
    ],
    "metrics": {
        "rating_votes": 28087,
        "score": 4.3
    },
    "original_book_title": "Sweep in Peace",
    "pages": 560,
    "url": "https://www.goodreads.com/book/show/19504964-sweep-in-peace",
    "year_published": 2015
}