{
    "author": "Pittacus Lore",
    "id": "2077",
    "description": "The seventh and final book in the #1 New York Times bestselling I Am Number Four series! With United as One, this action-packed series comes to a surprising, breathtaking, and utterly satisfying conclusion. The Garde didn’t start this war, but they’ll do whatever it takes to end it once and for all. . . . The Mogadorians have invaded Earth. Their warships loom over our most populated cities, and no country will risk taking them head on. The Garde are all that stand in the way, but they’ll need an army of their own to win this fight. They’ve teamed up with the US military, but it might not be enough. The Garde need reinforcements, and they’ve found them in the most unexpected place. Teenagers from across the globe, like John Smith’s best friend, Sam, have developed abilities. So John and the others must get to them before the Mogs, because if they don’t their enemies will use these gifted teens for their own sinister plan. But after all the Mogadorians have taken from John—his home, his family, his friends, and the person he loves most—he might not want to put any more lives in danger. He’s got nothing left to lose, and he’s just discovered he has been given an incredible new Legacy. Now he can turn himself into the ultimate weapon. So will he risk his life to save the world, or will he realize that power in numbers will save us all?",
    "editions": [
        "english",
        "spanish"
    ],
    "genres": {
        "adventure": 44,
        "audiobook": 36,
        "fantasy": 290,
        "fantasy (paranormal)": 31,
        "fiction": 100,
        "science fiction": 267,
        "science fiction (aliens)": 112,
        "science fiction (dystopia)": 33,
        "young adult": 389,
        "young adult (teen)": 34
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "2077_1"
        },
        {
            "status": "available",
            "stock_id": "2077_2"
        },
        {
            "status": "on_loan",
            "stock_id": "2077_3"
        },
        {
            "status": "available",
            "stock_id": "2077_4"
        },
        {
            "status": "on_loan",
            "stock_id": "2077_5"
        },
        {
            "status": "available",
            "stock_id": "2077_6"
        }
    ],
    "metrics": {
        "rating_votes": 24532,
        "score": 4.31
    },
    "pages": 431,
    "title": "United as One",
    "url": "https://www.goodreads.com/book/show/27161189-united-as-one",
    "year_published": 2016
}