{
  "author": "Neal Stephenson",
  "id": "2085",
  "description": "The #1 New York Times bestselling author of Seveneves, Anathem, Reamde, and Cryptonomicon returns with a wildly inventive and entertaining science fiction thriller—Paradise Lost by way of Phillip K. Dick—that unfolds in the near future, in parallel worlds.In his youth, Richard “Dodge” Forthrast founded Corporation 9592, a gaming company that made him a multibillionaire. Now in his middle years, Dodge appreciates his comfortable, unencumbered life, managing his myriad business interests, and spending time with his beloved niece Zula and her young daughter, Sophia.One beautiful autumn day, while he undergoes a routine medical procedure, something goes irrevocably wrong. Dodge is pronounced brain dead and put on life support, leaving his stunned family and close friends with difficult decisions. Long ago, when a much younger Dodge drew up his will, he directed that his body be given to a cryonics company now owned by enigmatic tech entrepreneur Elmo Shepherd. Legally bound to follow the directive despite their misgivings, Dodge’s family has his brain scanned and its data structures uploaded and stored in the cloud, until it can eventually be revived.In the coming years, technology allows Dodge’s brain to be turned back on. It is an achievement that is nothing less than the disruption of death itself. An eternal afterlife—the Bitworld—is created, in which humans continue to exist as digital souls.But this brave new immortal world is not the Utopia it might first seem . . .Fall, or Dodge in Hell is pure, unadulterated fun: a grand drama of analog and digital, man and machine, angels and demons, gods and followers, the finite and the eternal. In this exhilarating epic, Neal Stephenson raises profound existential questions and touches on the revolutionary breakthroughs that are transforming our future. Combining the technological, philosophical, and spiritual in one grand myth, he delivers a mind-blowing speculative literary saga for the modern age.",
  "editions": [
    "english",
    "spanish",
    "french"
  ],
  "genres": [
    "audiobook",
    "fantasy",
    "fiction",
    "novels",
    "science fiction",
    "science fiction (cyberpunk)",
    "science fiction (dystopia)",
    "science fiction fantasy",
    "speculative fiction",
    "unfinished"
  ],
  "inventory": [
    {
      "status": "on_loan",
      "stock_id": "2085_1"
    },
    {
      "status": "maintenance",
      "stock_id": "2085_2"
    },
    {
      "status": "available",
      "stock_id": "2085_3"
    }
  ],
  "metrics": {
    "rating_votes": 13024,
    "score": 3.56
  },
  "pages": 858,
  "title": "Fall; or, Dodge in Hell",
  "url": "https://www.goodreads.com/book/show/41824495-fall-or-dodge-in-hell",
  "year_published": 2019
}
