{
  "author": "Tad Williams",
  "id": "209",
  "description": "\"The Grail Brotherhood has built the most powerful, sophisticated simulation network imaginable. At the same time, they have manipulated ad injured the minds of thousands of children.\"This proclamation from the mysterious Mr. Sellars confirmed what Renie Sulaweyo had feared to be true when she first broke into the Otherland network in a desperate search for the cause of her brother Stephen's deathlike coma. Now Renie, the Bushman !Xabbu, and their companions find themselves navigating a treacherous and ever-changing course―from a strangely unfinished land, ro a seemingly endless labyrinthine House―pursuing a sociopathic killer who has stolen one of their group. To Renie's despair she is no closer to uncovering the secrets which could help save Stephen's life, and now it appears that something may be very wrong with the Otherland network itself.As Paul Jonas, Orlando, Renie and the rest strive to reach Priam's Walls, in the heart of Troy, they know that their quest is running perilously short of time. For the Grail Brotherhood has finally set the date for the Ceremony when they will make their bid for the immortality, and thereby seal the fate of Earth's children forever.But before Renie and her allies can hope to stop the Brotherhood, they must first solve the mysteries of Otherland itself, and confront its darkest secret―an enitity known only at the Other.",
  "editions": [
    "english"
  ],
  "genres": [
    "adventure",
    "epic",
    "fantasy",
    "fantasy (epic fantasy)",
    "fantasy (urban fantasy)",
    "fiction",
    "science fiction",
    "science fiction (cyberpunk)",
    "science fiction fantasy",
    "speculative fiction"
  ],
  "inventory": [
    {
      "status": "maintenance",
      "stock_id": "209_1"
    },
    {
      "status": "on_loan",
      "stock_id": "209_2"
    },
    {
      "status": "maintenance",
      "stock_id": "209_3"
    },
    {
      "status": "maintenance",
      "stock_id": "209_4"
    },
    {
      "status": "maintenance",
      "stock_id": "209_5"
    },
    {
      "status": "available",
      "stock_id": "209_6"
    },
    {
      "status": "on_loan",
      "stock_id": "209_7"
    },
    {
      "status": "maintenance",
      "stock_id": "209_8"
    }
  ],
  "metrics": {
    "rating_votes": 14660,
    "score": 4.06
  },
  "pages": 1349,
  "title": "Mountain of Black Glass",
  "url": "https://www.goodreads.com/book/show/10090.Mountain_of_Black_Glass",
  "year_published": 1999
}
