{
    "author": "Orson Scott Card",
    "id": "2128",
    "description": "At first, Ender believed that they would bring him back to Earth as soon as things quieted down. But things were quiet now, had been quiet for a year, and it was plain to him now that they would not bring him back at all, that he was much more useful as a name and a story than he would ever be as an inconvenient flesh-and-blood person.At the close of Ender's Game, Andrew Wiggin--called Ender by everyone--knows that he cannot live on Earth. He has become far more than just a boy who won a game: He is the Savior of Earth, a hero, a military genius whose allegiance is sought by every nation of the newly shattered Earth Hegemony.He is offered the choice of living under the Hegemon's control, a pawn in his brother Peter's political games. Or he can join the colony ships and go out to settle one of the new worlds won in the war.The story of those years on the colony worlds has never been told...until now.The voyage was long. By the end of it, Val had finished the first volume of her history of the bugger wars and transmitted it by ansible, under Demosthenes' name, back to Earth, and Ender had won something better than the adulation of the passengers. They knew him now, and he had won their love and their respect.Ender was twelve when he chose to leave his home world and begin the long relativistic journey out to the colonies. With him went his sister, Valentine, and the core of the artificial intelligence that would become Jane. He wrote The Hive Queen and The Hegemon, and his sister wrote The Speaker for the Dead.He served as governor of his first colony world, but now Ender is on the move, looking for a planet where the hive queens might be reestablished.What he finds in the Ganges colony is more than he bargained for--a resentful governor who caused a devastating war on Earth and a brilliant young colonist who is out to destroy him, starting with his reputation and ending, perhaps, with his life.",
    "editions": [
        "english",
        "spanish"
    ],
    "genres": {
        "adventure": 40,
        "audiobook": 55,
        "fantasy": 139,
        "fiction": 478,
        "novels": 33,
        "science fiction": 1283,
        "science fiction (aliens)": 27,
        "science fiction fantasy": 116,
        "space": 49,
        "young adult": 98
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_id": "2128_1"
        },
        {
            "status": "available",
            "stock_id": "2128_2"
        },
        {
            "status": "available",
            "stock_id": "2128_3"
        },
        {
            "status": "on_loan",
            "stock_id": "2128_4"
        },
        {
            "status": "on_loan",
            "stock_id": "2128_5"
        },
        {
            "status": "available",
            "stock_id": "2128_6"
        }
    ],
    "metrics": {
        "rating_votes": 45334,
        "score": 3.91
    },
    "pages": 1030,
    "title": "Ender in Exile",
    "url": "https://www.goodreads.com/book/show/3220405-ender-in-exile",
    "year_published": 2008
}