{
    "author": "Jonathan Stroud",
    "base_id": "2143",
    "description": "In the six months since Anthony, Lucy, and George survived a night in the most haunted house in England, Lockwood & Co. hasn't made much progress. Quill Kipps and his team of Fittes agents keep swooping in on Lockwood's investigations. Finally, in a fit of anger, Anthony challenges his rival to a contest: the next time the two agencies compete on a job, the losing side will have to admit defeat in the Times newspaper.Things look up when a new client, Mr. Saunders, hires Lockwood & Co. to be present at the excavation of Edmund Bickerstaff, a Victorian doctor who reportedly tried to communicate with the dead. Saunders needs the coffin sealed with silver to prevent any supernatural trouble. All goes well-until George's curiosity attracts a horrible phantom. Back home at Portland Row, Lockwood accuses George of making too many careless mistakes. Lucy is distracted by urgent whispers coming from the skull in the ghost jar. Then the team is summoned to DEPRAC headquarters. Kipps is there too, much to Lockwood's annoyance. Bickerstaff's coffin was raided and a strange glass object buried with the corpse has vanished. Inspector Barnes believes the relic to be highly dangerous, and he wants it found.",
    "editions": [
        "english",
        "spanish"
    ],
    "genres": {
        "adventure": 122,
        "childrens (middle grade)": 225,
        "fantasy": 818,
        "fantasy (paranormal)": 289,
        "fantasy (supernatural)": 107,
        "fiction": 150,
        "horror": 317,
        "mystery": 375,
        "paranormal (ghosts)": 182,
        "young adult": 448
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_id": "2143_1"
        },
        {
            "status": "maintenance",
            "stock_id": "2143_2"
        },
        {
            "status": "maintenance",
            "stock_id": "2143_3"
        }
    ],
    "metrics": {
        "rating_votes": 17794,
        "score": 4.33
    },
    "pages": 415,
    "title": "The Whispering Skull",
    "url": "https://www.goodreads.com/book/show/14059024-the-whispering-skull",
    "year_published": 2014
}