{
    "author": "Kira Jane Buxton",
    "base_id": "2148",
    "description": "One pet crow fights to save humanity from an apocalypse in this uniquely hilarious debut from a genre-bending literary author.S.T., a domesticated crow, is a bird of simple pleasures: hanging out with his owner Big Jim, trading insults with Seattle's wild crows (those idiots), and enjoying the finest food humankind has to offer: Cheetos ®.Then Big Jim's eyeball falls out of his head, and S.T. starts to feel like something isn't quite right. His most tried-and-true remedies--from beak-delivered beer to the slobbering affection of Big Jim's loyal but dim-witted dog, Dennis--fail to cure Big Jim's debilitating malady. S.T. is left with no choice but to abandon his old life and venture out into a wild and frightening new world with his trusty steed Dennis, where he discovers that the neighbors are devouring each other and the local wildlife is abuzz with rumors of dangerous new predators roaming Seattle. Humanity's extinction has seemingly arrived, and the only one determined to save it is a foul-mouthed crow whose knowledge of the world around him comes from his TV-watching education.Hollow Kingdom is a humorous, big-hearted, and boundlessly beautiful romp through the apocalypse and the world that comes after, where even a cowardly crow can become a hero.",
    "editions": [
        "english",
        "spanish",
        "french"
    ],
    "genres": {
        "adult": 51,
        "animals": 105,
        "apocalyptic (post apocalyptic)": 83,
        "fantasy": 400,
        "fiction": 369,
        "horror": 106,
        "horror (zombies)": 70,
        "humor": 157,
        "science fiction": 156,
        "science fiction (dystopia)": 111
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_id": "2148_1"
        },
        {
            "status": "available",
            "stock_id": "2148_2"
        },
        {
            "status": "available",
            "stock_id": "2148_3"
        },
        {
            "status": "available",
            "stock_id": "2148_4"
        },
        {
            "status": "on_loan",
            "stock_id": "2148_5"
        }
    ],
    "metrics": {
        "rating_votes": 8691,
        "score": 3.85
    },
    "pages": 1159,
    "title": "Hollow Kingdom",
    "url": "https://www.goodreads.com/book/show/42839296-hollow-kingdom",
    "year_published": 2019
}