{
    "author": "Joseph Bruchac",
    "id": "218",
    "description": "A post-Apocalyptic YA novel with a steampunk twist, based on an Apache legend. Years ago, seventeen-year-old Apache hunter Lozen and her family lived in a world of haves and have-nots. There were the Ones -- people so augmented with technology and genetic enhancements that they were barely human -- and there was everyone else who served them. Then the Cloud came, and everything changed. Tech stopped working. The world plunged back into a new steam age. The Ones' pets -- genetically engineered monsters -- turned on them and are now loose on the world.Lozen was not one of the lucky ones pre-C, but fate has given her a unique set of survival skills and magical abilities. She hunts monsters for the Ones who survived the apocalyptic events of the Cloud, which ensures the safety of her kidnapped family. But with every monster she takes down, Lozen's powers grow, and she connects those powers to an ancient legend of her people. It soon becomes clear to Lozen that she is not just a hired gun. As the legendary Killer of Enemies was in the ancient days of the Apache people, Lozen is meant to be a more than a hunter. Lozen is meant to be a hero.",
    "editions": [
        "english",
        "spanish",
        "french"
    ],
    "genres": {
        "adventure": 10,
        "adventure (survival)": 9,
        "apocalyptic (post apocalyptic)": 24,
        "fantasy": 40,
        "fiction": 18,
        "science fiction": 45,
        "science fiction (dystopia)": 49,
        "science fiction (steampunk)": 15,
        "young adult": 81,
        "young adult (teen)": 11
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_id": "218_1"
        },
        {
            "status": "maintenance",
            "stock_id": "218_2"
        },
        {
            "status": "available",
            "stock_id": "218_3"
        },
        {
            "status": "on_loan",
            "stock_id": "218_4"
        },
        {
            "status": "maintenance",
            "stock_id": "218_5"
        },
        {
            "status": "on_loan",
            "stock_id": "218_6"
        }
    ],
    "metrics": {
        "rating_votes": 724,
        "score": 3.68
    },
    "pages": 981,
    "title": "Killer of Enemies",
    "url": "https://www.goodreads.com/book/show/17946249-killer-of-enemies",
    "year_published": 2013
}