{
  "author": "Lawrence Wright",
  "id": "2206",
  "description": "In this riveting medical thriller--from the Pulitzer Prize winner and best-selling author--Dr. Henry Parsons, an unlikely but appealing hero, races to find the origins and cure of a mysterious new killer virus as it brings the world to its knees.At an internment camp in Indonesia, forty-seven people are pronounced dead with acute hemorrhagic fever. When Henry Parsons--microbiologist, epidemiologist--travels there on behalf of the World Health Organization to investigate, what he finds will soon have staggering repercussions across the globe: an infected man is on his way to join the millions of worshippers in the annual Hajj to Mecca. Now, Henry joins forces with a Saudi prince and doctor in an attempt to quarantine the entire host of pilgrims in the holy city... A Russian émigré, a woman who has risen to deputy director of U.S. Homeland Security, scrambles to mount a response to what may be an act of biowarfare... already-fraying global relations begin to snap, one by one, in the face of a pandemic... Henry's wife Jill and their children face diminishing odds of survival in Atlanta... and the disease slashes across the United States, dismantling institutions--scientific, religious, governmental--and decimating the population. As packed with suspense as it is with the fascinating history of viral diseases, Lawrence Wright has given us a full-tilt, electrifying, one-of-a-kind thriller.",
  "editions": [
    "english",
    "spanish"
  ],
  "genres": [
    "adult",
    "adult fiction",
    "audiobook",
    "fiction",
    "mystery",
    "science fiction",
    "science fiction (dystopia)",
    "suspense",
    "thriller",
    "thriller (mystery thriller)"
  ],
  "inventory": [
    {
      "status": "on_loan",
      "stock_id": "2206_1"
    },
    {
      "status": "on_loan",
      "stock_id": "2206_2"
    },
    {
      "status": "on_loan",
      "stock_id": "2206_3"
    },
    {
      "status": "available",
      "stock_id": "2206_4"
    },
    {
      "status": "available",
      "stock_id": "2206_5"
    }
  ],
  "metrics": {
    "rating_votes": 12986,
    "score": 3.79
  },
  "pages": 1272,
  "title": "The End of October",
  "url": "https://www.goodreads.com/book/show/52669505-the-end-of-october",
  "year_published": 2020
}
