{
    "author_name": "James S.A. Corey",
    "base_id": 2217,
    "book_description": "Thirteen hundred gates have opened to solar systems around the galaxy. But as humanity builds its interstellar empire in the alien ruins, the mysteries and threats grow deeper.In the dead systems where gates lead to stranger things than alien planets, Elvi Okoye begins a desperate search to discover the nature of a genocide that happened before the first human beings existed, and to find weapons to fight a war against forces at the edge of the imaginable. But the price of that knowledge may be higher than she can pay.At the heart of the empire, Teresa Duarte prepares to take on the burden of her father's godlike ambition. The sociopathic scientist Paolo Cortázar and the Mephistophelian prisoner James Holden are only two of the dangers in a palace thick with intrigue, but Teresa has a mind of her own and secrets even her father the emperor doesn't guess.And throughout the wide human empire, the scattered crew of the Rocinante fights a brave rear-guard action against Duarte's authoritarian regime. Memory of the old order falls away, and a future under Laconia's eternal rule -- and with it, a battle that humanity can only lose - seems more and more certain. Because against the terrors that lie between worlds, courage and ambition will not be enough...",
    "book_title": "Tiamat's Wrath",
    "editions": [
        "English"
    ],
    "genres": {
        "adult": 18,
        "adventure": 23,
        "audiobook": 76,
        "fiction": 359,
        "novels": 19,
        "science fiction": 980,
        "science fiction fantasy": 42,
        "space": 44,
        "space opera": 176,
        "speculative fiction": 20
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_number": "2217_1"
        },
        {
            "status": "available",
            "stock_number": "2217_2"
        },
        {
            "status": "available",
            "stock_number": "2217_3"
        },
        {
            "status": "maintenance",
            "stock_number": "2217_4"
        },
        {
            "status": "maintenance",
            "stock_number": "2217_5"
        }
    ],
    "metrics": {
        "rating_votes": 32908,
        "score": 4.57
    },
    "original_book_title": "Tiamat's Wrath",
    "pages": 709,
    "url": "https://www.goodreads.com/book/show/28335698-tiamat-s-wrath",
    "year_published": 2019
}