{
    "author": "George R.R. Martin",
    "base_id": "22369",
    "description": "An alternate cover for this isbn can be found here.Here is the third volume in George R.R. Martin's magnificent cycle of novels that includes A Game of Thrones and A Clash of Kings. Together, this series comprises a genuine masterpiece of modern fantasy, destined to stand as one of the great achievements of imaginative fiction.Of the five contenders for power, one is dead, another in disfavor, and still the wars rage as alliances are made and broken. Joffrey sits on the Iron Throne, the uneasy ruler of the Seven Kingdoms. His most bitter rival, Lord Stannis, stands defeated and disgraced, victim of the sorceress who holds him in her thrall. Young Robb still rules the North from the fortress of Riverrun. Meanwhile, making her way across a blood-drenched continent is the exiled queen, Daenerys, mistress of the only three dragons still left in the world. And as opposing forces manoeuver for the final showdown, an army of barbaric wildlings arrives from the outermost limits of civilization, accompanied by a horde of mythical Others—a supernatural army of the living dead whose animated corpses are unstoppable. As the future of the land hangs in the balance, no one will rest until the Seven Kingdoms have exploded in a veritable storm of swords...",
    "editions": [
        "english"
    ],
    "genres": {
        "adult": 692,
        "adventure": 636,
        "audiobook": 531,
        "epic": 510,
        "fantasy": 27068,
        "fantasy (dragons)": 580,
        "fantasy (epic fantasy)": 1218,
        "fantasy (high fantasy)": 818,
        "fiction": 5659,
        "science fiction fantasy": 951
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_id": "22369_1"
        },
        {
            "status": "on_loan",
            "stock_id": "22369_2"
        }
    ],
    "metrics": {
        "rating_votes": 679450,
        "score": 4.53
    },
    "pages": 623,
    "title": "A Storm of Swords",
    "url": "https://www.goodreads.com/book/show/62291.A_Storm_of_Swords",
    "year_published": 2000
}