{
    "author": "Lev Grossman",
    "base_id": "22521",
    "description": "A thrilling and original coming-of-age novel for adults about a young man practicing magic in the real world.Quentin Coldwater is brilliant but miserable. A senior in high school, he’s still secretly preoccupied with a series of fantasy novels he read as a child, set in a magical land called Fillory. Imagine his surprise when he finds himself unexpectedly admitted to a very secret, very exclusive college of magic in upstate New York, where he receives a thorough and rigorous education in the craft of modern sorcery. He also discovers all the other things people learn in college: friendship, love, sex, booze, and boredom. Something is missing, though. Magic doesn’t bring Quentin the happiness and adventure he dreamed it would. After graduation he and his friends make a stunning discovery: Fillory is real. But the land of Quentin’s fantasies turns out to be much darker and more dangerous than he could have imagined. His childhood dream becomes a nightmare with a shocking truth at its heart. At once psychologically piercing and magnificently absorbing, The Magicians boldly moves into uncharted literary territory, imagining magic as practiced by real people, with their capricious desires and volatile emotions. Lev Grossman creates an utterly original world in which good and evil aren’t black and white, love and sex aren’t simple or innocent, and power comes at a terrible price.",
    "editions": [
        "english"
    ],
    "genres": {
        "adult": 467,
        "adult fiction": 242,
        "adventure": 258,
        "audiobook": 447,
        "fantasy": 10724,
        "fantasy (magic)": 958,
        "fantasy (urban fantasy)": 879,
        "fiction": 2894,
        "science fiction fantasy": 471,
        "young adult": 754
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_id": "22521_1"
        },
        {
            "status": "on_loan",
            "stock_id": "22521_2"
        },
        {
            "status": "available",
            "stock_id": "22521_3"
        },
        {
            "status": "available",
            "stock_id": "22521_4"
        },
        {
            "status": "on_loan",
            "stock_id": "22521_5"
        },
        {
            "status": "on_loan",
            "stock_id": "22521_6"
        },
        {
            "status": "available",
            "stock_id": "22521_7"
        }
    ],
    "metrics": {
        "rating_votes": 240045,
        "score": 3.52
    },
    "pages": 980,
    "title": "The Magicians",
    "url": "https://www.goodreads.com/book/show/6101718-the-magicians",
    "year_published": 2009
}