{
    "author": "Rick Riordan",
    "id": "22570",
    "description": "JASON HAS A PROBLEM. He doesn’t remember anything before waking up in a bus full of kids on a field trip. Apparently he has a girlfriend named Piper, and his best friend is a guy named Leo. They’re all students at the Wilderness School, a boarding school for “bad kids,\" as Leo puts it. What did Jason do to end up here? And where is here, exactly? Jason doesn't know anything—except that everything seems very wrong.PIPER HAS A SECRET. Her father has been missing for three days, ever since she had that terrifying nightmare about his being in trouble. Piper doesn’t understand her dream, or why her boyfriend suddenly doesn’t recognize her. When a freak storm hits during the school trip, unleashing strange creatures and whisking her, Jason, and Leo away to someplace called Camp Half-Blood, she has a feeling she’s going to find out, whether she wants to or not.LEO HAS A WAY WITH TOOLS. When he sees his cabin at Camp Half-Blood, filled with power tools and machine parts, he feels right at home. But there’s weird stuff, too—like the curse everyone keeps talking about, and some camper who's gone missing. Weirdest of all, his bunkmates insist that each of them—including Leo—is related to a god. Does this have anything to do with Jason's amnesia, or the fact that Leo keeps seeing ghosts?Join new and old friends from Camp Half-Blood in this thrilling first book in The Heroes of Olympus series. Best-selling author Rick Riordan has pumped up the action, humor, suspense, and mystery in an epic adventure that will leave readers panting for the next installment.",
    "editions": [
        "english",
        "spanish"
    ],
    "genres": {
        "adventure": 1434,
        "childrens": 708,
        "childrens (middle grade)": 1577,
        "fantasy": 10019,
        "fantasy (mythology)": 3633,
        "fantasy (urban fantasy)": 476,
        "fiction": 1630,
        "mythology (greek mythology)": 565,
        "young adult": 4419,
        "young adult (young adult fantasy)": 402
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "22570_1"
        },
        {
            "status": "available",
            "stock_id": "22570_2"
        },
        {
            "status": "maintenance",
            "stock_id": "22570_3"
        },
        {
            "status": "available",
            "stock_id": "22570_4"
        },
        {
            "status": "on_loan",
            "stock_id": "22570_5"
        },
        {
            "status": "on_loan",
            "stock_id": "22570_6"
        },
        {
            "status": "maintenance",
            "stock_id": "22570_7"
        },
        {
            "status": "on_loan",
            "stock_id": "22570_8"
        }
    ],
    "metrics": {
        "rating_votes": 650418,
        "score": 4.32
    },
    "pages": 1184,
    "title": "The Lost Hero",
    "url": "https://www.goodreads.com/book/show/7736182-the-lost-hero",
    "year_published": 2010
}