{
    "author": "Megan Whalen Turner",
    "base_id": "2258",
    "description": "Sophos, under the guidance of yet another tutor, practices his swordplay and strategizes escape scenarios should his father's villa come under attack. How would he save his mother? His sisters? Himself? Could he reach the horses in time? Where would he go? But nothing prepares him for the day armed men, silent as thieves, swarm the villa courtyard ready to kill, to capture, to kidnap. Sophos, the heir to the throne of Sounis, disappears without a trace. In Attolia, Eugenides, the new and unlikely king, has never stopped wondering what happened to Sophos. Nor has the Queen of Eddis. They send spies. They pay informants. They appeal to the gods. But as time goes by, it becomes less and less certain that they will ever see their friend alive again. Across the small peninsula battles are fought, bribes are offered, and conspiracies are set in motion. Darkening the horizon, the Mede Empire threatens, always, from across the sea. And Sophos, anonymous and alone, bides his time. Sophos, drawing on his memories of Gen, Pol, the Magus and Eddis, sets out on an adventure that will change all of their lives forever.",
    "editions": [
        "english",
        "spanish"
    ],
    "genres": {
        "adventure": 96,
        "audiobook": 53,
        "fantasy": 1119,
        "fantasy (high fantasy)": 61,
        "fantasy (mythology)": 67,
        "fiction": 140,
        "historical (historical fiction)": 35,
        "science fiction fantasy": 42,
        "young adult": 354,
        "young adult (young adult fantasy)": 69
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_id": "2258_1"
        },
        {
            "status": "maintenance",
            "stock_id": "2258_2"
        },
        {
            "status": "maintenance",
            "stock_id": "2258_3"
        },
        {
            "status": "on_loan",
            "stock_id": "2258_4"
        },
        {
            "status": "available",
            "stock_id": "2258_5"
        }
    ],
    "metrics": {
        "rating_votes": 21588,
        "score": 4.1
    },
    "pages": 1071,
    "title": "A Conspiracy of Kings",
    "url": "https://www.goodreads.com/book/show/6527841-a-conspiracy-of-kings",
    "year_published": 2010
}