{
    "author": "Laurann Dohner",
    "base_id": 231,
    "description": "After barely surviving a horrific accident, then being held captive for years by Earth Government, Venice must escape the planet. She thinks she’s found the answer to her prayers when she contracts to be a deep-space bride—only to find herself facing an even bigger nightmare. Hiding from her con man “husband” aboard his space station, she comes across an intimidating cyborg…one who could just be her last hope.Deviant is humiliated when his father suggests he visit a pleasure center to make use of a sex bot. True, the defects he was born with have assured female cyborgs will never consider adding him to a family unit. But he still has his pride. The woman who enters the room, however, is incredibly lifelike, and she quickly has Deviant feeling things he’d never dreamed—right until the moment he finds out she’s human. Sort of…Venice needs Deviant’s help to get off the space station. Deviant is lonely, and in need of someone to teach him how to pleasure a female. They strike a bargain, one that has Venice giving up her freedom. But soon it’s her heart that’s at greater risk. It’s easy loving Deviant…even when others are determined to make it difficult.",
    "editions": [
        "English"
    ],
    "genres": {
        "adult": 10,
        "aliens": 32,
        "erotica": 20,
        "fantasy": 14,
        "futuristic": 11,
        "paranormal": 25,
        "paranormal romance": 25,
        "romance": 64,
        "science fiction": 68,
        "science fiction romance": 23
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_id": "231_1"
        },
        {
            "status": "available",
            "stock_id": "231_2"
        },
        {
            "status": "available",
            "stock_id": "231_3"
        },
        {
            "status": "on_loan",
            "stock_id": "231_4"
        },
        {
            "status": "available",
            "stock_id": "231_5"
        },
        {
            "status": "on_loan",
            "stock_id": "231_6"
        },
        {
            "status": "on_loan",
            "stock_id": "231_7"
        }
    ],
    "metrics": {
        "rating_votes": 2928,
        "score": 4.03
    },
    "pages": 815,
    "title": "Loving Deviant",
    "url": "https://www.goodreads.com/book/show/31430649-loving-deviant",
    "year_published": 2016
}