{
    "author": "Gordon Korman",
    "base_id": "2310",
    "description": "The word gifted has never been applied to a kid like Donovan Curtis. It's usually more like Don't try this at home. So when the troublemaker pulls a major prank at his middle school, he thinks he's finally gone too far. But thanks to a mix-up by one of the administrators, instead of getting in trouble, Donovan is sent to the Academy of Scholastic Distinction (ASD), a special program for gifted and talented students.It wasn't exactly what Donovan had intended, but there couldn't be a more perfect hideout for someone like him. That is, if he can manage to fool people whose IQs are above genius level. And that becomes harder and harder as the students and teachers of ASD grow to realize that Donovan may not be good at math or science (or just about anything). But after an ongoing experiment with a live human (sister), an unforgettably dramatic middle-school dance, and the most astonishing come-from-behind robot victory ever, Donovan shows that his gifts might be exactly what the ASD students never knew they needed.",
    "editions": [
        "english",
        "spanish"
    ],
    "genres": {
        "academic (school)": 53,
        "childrens": 55,
        "childrens (juvenile)": 42,
        "childrens (middle grade)": 178,
        "contemporary": 37,
        "fiction": 141,
        "humor": 160,
        "realistic fiction": 256,
        "young adult": 158,
        "young adult (teen)": 21
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "2310_1"
        },
        {
            "status": "on_loan",
            "stock_id": "2310_2"
        },
        {
            "status": "available",
            "stock_id": "2310_3"
        },
        {
            "status": "on_loan",
            "stock_id": "2310_4"
        }
    ],
    "metrics": {
        "rating_votes": 19027,
        "score": 4.04
    },
    "pages": 412,
    "title": "Ungifted",
    "url": "https://www.goodreads.com/book/show/13623777-ungifted",
    "year_published": 2012
}