{
    "author": "William Gibson",
    "base_id": "2313",
    "description": "Flynne Fisher lives down a country road, in a rural near-future America where jobs are scarce, unless you count illegal drug manufacture, which she’s trying to avoid. Her brother Burton lives, or tries to, on money from the Veterans Administration, for neurological damage suffered in the Marines’ elite Haptic Recon unit. Flynne earns what she can by assembling product at the local 3D printshop. She made more as a combat scout in an online game, playing for a rich man, but she’s had to let the shooter games go.Wilf Netherton lives in London, seventy-some years later, on the far side of decades of slow-motion apocalypse. Things are pretty good now, for the haves, and there aren’t many have-nots left. Wilf, a high-powered publicist and celebrity-minder, fancies himself a romantic misfit, in a society where reaching into the past is just another hobby. Burton’s been moonlighting online, secretly working security in some game prototype, a virtual world that looks vaguely like London, but a lot weirder. He’s got Flynne taking over shifts, promised her the game’s not a shooter. Still, the crime she witnesses there is plenty bad.Flynne and Wilf are about to meet one another. Her world will be altered utterly, irrevocably, and Wilf’s, for all its decadence and power, will learn that some of these third-world types from the past can be badass.",
    "editions": [
        "english",
        "spanish",
        "french"
    ],
    "genres": {
        "audiobook": 36,
        "fiction": 484,
        "novels": 28,
        "science fiction": 773,
        "science fiction (cyberpunk)": 221,
        "science fiction (dystopia)": 52,
        "science fiction (time travel)": 68,
        "science fiction fantasy": 55,
        "speculative fiction": 37,
        "thriller": 35
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_id": "2313_1"
        },
        {
            "status": "maintenance",
            "stock_id": "2313_2"
        },
        {
            "status": "available",
            "stock_id": "2313_3"
        },
        {
            "status": "on_loan",
            "stock_id": "2313_4"
        },
        {
            "status": "on_loan",
            "stock_id": "2313_5"
        },
        {
            "status": "available",
            "stock_id": "2313_6"
        },
        {
            "status": "on_loan",
            "stock_id": "2313_7"
        }
    ],
    "metrics": {
        "rating_votes": 20053,
        "score": 3.94
    },
    "pages": 1060,
    "title": "The Peripheral",
    "url": "https://www.goodreads.com/book/show/24611819-the-peripheral",
    "year_published": 2014
}