{
    "author": "Charles Yu",
    "base_id": "2343",
    "description": "A story of a son searching for his father . . . through quantum space–time.  Minor Universe 31 is a vast story-space on the outskirts of fiction, where paradox fluctuates like the stock market, lonely sexbots beckon failed protagonists, and time travel is serious business. Every day, people get into time machines and try to do the one thing they should never do: change the past. That’s where Charles Yu, time travel technician—part counselor, part gadget repair man—steps in. He helps save people from themselves. Literally. When he’s not taking client calls or consoling his boss, Phil, who could really use an upgrade, Yu visits his mother (stuck in a one-hour cycle of time, she makes dinner over and over and over) and searches for his father, who invented time travel and then vanished. Accompanied by TAMMY, an operating system with low self-esteem, and Ed, a nonexistent but ontologically valid dog, Yu sets out, and back, and beyond, in order to find the one day where he and his father can meet in memory. He learns that the key may be found in a book he got from his future self. It’s called How to Live Safely in a Science Fictional Universe, and he’s the author. And somewhere inside it is the information that could help him—in fact it may even save his life.",
    "editions": [
        "english",
        "spanish"
    ],
    "genres": {
        "adult": 31,
        "fantasy": 58,
        "fiction": 540,
        "humor": 93,
        "novels": 41,
        "science fiction": 769,
        "science fiction (time travel)": 251,
        "science fiction fantasy": 93,
        "speculative fiction": 66,
        "unfinished": 24
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_id": "2343_1"
        },
        {
            "status": "on_loan",
            "stock_id": "2343_2"
        },
        {
            "status": "available",
            "stock_id": "2343_3"
        },
        {
            "status": "on_loan",
            "stock_id": "2343_4"
        },
        {
            "status": "available",
            "stock_id": "2343_5"
        },
        {
            "status": "maintenance",
            "stock_id": "2343_6"
        }
    ],
    "metrics": {
        "rating_votes": 14717,
        "score": 3.44
    },
    "pages": 599,
    "title": "How to Live Safely in a Science Fictional Universe",
    "url": "https://www.goodreads.com/book/show/7726420-how-to-live-safely-in-a-science-fictional-universe",
    "year_published": 2010
}