{
    "author": "Stuart Turton",
    "base_id": "23598",
    "description": "\"Agatha Christie meets Groundhog Day . . . quite unlike anything I’ve ever read, and altogether triumphant.” - A. J. Finn, #1 New York Times-bestselling author of The Woman in the WindowAiden Bishop knows the rules. Evelyn Hardcastle will die every day until he can identify her killer and break the cycle. But every time the day begins again, Aiden wakes up in the body of a different guest at Blackheath Manor. And some of his hosts are more helpful than others. With a locked room mystery that Agatha Christie would envy, Stuart Turton unfurls a breakneck novel of intrigue and suspense.For fans of Claire North, and Kate Atkinson, The 7½ Deaths of Evelyn Hardcastle is a breathlessly addictive mystery that follows one man's race against time to find a killer, with an astonishing time-turning twist that means nothing and no one are quite what they seem.This inventive debut twists together a thriller of such unexpected creativity it will leave readers guessing until the very last page.Recommended in The New York Times, The Guardian, Harper's Bazaar, Buzzfeed, Vulture, BookRiot, and more.",
    "editions": [
        "english"
    ],
    "genres": {
        "adult": 495,
        "audiobook": 575,
        "fantasy": 1139,
        "fiction": 2180,
        "historical (historical fiction)": 465,
        "mystery": 4389,
        "mystery (crime)": 602,
        "science fiction": 313,
        "thriller": 1246,
        "thriller (mystery thriller)": 916
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "23598_1"
        },
        {
            "status": "available",
            "stock_id": "23598_2"
        },
        {
            "status": "available",
            "stock_id": "23598_3"
        },
        {
            "status": "on_loan",
            "stock_id": "23598_4"
        },
        {
            "status": "on_loan",
            "stock_id": "23598_5"
        }
    ],
    "metrics": {
        "rating_votes": 151082,
        "score": 3.89
    },
    "pages": 1320,
    "title": "The 7½ Deaths of Evelyn Hardcastle",
    "url": "https://www.goodreads.com/book/show/36337550-the-7-deaths-of-evelyn-hardcastle",
    "year_published": 2018
}