{
    "author": "Anna Hackett",
    "base_id": 240,
    "description": "Framed for a crime she didn't commit, a wrongly-imprisoned space captain's only chance at freedom is to abduct a fearsome alien war commander.Sub-Captain Eve Traynor knows a suicide mission when she sees one. With deadly insectoid aliens threatening to invade Earth, the planet’s only chance of survival is to get the attention of the fierce Eon Warriors. But the Eon want nothing to do with Earth, and Eve wants nothing to do with abducting War Commander Davion Thann-Eon off his warship. But when Earth’s Space Corps threaten her sisters, Eve will do anything to keep them safe, even if it means she might not make it back.War Commander Davion Thann-Eon is taking his first vacation in years. Dedicated to keeping the Eon Empire safe, he’s been born and bred to protect. But when he’s attacked and snatched off his very own warship, he is shocked to find himself face-to-face with a bold, tough little Terran warrior. One who both infuriates and intrigues him.When their shuttle is attacked by the ravenous insectoid Kantos, Eve and Davion crash land on the terrifying hunter planet known as Hunter7. A planet designed to test a warrior to his limits. Now, the pair must work together to survive, caught between the planet and its dangers, the Kantos hunting them down, and their own incendiary attraction.Includes a preview of Galactic Gladiators #1, Gladiator.Eon Warriors Edge of Eon Touch of Eon (coming soon)",
    "editions": [
        "English"
    ],
    "genres": {
        "action": 8,
        "adventure": 6,
        "aliens": 34,
        "fantasy": 9,
        "military fiction": 7,
        "paranormal": 6,
        "romance": 37,
        "science fiction": 42,
        "science fiction romance": 28,
        "space": 8
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_id": "240_1"
        },
        {
            "status": "on_loan",
            "stock_id": "240_2"
        },
        {
            "status": "maintenance",
            "stock_id": "240_3"
        },
        {
            "status": "on_loan",
            "stock_id": "240_4"
        },
        {
            "status": "maintenance",
            "stock_id": "240_5"
        },
        {
            "status": "on_loan",
            "stock_id": "240_6"
        },
        {
            "status": "maintenance",
            "stock_id": "240_7"
        },
        {
            "status": "on_loan",
            "stock_id": "240_8"
        }
    ],
    "metrics": {
        "rating_votes": 2093,
        "score": 4.34
    },
    "pages": 595,
    "title": "Edge of Eon",
    "url": "https://www.goodreads.com/book/show/43190664-edge-of-eon",
    "year_published": 2018
}