{
    "author": "George R.R. Martin",
    "id": "24174",
    "description": "A comet the color of blood and flame cuts across the sky. Two great leaders—Lord Eddard Stark and Robert Baratheon—who hold sway over an age of enforced peace are dead, victims of royal treachery. Now, from the ancient citadel of Dragonstone to the forbidding shores of Winterfell, chaos reigns. Six factions struggle for control of a divided land and the Iron Throne of the Seven Kingdoms, preparing to stake their claims through tempest, turmoil, and war. It is a tale in which brother plots against brother and the dead rise to walk in the night. Here a princess masquerades as an orphan boy; a knight of the mind prepares a poison for a treacherous sorceress; and wild men descend from the Mountains of the Moon to ravage the countryside. Against a backdrop of incest and fratricide, alchemy and murder, victory may go to the men and women possessed of the coldest steel...and the coldest hearts. For when kings clash, the whole land trembles.Here is the second volume in George R.R. Martin magnificent cycle of novels that includes A Game of Thrones and A Storm of Swords. As a whole, this series comprises a genuine masterpiece of modern fantasy, bringing together the best the genre has to offer. Magic, mystery, intrigue, romance, and adventure fill these pages and transport us to a world unlike any we have ever experienced. Already hailed as a classic, George R.R. Martin stunning series is destined to stand as one of the great achievements of imaginative fiction.",
    "editions": [
        "english",
        "spanish"
    ],
    "genres": {
        "adult": 913,
        "adventure": 808,
        "audiobook": 675,
        "epic": 614,
        "fantasy": 32457,
        "fantasy (dragons)": 731,
        "fantasy (epic fantasy)": 1441,
        "fantasy (high fantasy)": 990,
        "fiction": 6814,
        "science fiction fantasy": 1076
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "24174_1"
        },
        {
            "status": "maintenance",
            "stock_id": "24174_2"
        },
        {
            "status": "on_loan",
            "stock_id": "24174_3"
        },
        {
            "status": "on_loan",
            "stock_id": "24174_4"
        },
        {
            "status": "maintenance",
            "stock_id": "24174_5"
        },
        {
            "status": "available",
            "stock_id": "24174_6"
        }
    ],
    "metrics": {
        "rating_votes": 804587,
        "score": 4.41
    },
    "pages": 1010,
    "title": "A Clash of Kings",
    "url": "https://www.goodreads.com/book/show/10572.A_Clash_of_Kings",
    "year_published": 1998
}