{
  "author": "Daniel H. Wilson",
  "id": "242",
  "description": "Video games are a multi-billion dollar a year industry that has outpaced movies and books combined. The humble, pixelated games of the ‘70s and ‘80s have evolved into the vivid, realistic, and immersive form of entertainment that now rivals all other forms of media for dominance in the consumer marketplace. For many, video games have become the cultural icons around which pop culture revolves.PRESS START TO PLAY is an anthology of stories inspired by video games: stories that attempt to recreate the feel of a video game in prose form; stories that play with the concepts common (or exclusive) to video games; and stories about the creation of video games and/or about the video games—or the gamers—themselves.These stories will appeal to anyone who has interacted with games, from hardcore teenaged fanatics, to men and women who game after their children have gone to bed, to your well-meaning aunt who won’t stop inviting you to join her farm-based Facebook games.At the helm of this project are Daniel H. Wilson—bestselling novelist and expert in artificial intelligence—and John Joseph Adams—bestselling, Hugo Award-nominated editor of more than a dozen science fiction/fantasy anthologies and series editor of Best American Science Fiction & Fantasy (volume one forthcoming from Houghton Mifflin in 2015). Together, they have drawn on their wide-ranging contacts to assemble an incredibly talented group of authors who are eager to attack the topic of video games from startling and fascinating angles.Under the direction of an A.I. specialist and a veteran editor, the anthology will expose readers to a strategically chosen mix of stories that explore novel video game concepts in prose narratives, such as save points, kill screens, gold-farming, respawning, first-person shooters, unlocking achievements, and getting “pwned.” Likewise, each of our authors is an accomplished specialist in areas such as science fiction, fantasy, and techno-thrillers, and many have experience writing for video games professionally.Combining unique viewpoints and exacting realism, this anthology promises to thrill generations of readers, from those who grew up with Atari 2600s to the console and PC gamers of today.",
  "editions": [
    "english",
    "spanish"
  ],
  "genres": [
    "anthologies",
    "fantasy",
    "fantasy (urban fantasy)",
    "fiction",
    "games (gaming)",
    "games (video games)",
    "science fiction",
    "science fiction fantasy",
    "short stories",
    "speculative fiction"
  ],
  "inventory": [
    {
      "status": "available",
      "stock_id": "242_1"
    }
  ],
  "metrics": {
    "rating_votes": 1446,
    "score": 3.63
  },
  "pages": 573,
  "title": "Press Start to Play",
  "url": "https://www.goodreads.com/book/show/24044140-press-start-to-play",
  "year_published": 2015
}
