{
    "author": "Vernor Vinge",
    "id": "2450",
    "description": "Alternate Cover Edition can be found here. A Fire upon the Deep is the big, breakout book that fulfills the promise of Vinge's career to date: a gripping tale of galactic war told on a cosmic scale.Thousands of years hence, many races inhabit a universe where a mind's potential is determined by its location in space, from superintelligent entities in the Transcend, to the limited minds of the Unthinking Depths, where only simple creatures and technology can function. Nobody knows what strange force partitioned space into these \"regions of thought,\" but when the warring Straumli realm use an ancient Transcendent artifact as a weapon, they unwittingly unleash an awesome power that destroys thousands of worlds and enslaves all natural and artificial intelligence.Fleeing the threat, a family of scientists, including two children, are taken captive by the Tines, an alien race with a harsh medieval culture, and used as pawns in a ruthless power struggle. A rescue mission, not entirely composed of humans, must rescue the children-and a secret that may save the rest of interstellar civilization.",
    "editions": [
        "english",
        "spanish"
    ],
    "genres": {
        "audiobook": 41,
        "fantasy": 88,
        "fiction": 731,
        "hugo awards": 84,
        "science fiction": 2215,
        "science fiction (aliens)": 65,
        "science fiction fantasy": 123,
        "space": 73,
        "space (space opera)": 351,
        "speculative fiction": 57
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_id": "2450_1"
        },
        {
            "status": "on_loan",
            "stock_id": "2450_2"
        },
        {
            "status": "maintenance",
            "stock_id": "2450_3"
        },
        {
            "status": "on_loan",
            "stock_id": "2450_4"
        },
        {
            "status": "available",
            "stock_id": "2450_5"
        },
        {
            "status": "available",
            "stock_id": "2450_6"
        }
    ],
    "metrics": {
        "rating_votes": 52782,
        "score": 4.13
    },
    "pages": 662,
    "title": "A Fire Upon the Deep",
    "url": "https://www.goodreads.com/book/show/77711.A_Fire_Upon_the_Deep",
    "year_published": 1992
}