{
    "author": "Gregory Maguire",
    "id": "24653",
    "description": "When Dorothy triumphed over the Wicked Witch of the West in L. Frank Baum's classic tale we heard only her side of the story. But what about her arch-nemesis, the mysterious Witch? Where did she come from? How did she become so wicked? And what is the true nature of evil?Gregory Maguire creates a fantasy world so rich and vivid that we will never look at Oz the same way again. Wicked is about a land where animals talk and strive to be treated like first-class citizens, Munchkinlanders seek the comfort of middle-class stability, and the Tin Man becomes a victim of domestic violence. And then there is the little green-skinned girl named Elphaba, who will grow up to become the infamous Wicked Witch of the West, a smart, prickly, and misunderstood creature who challenges all our preconceived notions about the nature of good and evil.An astonishingly rich re-creation of the land of Oz, this book retells the story of Elphaba, the Wicked Witch of the West, who wasn't so wicked after all. Taking readers past the yellow brick road and into a phantasmagoric world rich with imagination and allegory, Gregory Maguire just might change the reputation of one of the most sinister characters in literature.",
    "editions": [
        "english",
        "spanish",
        "french"
    ],
    "genres": {
        "adult": 544,
        "adult fiction": 418,
        "classics": 273,
        "fantasy": 9804,
        "fantasy (fairy tales)": 348,
        "fantasy (magic)": 369,
        "fiction": 5545,
        "paranormal (witches)": 365,
        "retellings": 451,
        "science fiction fantasy": 446
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "24653_1"
        },
        {
            "status": "maintenance",
            "stock_id": "24653_2"
        },
        {
            "status": "available",
            "stock_id": "24653_3"
        },
        {
            "status": "available",
            "stock_id": "24653_4"
        },
        {
            "status": "available",
            "stock_id": "24653_5"
        },
        {
            "status": "maintenance",
            "stock_id": "24653_6"
        },
        {
            "status": "available",
            "stock_id": "24653_7"
        },
        {
            "status": "on_loan",
            "stock_id": "24653_8"
        },
        {
            "status": "available",
            "stock_id": "24653_9"
        }
    ],
    "metrics": {
        "rating_votes": 579514,
        "score": 3.54
    },
    "pages": 882,
    "title": "Wicked: The Life and Times of the Wicked Witch of the West",
    "url": "https://www.goodreads.com/book/show/37442.Wicked",
    "year_published": 1995
}