{
    "author_name": "Amanda Milo",
    "base_id": 247,
    "book_description": "One OCD neat freak alien. One human woman. Both are abducted and held captive in a very unsterile environment. What more could go wrong? ~ Simmi: I’ve broken free and I’ve also freed the human who was held captive with me. But I don’t know where we are, and I don’t know where my home is. The local wildlife may be smaller than I am, and maybe they don't have fangs near as large as mine, but I’m still terrified. My issues with germs--and my uncompromising avoidance of all the things that I’m afraid of coming into contact with--is going to get me killed in this wilderness. Thankfully, Aurora lets me follow her. Thankfully, she seems to know the way out of this endless and inhospitable woodland and desert biome. But by the end of our journey, she’ll suspect she’s harboring a contagion. I have no way to know it, but she’s afraid to tell me. Afraid of how I’ll react once I find out what she’s carrying.***Note: This 40K, Standalone story is intended for readers 18+ due to romantic elements and adult themes. There is no cheating. There is one really germphobic alien. Thankfully, there's also a really understanding woman who is starting to fall for him. Spoiler: They're totally gonna have a Happily Ever After... just as soon as they can get off this planet that’s trying to kill them.",
    "book_title": "Contagion",
    "editions": [
        "English"
    ],
    "genres": {
        "adventure": 5,
        "aliens": 60,
        "fantasy": 6,
        "fiction": 4,
        "humor": 18,
        "male female romance": 4,
        "paranormal": 5,
        "romance": 43,
        "science fiction": 50,
        "science fiction romance": 8
    },
    "inventory": [
        {
            "status": "available",
            "stock_number": "247_1"
        },
        {
            "status": "available",
            "stock_number": "247_2"
        },
        {
            "status": "maintenance",
            "stock_number": "247_3"
        }
    ],
    "metrics": {
        "rating_votes": 1567,
        "score": 4.1
    },
    "original_book_title": "B07Z5BM8NV",
    "pages": 366,
    "url": "https://www.goodreads.com/book/show/48567611-contagion",
    "year_published": 2019
}