{
    "author": "Chen Qiufan",
    "base_id": "250",
    "description": "Mimi is a 'waste girl', a member of the lowest caste on Silicon Isle.Located off China's southeastern coast, Silicon Isle is the global capital for electronic waste recycling, where thousands like Mimi toil day and night, hoping one day they too will enjoy the wealth they’ve created for their employers, the three clans who have ruled the isle for generations.Luo Jincheng is the head of one of these clans, a role passed down from his father and grandfather before him. As the government enforces tighter restrictions, Luo in turn tightens the reins on the waste workers in his employ. Ruthlessness is his means of survival.Scott Brandle has come to Silicon Isle representing TerraGreen Recycling, an American corporation that stands to earn ungodly sums if they can reach a deal to modernize the island’s recycling process.Chen Kaizong, a Chinese American, travels to Silicon Isle as Scott’s interpreter. There, Kaizong is hoping to find his heritage, but finds more questions instead. The home he longs for may not exist.As these forces collide, a dark futuristic virus is unleashed on the island, and war erupts between the rich and the poor; between Chinese tradition and American ambition; between humanity’s past and its future.",
    "editions": [
        "english"
    ],
    "genres": {
        "audiobook": 6,
        "cultural": 7,
        "cultural (china)": 38,
        "fantasy": 7,
        "fiction": 52,
        "science fiction": 150,
        "science fiction (cyberpunk)": 13,
        "science fiction (dystopia)": 22,
        "science fiction fantasy": 8,
        "speculative fiction": 9
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "250_1"
        },
        {
            "status": "on_loan",
            "stock_id": "250_2"
        },
        {
            "status": "maintenance",
            "stock_id": "250_3"
        },
        {
            "status": "on_loan",
            "stock_id": "250_4"
        },
        {
            "status": "available",
            "stock_id": "250_5"
        },
        {
            "status": "on_loan",
            "stock_id": "250_6"
        },
        {
            "status": "maintenance",
            "stock_id": "250_7"
        }
    ],
    "metrics": {
        "rating_votes": 1269,
        "score": 3.35
    },
    "pages": 707,
    "title": "Waste Tide",
    "url": "https://www.goodreads.com/book/show/39863294-waste-tide",
    "year_published": 2013
}