{
    "author": "Jennifer L. Armentrout",
    "base_id": 2512,
    "description": "This is a stand alone novel that is an adult spin-off of the Lux Series You do not need to read a Lux book to read Obsession and vice versa.He’s arrogant, domineering, and... To. Die. For.Hunter is a ruthless killer. And the Department of Defense has him firmly in their grasp, which usually doesn’t chafe too badly because he gets to kill bad guys. Most of the time he enjoys his job. That is, until he’s saddled with something he’s never had to do before: protect a human from his mortal enemy.Serena Cross didn’t believe her best friend when she claimed to have seen the son of a powerful senator turn into something... unnatural. Who would? But then she witnesses her friend’s murder at the hands of what can only be an alien, thrusting her into a world that will kill to protect their secret.Hunter stirs Serena’s temper and her lust despite their differences. Soon he’s doing the unthinkable—breaking the rules he’s lived by, going against the government to keep Serena safe. But are the aliens and the government the biggest threats to Serena’s life… or is it Hunter?",
    "editions": [
        "English"
    ],
    "genres": {
        "Adult": 207,
        "New Adult": 366,
        "Romance": 531,
        "Romance (Paranormal Romance) ": 260,
        "fantasy": 327,
        "fantasy (Paranormal) ": 556,
        "fantasy (Supernatural) ": 75,
        "fantasy (Urban fantasy) ": 60,
        "science fiction": 210,
        "science fiction (Aliens) ": 418
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "2512_1"
        },
        {
            "status": "on_loan",
            "stock_id": "2512_2"
        },
        {
            "status": "available",
            "stock_id": "2512_3"
        },
        {
            "status": "maintenance",
            "stock_id": "2512_4"
        },
        {
            "status": "on_loan",
            "stock_id": "2512_5"
        }
    ],
    "metrics": {
        "rating_votes": 26310,
        "score": 4.1
    },
    "pages": 1182,
    "title": "Obsession",
    "url": "https://www.goodreads.com/book/show/14060046-obsession",
    "year_published": 2013
}