{
    "author": "Shaunta Grimes",
    "base_id": "259",
    "description": "After a virus claimed nearly the entire global population, the world changed. The United States splintered into fifty walled cities where the surviving citizens clustered to start over. The Company, which ended the plague by bringing a life-saving vaccine back from the future, controls everything. They ration the scant food and supplies through a lottery system, mandate daily doses of virus suppressant, and even monitor future timelines to stop crimes before they can be committed.Brilliant but autistic, sixteen-year-old Clover Donovan has always dreamed of studying at the Waverly-Stead Academy. Her brother and caretaker, West, has done everything in his power to make her dream a reality. But Clover’s refusal to part with her beloved service dog denies her entry into the school. Instead, she is drafted into the Time Mariners, a team of Company operatives who travel through time to gather news about the future.When one of Clover’s missions reveals that West’s life is in danger, the Donovans are shattered. To change West’s fate, they’ll have to take on the mysterious Company. But as its secrets are revealed, they realize that the Company’s rule may not be as benevolent as it seems. In saving her brother, Clover will face a more powerful force than she ever imagined\u0085 and will team up with a band of fellow misfits and outsiders to incite a revolution that will change their destinies forever.",
    "editions": [
        "english",
        "spanish",
        "french"
    ],
    "genres": {
        "adventure": 8,
        "apocalyptic (post apocalyptic)": 18,
        "disability": 7,
        "fiction": 23,
        "science fiction": 64,
        "science fiction (apocalyptic)": 11,
        "science fiction (dystopia)": 91,
        "science fiction (time travel)": 36,
        "young adult": 100,
        "young adult (teen)": 6
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_id": "259_1"
        },
        {
            "status": "available",
            "stock_id": "259_2"
        },
        {
            "status": "available",
            "stock_id": "259_3"
        },
        {
            "status": "available",
            "stock_id": "259_4"
        },
        {
            "status": "on_loan",
            "stock_id": "259_5"
        }
    ],
    "metrics": {
        "rating_votes": 964,
        "score": 3.71
    },
    "pages": 312,
    "title": "Viral Nation",
    "url": "https://www.goodreads.com/book/show/15985355-viral-nation",
    "year_published": 2013
}