{
    "author": "Belinda McBride",
    "base_id": 260,
    "description": "\"As a general rule, you won't find the love of your life while you're on your knees under a table.\"-- Helios DayspringPasha is a slave, whoring for travelers at the most dangerous bar on Warlan. He has no memory, no future of his own, yet deep inside Pasha knows that that he is meant for better things. The day that Pasha spots the dangerous pirate in the bar, he knows that he mustn't let the stranger slip away, regardless of what he must do to attract his attention.Captain Griffin Hawke spent the greater part of a decade searching for his lost king, only to find Helios Dayspring crouched between his knees, swathed in the robes and shackles of a whore. Though he is appalled by the downfall of his king, the hardened officer finds himself falling for the allure of the sensual creature who has taken his place. Returning Helios to his position on the throne is the only right thing to do, yet Griffin knows that in doing so, he risks losing his lover forever.\"A whore is a whore is a whore, unless he's something else completely. I guess I must be an uncommon whore.\"-- Helios Dayspring",
    "editions": [
        "English"
    ],
    "genres": {
        "aliens": 17,
        "bdsm": 38,
        "erotica": 40,
        "fantasy": 78,
        "gay": 21,
        "lgbt": 21,
        "male male romance": 242,
        "military fiction": 19,
        "romance": 73,
        "science fiction": 150
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_id": "260_1"
        },
        {
            "status": "on_loan",
            "stock_id": "260_2"
        },
        {
            "status": "on_loan",
            "stock_id": "260_3"
        }
    ],
    "metrics": {
        "rating_votes": 2090,
        "score": 3.62
    },
    "pages": 1239,
    "title": "An Uncommon Whore",
    "url": "https://www.goodreads.com/book/show/7644545-an-uncommon-whore",
    "year_published": 2010
}