{
  "author": "James S.A. Corey",
  "id": "2664",
  "description": "\nThe sixth book in the New York Times bestselling Expanse series. \n\n\n\nNOW A MAJOR TV SERIES\nA revolution brewing for generations has begun in fire. It will end in blood.The Free Navy - a violent group of Belters in black-market military ships - has crippled the Earth and begun a campaign of piracy and violence among the outer planets. The colony ships heading for the thousand new worlds on the far side of the alien ring gates are easy prey, and no single navy remains strong enough to protect them.James Holden and his crew know the strengths and weaknesses of this new force better than anyone. Outnumbered and outgunned, the embattled remnants of the old political powers call on the Rocinante for a desperate mission to reach Medina Station at the heart of the gate network. But the new alliances are as flawed as the old, and the struggle for power has only just begun. As the chaos grows, an alien mystery deepens. Pirate fleets, mutiny and betrayal may be the least of the Rocinante's problems. And in the uncanny spaces past the ring gates, the choices of a few damaged and desperate people may determine the fate of more than just humanity.",
  "editions": [
    "english",
    "spanish"
  ],
  "genres": [
    "audiobook",
    "fantasy",
    "fiction",
    "novels",
    "science fiction",
    "science fiction fantasy",
    "space",
    "space (space opera)",
    "speculative fiction",
    "war"
  ],
  "inventory": [
    {
      "status": "available",
      "stock_id": "2664_1"
    },
    {
      "status": "on_loan",
      "stock_id": "2664_2"
    },
    {
      "status": "available",
      "stock_id": "2664_3"
    },
    {
      "status": "available",
      "stock_id": "2664_4"
    },
    {
      "status": "available",
      "stock_id": "2664_5"
    }
  ],
  "metrics": {
    "rating_votes": 48341,
    "score": 4.22
  },
  "pages": 772,
  "title": "Babylon's Ashes",
  "url": "https://www.goodreads.com/book/show/25877663-babylon-s-ashes",
  "year_published": 2016
}
