{
    "author": "Lyn Gala",
    "base_id": 270,
    "description": "Ondry and Liam have settled into a good life, but their trading is still tied up with humans, and humans are always messy. When political changes at the human base lead Ondry to attempt a difficult trade, the pair find themselves entangled in human affairs. Liam wants to help the people he left and the worlds being torn apart. He also wants to serve Ondry with not only the pleasures of the nest but also by bringing human profits.Ondry has no hope of understanding human psychology in general, he only knows that he will hold onto his palteia with the last breath in his body, and he'd like to keep his status and his wealth too. Unfortunately, new humans bring new conflicts and he is not sure how to protect Liam. He does know one thing that humans seem to constantly forget—that the peaceful Rownt are predators and when their families are threatened, Rownt become deadly killers. Liam is his family, and Ondry will protect him with his last breath… assuming that he can recognize the dangers in time to do so.",
    "editions": [
        "English"
    ],
    "genres": {
        "aliens": 80,
        "bdsm": 81,
        "erotica": 16,
        "fantasy": 31,
        "fiction": 14,
        "gay": 12,
        "lgbt": 18,
        "male male romance": 165,
        "romance": 75,
        "science fiction": 154
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "270_1"
        },
        {
            "status": "maintenance",
            "stock_id": "270_2"
        },
        {
            "status": "available",
            "stock_id": "270_3"
        },
        {
            "status": "maintenance",
            "stock_id": "270_4"
        },
        {
            "status": "maintenance",
            "stock_id": "270_5"
        },
        {
            "status": "maintenance",
            "stock_id": "270_6"
        },
        {
            "status": "available",
            "stock_id": "270_7"
        },
        {
            "status": "on_loan",
            "stock_id": "270_8"
        },
        {
            "status": "maintenance",
            "stock_id": "270_9"
        }
    ],
    "metrics": {
        "rating_votes": 1751,
        "score": 4.28
    },
    "pages": 574,
    "title": "Assimilation, Love, and Other Human Oddities",
    "url": "https://www.goodreads.com/book/show/23110213-assimilation-love-and-other-human-oddities",
    "year_published": 2014
}