{
    "author": "Amie Kaufman",
    "base_id": 2752,
    "description": "The second installment in the epic Starbound trilogy introduces a new pair of star-crossed lovers on two sides of a bloody war.Jubilee Chase and Flynn Cormac should never have met.Lee is captain of the forces sent to Avon to crush the terraformed planet's rebellious colonists, but she has her own reasons for hating the insurgents.Rebellion is in Flynn's blood. Terraforming corporations make their fortune by recruiting colonists to make the inhospitable planets livable, with the promise of a better life for their children. But they never fulfilled their promise on Avon, and decades later, Flynn is leading the rebellion.Desperate for any advantage in a bloody and unrelentingly war, Flynn does the only thing that makes sense when he and Lee cross paths: he returns to base with her as prisoner. But as his fellow rebels prepare to execute this tough-talking girl with nerves of steel, Flynn makes another choice that will change him forever. He and Lee escape the rebel base together, caught between two sides of a senseless war.",
    "editions": [
        "English"
    ],
    "genres": {
        "adventure": 50,
        "aliens": 92,
        "audiobook": 83,
        "dystopia": 157,
        "fantasy": 336,
        "fiction": 99,
        "romance": 494,
        "science fiction": 844,
        "space": 137,
        "young adult": 746
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_id": "2752_1"
        },
        {
            "status": "available",
            "stock_id": "2752_2"
        },
        {
            "status": "available",
            "stock_id": "2752_3"
        },
        {
            "status": "maintenance",
            "stock_id": "2752_4"
        },
        {
            "status": "maintenance",
            "stock_id": "2752_5"
        }
    ],
    "metrics": {
        "rating_votes": 18466,
        "score": 3.96
    },
    "pages": 509,
    "title": "This Shattered World",
    "url": "https://www.goodreads.com/book/show/13138734-this-shattered-world",
    "year_published": 2014
}