{
    "author": "Jerry Dubs",
    "base_id": "279",
    "description": "\"Imhotep\" is the first book in a four-novel series about the ancient Egyptian architect.  Stumbling in the dark of an unfinished tomb beneath the sands of Saqqara, American tourist Tim Hope unknowingly passes through a time portal that leads to ancient Egypt — a time before the Sphinx, before the great pyramids of Giza, and long before the loss of his beloved Addy.  When he discovers that two other Americans preceded him through the time portal, Tim immerses himself in the ancient world to search for them. As he becomes more comfortable with the simpler, more immediate land, he finds himself irresistibly attracted to the delicate Meryt, a wbt-priestess for the god Re.  Learning that a seven-year famine has led to a plot to overthrow King Djoser, Tim discovers that his fate, the lives of the two Americans and the future of Egypt rest in the hands of the legendary Imhotep, master architect of the Step Pyramid, renowned physician and intimate adviser to King Djoser. Downloaded by more than 100,000 readers, “Imhotep\" is the first book in an acclaimed four-book series about the ancient Egyptian architect Imhotep. The second book in the series is \"The Buried Pyramid.\" The third book is \"The Forest of Myrrh.\" The fourth book is \"The Field of Reeds.\"",
    "editions": [
        "english",
        "spanish"
    ],
    "genres": {
        "adventure": 8,
        "business (amazon)": 4,
        "fantasy": 36,
        "fiction": 48,
        "historical": 34,
        "historical (historical fiction)": 59,
        "mystery": 7,
        "northern africa (egypt)": 17,
        "science fiction": 23,
        "science fiction (time travel)": 37
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "279_1"
        },
        {
            "status": "available",
            "stock_id": "279_2"
        },
        {
            "status": "maintenance",
            "stock_id": "279_3"
        }
    ],
    "metrics": {
        "rating_votes": 3170,
        "score": 3.88
    },
    "pages": 306,
    "title": "Imhotep",
    "url": "https://www.goodreads.com/book/show/8946858-imhotep",
    "year_published": 2010
}