{
    "author": "Chuck Wendig",
    "id": "2867",
    "description": "A decadent rock star. A deeply religious radio host. A disgraced scientist. And a teenage girl who may be the world's last hope.Shana wakes up one morning to discover her little sister in the grip of a strange malady. She appears to be sleepwalking. She cannot talk and cannot be woken up. And she is heading with inexorable determination to a destination that only she knows. But Shana and her sister are not alone. Soon they are joined by a flock of sleepwalkers from across America, on the same mysterious journey. And like Shana, there are other “shepherds” who follow the flock to protect their friends and family on the long dark road ahead.For on their journey, they will discover an America convulsed with terror and violence, where this apocalyptic epidemic proves less dangerous than the fear of it. As the rest of society collapses all around them–and an ultraviolent militia threatens to exterminate them–the fate of the sleepwalkers depends on unraveling the mystery behind the epidemic. The terrifying secret will either tear the nation apart–or bring the survivors together to remake a shattered world.",
    "editions": [
        "english",
        "spanish"
    ],
    "genres": {
        "adult": 38,
        "apocalyptic (post apocalyptic)": 118,
        "audiobook": 74,
        "fantasy": 48,
        "fiction": 379,
        "horror": 299,
        "science fiction": 437,
        "science fiction (apocalyptic)": 90,
        "science fiction (dystopia)": 172,
        "thriller": 46
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "2867_1"
        },
        {
            "status": "available",
            "stock_id": "2867_2"
        },
        {
            "status": "maintenance",
            "stock_id": "2867_3"
        },
        {
            "status": "available",
            "stock_id": "2867_4"
        },
        {
            "status": "available",
            "stock_id": "2867_5"
        },
        {
            "status": "available",
            "stock_id": "2867_6"
        },
        {
            "status": "maintenance",
            "stock_id": "2867_7"
        },
        {
            "status": "on_loan",
            "stock_id": "2867_8"
        }
    ],
    "metrics": {
        "rating_votes": 14838,
        "score": 3.98
    },
    "pages": 1259,
    "title": "Wanderers",
    "url": "https://www.goodreads.com/book/show/32603079-wanderers",
    "year_published": 2019
}