{
    "author": "Amy McCulloch",
    "base_id": "288",
    "description": "Lacey Chu has big dreams of becoming a companioneer for MONCHA, the largest tech firm in North America and the company behind the  \"baku\" - a customisable smart pet that functions as a phone but makes the perfect companion too. When Lacey finds out she hasn't been accepted into Profectus - the elite academy for cutting edge tech - it seems her dreams are over. Worst of all, rather than getting to choose one of the advanced bakus, she’s stuck with a rubbish insect one. Then, one night, Lacey comes across the remains of an advanced baku. Once it might’ve been in the shape of a cat but it’s now mangled and broken, no sign of electronic life behind its eyes. Days of work later and the baku opens its eyes. Lacey calls him Jinx – and Jinx opens up a world for her that she never even knew existed, including entry to the hallowed halls of Profecus. Slowly but surely, Jinx becomes more than just a baku to Lacey – he becomes her perfect companion. But what is Jinx, really? His abilities far surpass anything written into his code or built into his motherboard. He seems to be more than just a robotic pet. He seems ... real.",
    "editions": [
        "english",
        "spanish"
    ],
    "genres": {
        "adventure": 8,
        "animals": 6,
        "childrens": 6,
        "childrens (middle grade)": 36,
        "fantasy": 16,
        "fiction": 11,
        "futuristic": 5,
        "science fiction": 50,
        "science fiction (robots)": 4,
        "young adult": 43
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_id": "288_1"
        },
        {
            "status": "maintenance",
            "stock_id": "288_2"
        },
        {
            "status": "on_loan",
            "stock_id": "288_3"
        },
        {
            "status": "on_loan",
            "stock_id": "288_4"
        }
    ],
    "metrics": {
        "rating_votes": 1022,
        "score": 4.17
    },
    "pages": 1131,
    "title": "Jinxed",
    "url": "https://www.goodreads.com/book/show/45007889-jinxed",
    "year_published": 2018
}