{
    "author": "Jaymin Eve",
    "base_id": 289,
    "description": "Avalon has always felt different and alone. The ocean, along with the friends she’s made under the water, is the only constant in her life. She comforts herself with the notion that alone is at least safe. There’s no one to hide her extraordinary abilities from, to hide her dreams of living beneath the crashing waves forever.Then Xander comes for her, reluctantly, judging by his snarly attitude. But, attitude aside, he draws her into a fantasy world, one filled with family and friendship and … the home she’s always craved.He gives her the smallest glimpse of perfection, only to then inform her that it’s not a world she can have. Political issues in Royale will make her time there temporary.Her time in Royale and with Xander.She will stay until the very end, though. If there’s one thing that she’s determined to prevent, it’s Laous getting his hands on the starslight stone. A stone which is keeping two worlds alive and functioning.A happily ever after might not be in the cards for her, but she’s determined to make it happen for her friends.Even if it’s the last thing she does.Don't miss the stunning conclusion to the Secret Keepers series.",
    "editions": [
        "English"
    ],
    "genres": {
        "aliens": 17,
        "fantasy": 31,
        "magic": 9,
        "new adult": 5,
        "paranormal": 26,
        "paranormal romance": 7,
        "romance": 18,
        "supernatural": 4,
        "urban fantasy": 8,
        "young adult": 16
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_id": "289_1"
        },
        {
            "status": "on_loan",
            "stock_id": "289_2"
        },
        {
            "status": "available",
            "stock_id": "289_3"
        },
        {
            "status": "maintenance",
            "stock_id": "289_4"
        },
        {
            "status": "available",
            "stock_id": "289_5"
        }
    ],
    "metrics": {
        "rating_votes": 3357,
        "score": 4.42
    },
    "pages": 310,
    "title": "House of Royale",
    "url": "https://www.goodreads.com/book/show/41573399-house-of-royale",
    "year_published": 2018
}