{
    "author": "Ken Liu",
    "id": "2899",
    "description": "A publishing event: Bestselling author Ken Liu selects his award-winning science fiction and fantasy tales for a groundbreaking collection—including a brand-new piece exclusive to this volume.With his debut novel, The Grace of Kings, taking the literary world by storm, Ken Liu now shares his finest short fiction in The Paper Menagerie. This mesmerizing collection features all of Ken’s award-winning and award-finalist stories, including: “The Man Who Ended History: A Documentary” (Finalist for the Hugo, Nebula, and Theodore Sturgeon Awards), “Mono No Aware” (Hugo Award winner), “The Waves” (Nebula Award finalist), “The Bookmaking Habits of Select Species” (Nebula and Sturgeon award finalists), “All the Flavors” (Nebula award finalist), “The Litigation Master and the Monkey King” (Nebula Award finalist), and the most awarded story in the genre’s history, “The Paper Menagerie” (The only story to win the Hugo, Nebula, and World Fantasy awards).A must-have for every science fiction and fantasy fan, this beautiful book is an anthology to savor.",
    "editions": [
        "english",
        "spanish",
        "french"
    ],
    "genres": {
        "anthologies": 90,
        "audiobook": 56,
        "fantasy": 1065,
        "fiction": 764,
        "historical (historical fiction)": 88,
        "magical realism": 99,
        "science fiction": 669,
        "science fiction fantasy": 68,
        "short stories": 1561,
        "speculative fiction": 62
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_id": "2899_1"
        }
    ],
    "metrics": {
        "rating_votes": 18361,
        "score": 4.38
    },
    "pages": 352,
    "title": "The Paper Menagerie and Other Stories",
    "url": "https://www.goodreads.com/book/show/24885533-the-paper-menagerie-and-other-stories",
    "year_published": 2016
}