{
    "author": "Brandon Sanderson",
    "id": "29370",
    "description": "For a thousand years the ash fell and no flowers bloomed. For a thousand years the Skaa slaved in misery and lived in fear. For a thousand years the Lord Ruler, the \"Sliver of Infinity,\" reigned with absolute power and ultimate terror, divinely invincible. Then, when hope was so long lost that not even its memory remained, a terribly scarred, heart-broken half-Skaa rediscovered it in the depths of the Lord Ruler's most hellish prison. Kelsier \"snapped\" and found in himself the powers of a Mistborn. A brilliant thief and natural leader, he turned his talents to the ultimate caper, with the Lord Ruler himself as the mark.Kelsier recruited the underworld's elite, the smartest and most trustworthy allomancers, each of whom shares one of his many powers, and all of whom relish a high-stakes challenge. Only then does he reveal his ultimate dream, not just the greatest heist in history, but the downfall of the divine despot.But even with the best criminal crew ever assembled, Kel's plan looks more like the ultimate long shot, until luck brings a ragged girl named Vin into his life. Like him, she's a half-Skaa orphan, but she's lived a much harsher life. Vin has learned to expect betrayal from everyone she meets, and gotten it. She will have to learn to trust, if Kel is to help her master powers of which she never dreamed.This saga dares to ask a simple question: What if the hero of prophecy fails?",
    "editions": [
        "english"
    ],
    "genres": {
        "adult": 829,
        "adventure": 465,
        "audiobook": 512,
        "fantasy": 23956,
        "fantasy (epic fantasy)": 1167,
        "fantasy (high fantasy)": 1188,
        "fantasy (magic)": 825,
        "fiction": 2603,
        "science fiction fantasy": 589,
        "young adult": 539
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_id": "29370_1"
        },
        {
            "status": "available",
            "stock_id": "29370_2"
        },
        {
            "status": "maintenance",
            "stock_id": "29370_3"
        }
    ],
    "metrics": {
        "rating_votes": 423269,
        "score": 4.44
    },
    "pages": 277,
    "title": "The Final Empire",
    "url": "https://www.goodreads.com/book/show/68428.The_Final_Empire",
    "year_published": 2006
}