{
  "author": "China Miéville",
  "id": "2959",
  "description": "With this outrageous new novel, China Miéville has written one of the strangest, funniest, and flat-out scariest books you will read this—or any other—year. The London that comes to life in Kraken is a weird metropolis awash in secret currents of myth and magic, where criminals, police, cultists, and wizards are locked in a war to bring about—or prevent—the End of All Things.In the Darwin Centre at London’s Natural History Museum, Billy Harrow, a cephalopod specialist, is conducting a tour whose climax is meant to be the Centre’s prize specimen of a rare Architeuthis dux—better known as the Giant Squid. But Billy’s tour takes an unexpected turn when the squid suddenly and impossibly vanishes into thin air.As Billy soon discovers, this is the precipitating act in a struggle to the death between mysterious but powerful forces in a London whose existence he has been blissfully ignorant of until now, a city whose denizens—human and otherwise—are adept in magic and murder.There is the Congregation of God Kraken, a sect of squid worshippers whose roots go back to the dawn of humanity—and beyond. There is the criminal mastermind known as the Tattoo, a merciless maniac inked onto the flesh of a hapless victim. There is the FSRC—the Fundamentalist and Sect-Related Crime Unit—a branch of London’s finest that fights sorcery with sorcery. There is Wati, a spirit from ancient Egypt who leads a ragtag union of magical familiars. There are the Londonmancers, who read the future in the city’s entrails. There is Grisamentum, London’s greatest wizard, whose shadow lingers long after his death. And then there is Goss and Subby, an ageless old man and a cretinous boy who, together, constitute a terrifying—yet darkly charismatic—demonic duo.All of them—and others—are in pursuit of Billy, who inadvertently holds the key to the missing squid, an embryonic god whose powers, properly harnessed, can destroy all that is, was, and ever shall be.",
  "editions": [
    "english",
    "spanish",
    "french"
  ],
  "genres": [
    "fantasy",
    "fantasy (urban fantasy)",
    "fantasy (weird fiction)",
    "fiction",
    "horror",
    "mystery",
    "science fiction",
    "science fiction fantasy",
    "speculative fiction",
    "weird fiction (new weird)"
  ],
  "inventory": [
    {
      "status": "on_loan",
      "stock_id": "2959_1"
    },
    {
      "status": "available",
      "stock_id": "2959_2"
    },
    {
      "status": "maintenance",
      "stock_id": "2959_3"
    },
    {
      "status": "available",
      "stock_id": "2959_4"
    }
  ],
  "metrics": {
    "rating_votes": 23678,
    "score": 3.6
  },
  "pages": 840,
  "title": "Kraken",
  "url": "https://www.goodreads.com/book/show/6931246-kraken",
  "year_published": 2010
}
