{
    "author": "Marco Iansiti",
    "id": "30",
    "description": "\n\"AI is the 'runtime' that is going to shape all of what we do.\" -- Satya Nadella, CEO, Microsoft\nAI-centric organizations exhibit a new operating architecture, redefining how they create, capture, share, and deliver value.Marco Iansiti and Karim R. Lakhani show how reinventing the firm around data, analytics, and AI removes traditional constraints on scale, scope, and learning that have restricted business growth for hundreds of years. From Airbnb to Ant Financial, Microsoft to Amazon, research shows how AI-driven processes are vastly more scalable than traditional processes, allow massive scope increase, enabling companies to straddle industry boundaries, and create powerful opportunities for learning--to drive ever more accurate, complex, and sophisticated predictions.When traditional operating constraints are removed, strategy becomes a whole new game, one whose rules and likely outcomes this book will make clear. Iansiti and Lakhani: \n   Present a framework for rethinking business and operating models \n   Explain how \"collisions\" between AI-driven/digital and traditional/analog firms are reshaping competition, altering the structure of our economy, and forcing traditional companies to rearchitect their operating models \n   Explain the opportunities and risks created by digital firms \n   Describe the new challenges and responsibilities for the leaders of both digital and traditional firms \n Packed with examples--including many from the most powerful and innovative global, AI-driven competitors--and based on research in hundreds of firms across many sectors, this is your essential guide for rethinking how your firm competes and operates in the era of AI.",
    "editions": [
        "english"
    ],
    "genres": {
        "artificial intelligence": 19,
        "business": 22,
        "business (management)": 4,
        "futurism": 3,
        "nonfiction": 4,
        "science (technology)": 17
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_id": "30_1"
        },
        {
            "status": "maintenance",
            "stock_id": "30_2"
        },
        {
            "status": "maintenance",
            "stock_id": "30_3"
        },
        {
            "status": "available",
            "stock_id": "30_4"
        },
        {
            "status": "available",
            "stock_id": "30_5"
        },
        {
            "status": "on_loan",
            "stock_id": "30_6"
        },
        {
            "status": "on_loan",
            "stock_id": "30_7"
        }
    ],
    "metrics": {
        "rating_votes": 311,
        "score": 4.09
    },
    "pages": 342,
    "title": "Competing in the Age of AI: Strategy and Leadership When Algorithms and Networks Run the World",
    "url": "https://www.goodreads.com/book/show/43907405-competing-in-the-age-of-ai",
    "year_published": 2020
}