{
    "author_name": "Tiffany Roberts",
    "base_id": 305,
    "book_description": "\n\n\nHis Treasure And His Obsession...\n\n\nDespite her longing for the sea, Macy has clung to the safety of land for half her life, devoting herself to her daily routine - until she agrees to go sailing with a childhood friend. Her fears come to fruition when a sudden storm capsizes their boat, rekindling her old terror. She awakens to a rescuer who is anything but human - and he refuses to let her go. Treated like a curiosity and a possession, she's desperate to go home. Yet Macy is undeniably drawn to this strange creature. Can she give up her old life, her family and friends, to embrace this adventure… and Jax?\n\n\nHer Saviour And Her Captor...\n\n\nJax the Wanderer is a hunter, an explorer, and an oddity among his kind. While other kraken are content near their dens, Jax is driven by a deep need to journey far and wide, discovering the unknown corners of the sea. Macy challenges everything he's known; she is the most alluring creature he's ever seen on his travels. He must possess her, though he knows it can only end in disaster. How much is he willing to forsake for the female he desires?\n",
    "book_title": "Treasure Of The Abyss",
    "editions": [
        "English"
    ],
    "genres": {
        "aliens": 42,
        "erotica": 7,
        "fantasy": 40,
        "fantasy romance": 6,
        "fiction": 8,
        "paranormal": 26,
        "paranormal romance": 30,
        "romance": 73,
        "science fiction": 46,
        "science fiction romance": 25
    },
    "inventory": [
        {
            "status": "available",
            "stock_number": "305_1"
        },
        {
            "status": "maintenance",
            "stock_number": "305_2"
        },
        {
            "status": "on_loan",
            "stock_number": "305_3"
        },
        {
            "status": "available",
            "stock_number": "305_4"
        }
    ],
    "metrics": {
        "rating_votes": 2406,
        "score": 3.97
    },
    "original_book_title": "Treasure Of The Abyss (The Kraken, #1)",
    "pages": 910,
    "url": "https://www.goodreads.com/book/show/37685787-treasure-of-the-abyss",
    "year_published": 2017
}