{
    "author": "Ruby Lionsdrake",
    "base_id": 306,
    "description": "Skulking around in the ruins on a planet swarming with treasure hunters, slavers, and bounty hunters isn’t good for one’s health. But Ankari Markovich needs a few archaeological samples for her latest business venture, a venture that might prove lucrative enough to move her family off the impoverished planet where she grew up. Unfortunately, she has no sooner collected her samples than she’s captured by a band of brawny mercenaries. The captain might be handsome, but he’s intent on turning her over to some finance lord who has, for reasons unknown, put a bounty on her head, a ridiculously large one at that. If she can’t figure out a way to escape before she’s delivered to the lord’s home world, she could be forced into a life of indentured servitude—or worse.Captain Viktor Mandrake doesn’t usually take on piddling bounty hunting gigs, but when his intelligence officer informs him of a criminal on a nearby planet, he decides it wouldn’t hurt to take a shuttle down to collect the woman. But Ankari Markovich is trouble from the start, nearly eluding his elite forces, then fighting and tricking his people left and right. He finds himself admiring her spirit, but according to her warrant, she’s a criminal. The safest thing is to keep her in the brig and ignore her until she can be handed off to the man who wants her.But the situation grows more complicated when other bounty hunters show up, wanting to claim Ankari for themselves. Thanks to this woman, Viktor’s ship is in danger, his crew members are going missing, and he’s fighting enemies he never asked for in a jungle in the middle of a hurricane. He’s either going to strangle Ankari… or fall in love. Either scenario could get him killed.Mercenary Instinct is a full-length, stand-alone novel of 90,000 words. It is part of the “Mandrake Company” series of science fiction romance stories and is recommended for readers who enjoy space-based adventure (such as Firefly) and steamy love stories (in the style of Linnea Sinclair).",
    "editions": [
        "English"
    ],
    "genres": {
        "adult": 14,
        "aliens": 25,
        "fantasy": 20,
        "fiction": 16,
        "futuristic": 12,
        "paranormal": 14,
        "romance": 167,
        "science fiction": 131,
        "science fiction romance": 35,
        "space opera": 16
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_id": "306_1"
        },
        {
            "status": "on_loan",
            "stock_id": "306_2"
        },
        {
            "status": "maintenance",
            "stock_id": "306_3"
        }
    ],
    "metrics": {
        "rating_votes": 2766,
        "score": 3.75
    },
    "pages": 1165,
    "title": "Mercenary Instinct",
    "url": "https://www.goodreads.com/book/show/23353578-mercenary-instinct",
    "year_published": 2014
}