{
    "author": "Timothy Zahn",
    "id": "3093",
    "description": "Alternate Cover Edition can be found here.It is a time of renewal, five years after the destruction of the Death Star and the defeat of Darth Vader and the Empire.But with the war seemingly won, strains are beginning to show in the Rebel Alliance. New challenges to galactic peace have arisen. And Luke Skywalker hears a voice from his past. A voice with a warning. Beware the dark side….The Rebel Alliance has destroyed the Death Star, defeated Darth Vader and the Emperor, and driven the remnants of the old Imperial Starfleet back into barely a quarter of the territory that they once controlled. Leia and Han are married, are expecting Jedi twins, and have shouldered heavy burdens in the government of the new Republic. And Luke Skywalker is the first in a hoped-for new line of Jedi Knights.But thousands of light years away, where a few skirmishes are still taking place, the last of the Emperor's warlords has taken command of the remains of the Imperial fleet. He has made two vital discoveries that could destroy the fragile new Republic—built with such cost to the Rebel Alliance. The tale that emerges is a towering epic of action, invention, mystery, and spectacle on a galactic scale—in short, a story that is worthy of the name Star Wars.",
    "editions": [
        "english",
        "spanish",
        "french"
    ],
    "genres": {
        "adventure": 94,
        "audiobook": 110,
        "fantasy": 436,
        "fiction": 798,
        "media tie in (star wars)": 3652,
        "novels": 62,
        "science fiction": 1920,
        "science fiction fantasy": 145,
        "space": 57,
        "space (space opera)": 194
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "3093_1"
        },
        {
            "status": "available",
            "stock_id": "3093_2"
        },
        {
            "status": "on_loan",
            "stock_id": "3093_3"
        },
        {
            "status": "maintenance",
            "stock_id": "3093_4"
        },
        {
            "status": "available",
            "stock_id": "3093_5"
        },
        {
            "status": "available",
            "stock_id": "3093_6"
        }
    ],
    "metrics": {
        "rating_votes": 72503,
        "score": 4.14
    },
    "pages": 439,
    "title": "Heir to the Empire",
    "url": "https://www.goodreads.com/book/show/40604754-heir-to-the-empire",
    "year_published": 1991
}