{
    "author_name": "Anna Hackett",
    "base_id": 310,
    "book_description": "Fighting for love, honor, and freedom on the galaxy’s lawless outer rim…When Earth space marine Harper Adams finds herself abducted by alien slavers off a space station, her life turns into a battle for survival. Dumped into an arena on a desert planet on the outer rim, she finds herself face to face with a big, tattooed alien gladiator…the champion of the Kor Magna Arena.A former prince abandoned to the arena as a teen, Raiden Tiago has long ago earned his freedom. Now he rules the arena, but he doesn’t fight for the glory, but instead for his own dark purpose—revenge against the Thraxian aliens who destroyed his planet. Then his existence is rocked by one small, fierce female fighter from an unknown planet called Earth.Harper is determined to find a way home, but when she spots her best friend in the arena—a slave of the evil Thraxian aliens—she’ll do anything to save her friend…even join forces with the tough, alpha male who sets her body on fire. But as Harper and Raiden step foot onto the blood-soaked sands of the arena, Harper worries that Raiden has his own dangerous agenda… ",
    "book_title": "Gladiator",
    "editions": [
        "English"
    ],
    "genres": {
        "action": 12,
        "adult": 11,
        "aliens": 73,
        "fantasy": 25,
        "futuristic": 12,
        "paranormal": 10,
        "paranormal romance": 17,
        "romance": 108,
        "science fiction": 91,
        "science fiction romance": 37
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_number": "310_1"
        },
        {
            "status": "available",
            "stock_number": "310_2"
        },
        {
            "status": "available",
            "stock_number": "310_3"
        },
        {
            "status": "on_loan",
            "stock_number": "310_4"
        },
        {
            "status": "on_loan",
            "stock_number": "310_5"
        },
        {
            "status": "available",
            "stock_number": "310_6"
        }
    ],
    "metrics": {
        "rating_votes": 3315,
        "score": 4.02
    },
    "original_book_title": "B01M8MG59T",
    "pages": 1168,
    "url": "https://www.goodreads.com/book/show/32738657-gladiator",
    "year_published": 2016
}