{
    "author": "Daniel Suarez",
    "base_id": "3115",
    "description": "A high-tech thriller for the wireless age that explores the unthinkable consequences of a computer program running without human control—a daemon—designed to dismantle society and bring about a new world orderTechnology controls almost everything in our modern-day world, from remote entry on our cars to access to our homes, from the flight controls of our airplanes to the movements of the entire world economy. Thousands of autonomous computer programs, or daemons, make our networked world possible, running constantly in the background of our lives, trafficking e-mail, transferring money, and monitoring power grids. For the most part, daemons are benign, but the same can't always be said for the people who design them. Matthew Sobol was a legendary computer game designer—the architect behind half-a-dozen popular online games. His premature death depressed both gamers and his company's stock price. But Sobol's fans aren't the only ones to note his passing. When his obituary is posted online, a previously dormant daemon activates, initiating a chain of events intended to unravel the fabric of our hyper-efficient, interconnected world. With Sobol's secrets buried along with him, and as new layers of his daemon are unleashed at every turn, it's up to an unlikely alliance to decipher his intricate plans and wrest the world from the grasp of a nameless, faceless enemy—or learn to live in a society in which we are no longer in control. . . . Computer technology expert Daniel Suarez blends haunting high-tech realism with gripping suspense in an authentic, complex thriller in the tradition of Michael Crichton, Neal Stephenson, and William Gibson.",
    "editions": [
        "english",
        "spanish",
        "french"
    ],
    "genres": {
        "audiobook": 87,
        "fantasy": 43,
        "fiction": 714,
        "mystery": 109,
        "mystery (crime)": 48,
        "science (technology)": 87,
        "science fiction": 936,
        "science fiction (cyberpunk)": 188,
        "science fiction fantasy": 46,
        "thriller": 438
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "3115_1"
        },
        {
            "status": "maintenance",
            "stock_id": "3115_2"
        },
        {
            "status": "available",
            "stock_id": "3115_3"
        },
        {
            "status": "on_loan",
            "stock_id": "3115_4"
        },
        {
            "status": "on_loan",
            "stock_id": "3115_5"
        },
        {
            "status": "on_loan",
            "stock_id": "3115_6"
        },
        {
            "status": "on_loan",
            "stock_id": "3115_7"
        },
        {
            "status": "on_loan",
            "stock_id": "3115_8"
        },
        {
            "status": "on_loan",
            "stock_id": "3115_9"
        }
    ],
    "metrics": {
        "rating_votes": 43188,
        "score": 4.15
    },
    "pages": 1338,
    "title": "Daemon",
    "url": "https://www.goodreads.com/book/show/6665847-daemon",
    "year_published": 2006
}