{
  "author": "Ken Follett",
  "id": "31897",
  "description": "Ken Follett is known worldwide as the master of split-second suspense, but his most beloved and bestselling book tells the magnificent tale of a twelfth-century monk driven to do the seemingly impossible: build the greatest Gothic cathedral the world has ever known.Everything readers expect from Follett is here: intrigue, fast-paced action, and passionate romance. But what makes The Pillars of the Earth extraordinary is the time the twelfth century; the place feudal England; and the subject the building of a glorious cathedral. Follett has re-created the crude, flamboyant England of the Middle Ages in every detail. The vast forests, the walled towns, the castles, and the monasteries become a familiar landscape. Against this richly imagined and intricately interwoven backdrop, filled with the ravages of war and the rhythms of daily life, the master storyteller draws the reader irresistibly into the intertwined lives of his characters into their dreams, their labors, and their loves: Tom, the master builder; Aliena, the ravishingly beautiful noblewoman; Philip, the prior of Kingsbridge; Jack, the artist in stone; and Ellen, the woman of the forest who casts a terrifying curse. From humble stonemason to imperious monarch, each character is brought vividly to life.The building of the cathedral, with the almost eerie artistry of the unschooled stonemasons, is the center of the drama. Around the site of the construction, Follett weaves a story of betrayal, revenge, and love, which begins with the public hanging of an innocent man and ends with the humiliation of a king.For the TV tie-in edition with the same ISBN go to this Alternate Cover Edition",
  "editions": [
    "english",
    "spanish"
  ],
  "genres": [
    "adult",
    "audiobook",
    "classics",
    "european literature (british literature)",
    "fantasy",
    "fiction",
    "historical",
    "historical (historical fiction)",
    "historical (medieval)",
    "novels"
  ],
  "inventory": [
    {
      "status": "available",
      "stock_id": "31897_1"
    },
    {
      "status": "on_loan",
      "stock_id": "31897_2"
    },
    {
      "status": "on_loan",
      "stock_id": "31897_3"
    },
    {
      "status": "on_loan",
      "stock_id": "31897_4"
    },
    {
      "status": "available",
      "stock_id": "31897_5"
    }
  ],
  "metrics": {
    "rating_votes": 664188,
    "score": 4.32
  },
  "pages": 1026,
  "title": "The Pillars of the Earth",
  "url": "https://www.goodreads.com/book/show/5043.The_Pillars_of_the_Earth",
  "year_published": 1989
}
