{
    "author": "Amber Kizer",
    "id": "321",
    "description": "“Gripping and poignant, A Matter of Days takes readers on a heart-stopping journey of love and survival.“ — New York Times bestselling author Carrie Jones   Their new reality begins in just a matter of days.    On Day 56 of the Blustar Pandemic, sixteen-year-old Nadia’s mother dies, leaving Nadia to fend for herself and her younger brother, Rabbit. Both have been immunized against the virus, but they can’t be protected from what comes next. Their father taught them to “be the cockroach”—to adapt to and survive whatever comes their way. And that’s their mission.   Facing a lawless world of destruction and deprivation, Nadia and Rabbit drive from Seattle to their grandfather’s compound in West Virginia. The illness, fatigue, and hunger they endure along the way will all be worth it once they reach the compound.    Unless no one is waiting for them . . .   “Fans of Rick Yancey’s The 5th Wave, S. D. Crockett’s After the Snow, or Cormac McCarthy’s adult novel The Road will find this a satisfying read.” —SLJ   “An exciting apocalyptic road trip.” —Publishers WeeklyFrom the Trade Paperback edition.",
    "editions": [
        "english",
        "spanish"
    ],
    "genres": {
        "adventure": 13,
        "adventure (survival)": 29,
        "apocalyptic (post apocalyptic)": 47,
        "audiobook": 14,
        "fiction": 27,
        "science fiction": 35,
        "science fiction (apocalyptic)": 16,
        "science fiction (dystopia)": 75,
        "young adult": 107,
        "young adult (teen)": 15
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_id": "321_1"
        },
        {
            "status": "on_loan",
            "stock_id": "321_2"
        }
    ],
    "metrics": {
        "rating_votes": 2194,
        "score": 3.85
    },
    "pages": 939,
    "title": "A Matter of Days",
    "url": "https://www.goodreads.com/book/show/15927598-a-matter-of-days",
    "year_published": 2013
}