{
    "author_name": "Ilona Andrews",
    "base_id": 3211,
    "book_description": "On the outside, Dina Demille is the epitome of normal. She runs a quaint Victorian Bed and Breakfast in a small Texas town, owns a Shih Tzu named Beast, and is a perfect neighbor, whose biggest problem should be what to serve her guests for breakfast. But Dina is...different: Her broom is a deadly weapon; her Inn is magic and thinks for itself. Meant to be a lodging for otherworldly visitors, the only permanent guest is a retired Galactic aristocrat who can’t leave the grounds because she’s responsible for the deaths of millions and someone might shoot her on sight. Under the circumstances, \"normal\" is a bit of a stretch for Dina.And now, something with wicked claws and deepwater teeth has begun to hunt at night....Feeling responsible for her neighbors, Dina decides to get involved. Before long, she has to juggle dealing with the annoyingly attractive, ex-military, new neighbor, Sean Evans—an alpha-strain werewolf—and the equally arresting cosmic vampire soldier, Arland, while trying to keep her inn and its guests safe. But the enemy she’s facing is unlike anything she’s ever encountered. It’s smart, vicious, and lethal, and putting herself between this creature and her neighbors might just cost her everything.",
    "book_title": "Clean Sweep",
    "editions": [
        "English"
    ],
    "genres": {
        "aliens": 188,
        "fantasy": 1728,
        "magic": 525,
        "paranormal": 823,
        "paranormal romance": 225,
        "romance": 450,
        "science fiction": 405,
        "urban fantasy": 1733,
        "vampires": 579,
        "werewolves": 234
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_number": "3211_1"
        },
        {
            "status": "maintenance",
            "stock_number": "3211_2"
        },
        {
            "status": "on_loan",
            "stock_number": "3211_3"
        },
        {
            "status": "maintenance",
            "stock_number": "3211_4"
        },
        {
            "status": "available",
            "stock_number": "3211_5"
        }
    ],
    "metrics": {
        "rating_votes": 41448,
        "score": 4.14
    },
    "original_book_title": "Clean Sweep",
    "pages": 936,
    "url": "https://www.goodreads.com/book/show/19090384-clean-sweep",
    "year_published": 2013
}