{
    "author": "Neal Stephenson",
    "id": "3269",
    "description": "From bestselling author Neal Stephenson and critically acclaimed historical and contemporary commercial novelist Nicole Galland comes a captivating and complex near-future thriller combining history, science, magic, mystery, intrigue, and adventure that questions the very foundations of the modern world.When Melisande Stokes, an expert in linguistics and languages, accidently meets military intelligence operator Tristan Lyons in a hallway at Harvard University, it is the beginning of a chain of events that will alter their lives and human history itself. The young man from a shadowy government entity approaches Mel, a low-level faculty member, with an incredible offer. The only condition: she must sign a nondisclosure agreement in return for the rather large sum of money.Tristan needs Mel to translate some very old documents, which, if authentic, are earth-shattering. They prove that magic actually existed and was practiced for centuries. But the arrival of the scientific revolution and the Age of Enlightenment weakened its power and endangered its practitioners. Magic stopped working altogether in 1851, at the time of the Great Exhibition at London’s Crystal Palace—the world’s fair celebrating the rise of industrial technology and commerce. Something about the modern world \"jams\" the \"frequencies\" used by magic, and it’s up to Tristan to find out why.And so the Department of Diachronic Operations—D.O.D.O. —gets cracking on its real mission: to develop a device that can bring magic back, and send Diachronic Operatives back in time to keep it alive . . . and meddle with a little history at the same time. But while Tristan and his expanding operation master the science and build the technology, they overlook the mercurial—and treacherous—nature of the human heart.Written with the genius, complexity, and innovation that characterize all of Neal Stephenson’s work and steeped with the down-to-earth warmth and humor of Nicole Galland’s storytelling style, this exciting and vividly realized work of science fiction will make you believe in the impossible, and take you to places—and times—beyond imagining.",
    "editions": [
        "english"
    ],
    "genres": {
        "audiobook": 139,
        "fantasy": 681,
        "fantasy (magic)": 73,
        "fiction": 509,
        "historical": 54,
        "historical (historical fiction)": 153,
        "science fiction": 735,
        "science fiction (time travel)": 318,
        "science fiction fantasy": 56,
        "speculative fiction": 43
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "3269_1"
        },
        {
            "status": "on_loan",
            "stock_id": "3269_2"
        }
    ],
    "metrics": {
        "rating_votes": 25486,
        "score": 3.87
    },
    "pages": 601,
    "title": "The Rise and Fall of D.O.D.O",
    "url": "https://www.goodreads.com/book/show/32075825-the-rise-and-fall-of-d-o-d-o",
    "year_published": 2017
}