{
  "author": "Basma Abdel Aziz",
  "id": "330",
  "description": "Set against the backdrop of a failed political uprising, The Queue is a chilling debut that evokes Orwellian dystopia, Kafkaesque surrealism, and a very real vision of life after the Arab Spring.In a surreal, but familiar, vision of modern day Egypt, a centralized authority known as ‘the Gate’ has risen to power in the aftermath of the ‘Disgraceful Events,’ a failed popular uprising. Citizens are required to obtain permission from the Gate in order to take care of even the most basic of their daily affairs, yet the Gate never opens, and the queue in front of it grows longer. Citizens from all walks of life mix and wait in the sun: a revolutionary journalist, a sheikh, a poor woman concerned for her daughter’s health, and even the brother of a security officer killed in clashes with protestors. Among them is Yehia, a man who was shot during the Events and is waiting for permission from the Gate to remove a bullet that remains lodged in his pelvis. Yehia’s health steadily declines, yet at every turn, officials refuse to assist him, actively denying the very existence of the bullet. Ultimately it is Tarek, the principled doctor tending to Yehia’s case, who must decide whether to follow protocol as he has always done, or to disobey the law and risk his career to operate on Yehia and save his life. Written with dark, subtle humor, The Queue describes the sinister nature of authoritarianism, and illuminates the way that absolute authority manipulates information, mobilizes others in service to it, and fails to uphold the rights of even those faithful to it.From the Trade Paperback edition.",
  "editions": [
    "english",
    "spanish"
  ],
  "genres": [
    "cultural (africa)",
    "fantasy",
    "fiction",
    "literature",
    "northern africa (egypt)",
    "novels",
    "science fiction",
    "science fiction (dystopia)",
    "science fiction fantasy",
    "speculative fiction"
  ],
  "inventory": [
    {
      "status": "on_loan",
      "stock_id": "330_1"
    },
    {
      "status": "available",
      "stock_id": "330_2"
    },
    {
      "status": "available",
      "stock_id": "330_3"
    },
    {
      "status": "maintenance",
      "stock_id": "330_4"
    },
    {
      "status": "available",
      "stock_id": "330_5"
    }
  ],
  "metrics": {
    "rating_votes": 1687,
    "score": 3.57
  },
  "pages": 1039,
  "title": "The Queue",
  "url": "https://www.goodreads.com/book/show/30186905-the-queue",
  "year_published": 2012
}
