{
    "author": "Chuck Wendig",
    "base_id": "3324",
    "description": "New York Times Bestseller • Journey to Star Wars: The Force Awakens “Star Wars: Aftermath [reveals] what happened after the events of 1983’s Return of the Jedi. It turns out, there’s more than just the Empire for the good guys to worry about.”—The Hollywood ReporterAs the Empire reels from its critical defeats at the Battle of Endor, the Rebel Alliance—now a fledgling New Republic—presses its advantage by hunting down the enemy’s scattered forces before they can regroup and retaliate. But above the remote planet Akiva, an ominous show of the enemy’s strength is unfolding. Out on a lone reconnaissance mission, pilot Wedge Antilles watches Imperial Star Destroyers gather like birds of prey circling for a kill, but he’s taken captive before he can report back to the New Republic leaders. Meanwhile, on the planet’s surface, former rebel fighter Norra Wexley has returned to her native world—war weary, ready to reunite with her estranged son, and eager to build a new life in some distant place. But when Norra intercepts Wedge Antilles’s urgent distress call, she realizes her time as a freedom fighter is not yet over. What she doesn’t know is just how close the enemy is—or how decisive and dangerous her new mission will be. Determined to preserve the Empire’s power, the surviving Imperial elite are converging on Akiva for a top-secret emergency summit—to consolidate their forces and rally for a counterstrike. But they haven’t reckoned on Norra and her newfound allies—her technical-genius son, a Zabrak bounty hunter, and a reprobate Imperial defector—who are prepared to do whatever they must to end the Empire’s oppressive reign once and for all.",
    "editions": [
        "english",
        "spanish",
        "french"
    ],
    "genres": {
        "adventure": 43,
        "audiobook": 96,
        "fantasy": 156,
        "fiction": 359,
        "media tie in": 27,
        "media tie in (star wars)": 2112,
        "novels": 38,
        "science fiction": 699,
        "science fiction fantasy": 53,
        "space (space opera)": 79
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_id": "3324_1"
        },
        {
            "status": "on_loan",
            "stock_id": "3324_2"
        },
        {
            "status": "on_loan",
            "stock_id": "3324_3"
        },
        {
            "status": "available",
            "stock_id": "3324_4"
        },
        {
            "status": "available",
            "stock_id": "3324_5"
        },
        {
            "status": "maintenance",
            "stock_id": "3324_6"
        },
        {
            "status": "on_loan",
            "stock_id": "3324_7"
        },
        {
            "status": "on_loan",
            "stock_id": "3324_8"
        },
        {
            "status": "maintenance",
            "stock_id": "3324_9"
        }
    ],
    "metrics": {
        "rating_votes": 27583,
        "score": 3.26
    },
    "pages": 1131,
    "title": "Aftermath",
    "url": "https://www.goodreads.com/book/show/25131600-aftermath",
    "year_published": 2015
}