{
    "author_name": "Amie Kaufman",
    "base_id": 3356,
    "book_description": "Our heroes are back… kind of. From the bestselling co-authors of the Illuminae Files comes the second book in the epic series about a squad of misfits, losers, and discipline cases who just might be the galaxy’s best hope for survival.First, the bad news: an ancient evil—you know, your standard consume-all-life-in-the-galaxy deal—is about to be unleashed. The good news? Squad 312 is standing by to save the day. They’ve just got to take care of a few small distractions first.Like the clan of gremps who’d like to rearrange their favorite faces.And the cadre of illegit GIA agents with creepy flowers where their eyes used to be, who’ll stop at nothing to get their hands on Auri.Then there’s Kal’s long-lost sister, who’s not exactly happy to see her baby brother, and has a Syldrathi army at her back. With half the known galaxy on their tails, Squad 312 has never felt so wanted.When they learn the Hadfield has been found, it’s time to come out of hiding. Two centuries ago, the colony ship vanished, leaving Auri as its sole survivor. Now, its black box might be what saves them. But time is short, and if Auri can’t learn to master her powers as a Trigger, the squad and all their admirers are going to be deader than the Great Ultrasaur of Abraaxis IV.Shocking revelations, bank heists, mysterious gifts, inappropriately tight bodysuits, and an epic firefight will determine the fate of the Aurora Legion’s most unforgettable heroes—and maybe the rest of the galaxy as well.",
    "book_title": "Aurora Burning",
    "editions": [
        "English"
    ],
    "genres": {
        "adventure": 58,
        "aliens": 44,
        "audiobook": 66,
        "fantasy": 251,
        "fiction": 74,
        "romance": 107,
        "science fiction": 646,
        "space": 72,
        "space opera": 32,
        "young adult": 470
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_number": "3356_1"
        },
        {
            "status": "maintenance",
            "stock_number": "3356_2"
        }
    ],
    "metrics": {
        "rating_votes": 14075,
        "score": 4.36
    },
    "original_book_title": "Aurora Burning",
    "pages": 327,
    "url": "https://www.goodreads.com/book/show/40516960-aurora-burning",
    "year_published": 2020
}