{
    "author": "Paul Cornell",
    "id": "337",
    "description": "Summer in London: a city in turmoil. The vicious murder of a well-known MP is like a match to tinder but Detective Inspector James Quill and his team know that it's not a run-of-the-mill homicide. Still coming to terms with their new-found second sight, they soon discover that what is invisible to others - the killer - is visible to them. Even if they have no idea who it is.Then there are more deaths. The bodies of rich, white men are found in circumstances similar to those that set the streets of London awash with fear during the late 1800s: the Whitechapel murders. Even with their abilities to see the supernatural, accepting that Jack the Ripper is back from the dead is a tough ask for Quill's team. As they try to get to grips with their abilities and a case that's spiralling out of control, Quill realizes that they have to understand more about this shadowy London, a world of underground meetings, bizarre and fantastical auctions, and objects that are 'get out of hell free' cards.But the team's unlikely guide, a bestselling author, can't offer them much insight - and their other option, the Rat King, speaks only in riddles.Relying on old-fashioned police work and improvising with their new skills only lands them in deeper water, and they soon realize that the investigation is going to hell - literally. And if they're not careful, they may be going with it . . .The Severed Streets is the second urban fantasy by bestselling Doctor Who writer, Paul Cornell.",
    "editions": [
        "english",
        "spanish"
    ],
    "genres": {
        "fantasy": 180,
        "fantasy (magic)": 11,
        "fantasy (paranormal)": 18,
        "fantasy (supernatural)": 15,
        "fantasy (urban fantasy)": 172,
        "fiction": 46,
        "horror": 35,
        "mystery": 60,
        "mystery (crime)": 47,
        "science fiction fantasy": 11
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_id": "337_1"
        },
        {
            "status": "maintenance",
            "stock_id": "337_2"
        },
        {
            "status": "maintenance",
            "stock_id": "337_3"
        }
    ],
    "metrics": {
        "rating_votes": 3177,
        "score": 4.01
    },
    "pages": 1004,
    "title": "The Severed Streets",
    "url": "https://www.goodreads.com/book/show/17910066-the-severed-streets",
    "year_published": 2014
}