{
    "author": "Auryn Hadley",
    "base_id": 340,
    "description": "It’s a treacherous road to belonging—and once you find it, you could lose everything.In an exotic world caught in the throes of a seemingly endless war, a nation of terrorists under the thumb of an evil Emperor has set out to systematically destroy every race but their own. And they’re just about to succeed. Lauded fantasy author Auryn Hadley (The Demons’ Muse romantic fantasy series) compellingly blends heart-stopping action-adventure, heart-breaking ethics, and toe-curling sensuality, all through the lens of a Daenerys Targaryen-esque lead—the likes of which the fantasy genre hasn’t yet seen. When you were once a slave, freed only to become a ruthless warrior, \"belonging\" seems a trite concept. A pipe dream, the stuff of naive fairy tales. But not for Salryc Luxx. Private Luxx—Sal for short—is iliri, a member of an untamable race surreptitiously dubbed \"their kind\" by humans and bred thousands of years ago to protect them. Humans consider them expendable, barely more than animals. Freaks. But in a karmic twist of fate, they’re also one of mankind’s most feared predators. Abused and enslaved, the only control Sal has over her life is what military unit she serves with – if she's good enough to be accepted – and the only one to consider her is the best in the land, the Black Blades. Everyone has secrets, and the Blades are no different. But acceptance into the Blades gives Sal something she never expected—the family she’s never had, and with it, the undying protection of seven of the greatest warriors the world has ever seen. It also gifts her a devoted line of potential mates. Many of her fellow warriors will submit to the bloodlust that overtakes her in the heat of battle and can only be quenched by rough, passionate lovemaking (making way for the steamiest of love scenes). Though it’s not all war and sex. Sal very gradually cultivates deeply loving, evolving relationships with each of the Black Blades, which morphs as a unit into a reverse harem as sweet as it is fierce, and as protective as it is impassioned. But belonging has its own price. Each of the Blades would die to protect Sal. And it’s only a matter of time before the enemy moves to use this against her.Author Hadley has crafted a unique epic fantasy—and an absolute roller coaster of emotions.Her heroine, Sal, is as loving as she is ferocious, and the demons she battles—and the way she beats them—underlie a delicate exploration of the ethical and political battles we face in every war we fight. Hadley’s clever takes on racial prejudice are subtle, yet damning—and her idea of sexual politics is a rip-roaring turn-on. Every female reader will want to be Sal… and every male, like the guys in the book, will fall for her. The first book in the Rise of the Iliri series. BloodLust does not end with a cliffhanger. It does contain adult themes, thus may not be suitable for younger readers.",
    "editions": [
        "English"
    ],
    "genres": {
        "aliens": 19,
        "fantasy": 112,
        "fantasy (High fantasy) ": 7,
        "magic": 8,
        "military fiction": 11,
        "paranormal": 33,
        "paranormal romance": 13,
        "polyamorous": 153,
        "romance": 35,
        "science fiction": 30
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "340_1"
        },
        {
            "status": "maintenance",
            "stock_id": "340_2"
        }
    ],
    "metrics": {
        "rating_votes": 2885,
        "score": 4.29
    },
    "pages": 705,
    "title": "BloodLust",
    "url": "https://www.goodreads.com/book/show/52069768-bloodlust",
    "year_published": 2016
}