{
    "author": "Umberto Eco",
    "base_id": "3409",
    "description": "Foucault's Pendulum is divided into ten segments represented by the ten Sefiroth. The novel is full of esoteric references to the Kabbalah. The title of the book refers to an actual pendulum designed by the French physicist Léon Foucault to demonstrate the rotation of the earth, which has symbolic significance within the novel.Bored with their work, and after reading too many manuscripts about occult conspiracy theories, three vanity publisher employees (Belbo, Diotallevi and Casaubon) invent their own conspiracy for fun. They call this satirical intellectual game \"The Plan,\" a hoax that connects the medieval Knights Templar with other occult groups from ancient to modern times. This produces a map indicating the geographical point from which all the powers of the earth can be controlled—a point located in Paris, France, at Foucault’s Pendulum. But in a fateful turn the joke becomes all too real.The three become increasingly obsessed with The Plan, and sometimes forget that it's just a game. Worse still, other conspiracy theorists learn about The Plan, and take it seriously. Belbo finds himself the target of a real secret society that believes he possesses the key to the lost treasure of the Knights Templar.Orchestrating these and other diverse characters into his multilayered semioticadventure, Eco has created a superb cerebral entertainment.",
    "editions": [
        "english",
        "spanish",
        "french"
    ],
    "genres": {
        "classics": 284,
        "cultural (italy)": 159,
        "european literature (italian literature)": 213,
        "fiction": 2382,
        "historical (historical fiction)": 528,
        "literature": 355,
        "mystery": 550,
        "novels": 181,
        "philosophy": 157,
        "thriller": 199
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_id": "3409_1"
        },
        {
            "status": "maintenance",
            "stock_id": "3409_2"
        },
        {
            "status": "on_loan",
            "stock_id": "3409_3"
        },
        {
            "status": "available",
            "stock_id": "3409_4"
        },
        {
            "status": "available",
            "stock_id": "3409_5"
        }
    ],
    "metrics": {
        "rating_votes": 60781,
        "score": 3.9
    },
    "pages": 444,
    "title": "Foucault's Pendulum",
    "url": "https://www.goodreads.com/book/show/17841.Foucault_s_Pendulum",
    "year_published": 1988
}