{
    "author": "Shelly Crane",
    "base_id": 341,
    "description": "Sherry has always known there was something out there. She's eighteen, works for a tabloid newspaper in Chicago and has a brother, Danny who is a lazy mooch. They live a pretty normal dull life with hippie parents and a normal existence. Then the moon dissapears and people start to go missing only to reappear later, but different. Sherry has an abusive ex-boyfriend who shows up and claims to be one of these beings that have been showing up around the world. He's no longer the same person in that body. He tells her he has come to protect her and her brother and takes her underground, against her will to save her, where they meet others like them. She begins to unravel the truth about Merrick, about what he's really doing here, about the way he looks at her, about the crazy dangerous world they live in. Can he convince her that he's here to help? Will she like what she finds when she opens up to the truth? Will he be the one to love her when everyone else has failed her? Will he be able to protect her?",
    "editions": [
        "English"
    ],
    "genres": {
        "aliens": 45,
        "dystopia": 20,
        "fantasy": 63,
        "fiction": 13,
        "paranormal": 123,
        "paranormal romance": 47,
        "romance": 75,
        "science fiction": 31,
        "supernatural": 25,
        "young adult": 76
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_id": "341_1"
        },
        {
            "status": "on_loan",
            "stock_id": "341_2"
        },
        {
            "status": "maintenance",
            "stock_id": "341_3"
        },
        {
            "status": "available",
            "stock_id": "341_4"
        },
        {
            "status": "available",
            "stock_id": "341_5"
        }
    ],
    "metrics": {
        "rating_votes": 5282,
        "score": 3.86
    },
    "pages": 743,
    "title": "Collide",
    "url": "https://www.goodreads.com/book/show/11731782-collide",
    "year_published": 2011
}