{
    "author_name": "Alessandra Hazard",
    "base_id": 344,
    "book_description": "A planet at war. Two alphas forced into a political marriage. Attraction that defies all reason and logic… Or does it? The Kingdom of Pelugia and the Republic of Kadar have been at war for decades. Peace isn’t popular, but the planet can’t survive without it.Forced to marry an enemy prince for the sake of peace, Senator Royce Cleghorn doesn’t like his husband, his alpha scent, or his damned pretty blue eyes. More than anything, Royce hates what Haydn makes him become: a primitive alpha cliché who’ll do anything to mark his territory, even if that territory is his alpha husband. Royce likes omegas; he isn’t into alphas, no matter how pretty their eyes are. It’s just a weird territorial instinct. It has to be.Prince Haydn has always tried to be the perfect alpha his father wants him to be. He's the heir to the throne. He's a war general. He isn't supposed to bare his throat to an enemy alpha—and it isn't supposed to feel so good. Everyone knows a marriage between two alphas is a recipe for disaster. He isn't supposed to crave his husband—their marriage is just a political arrangement, nothing more.But when disaster strikes and loyalties are tested, which bond will be the strongest: their marriage, or their allegiances?This book is set in an omegaverse world similar to contemporary Earth, and it contains explicit content, mating cycles, scenting, knotting, and two men obsessed with each other. While mpreg exists in this world, it’s only mentioned and doesn’t appear on-page.",
    "book_title": "Unnatural",
    "editions": [
        "English"
    ],
    "genres": {
        "aliens": 21,
        "fantasy": 50,
        "lgbt": 18,
        "male male romance": 87,
        "omegaverse": 44,
        "paranormal": 51,
        "paranormal romance": 14,
        "romance": 50,
        "science fiction": 37,
        "shapeshifters": 21
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_number": "344_1"
        },
        {
            "status": "available",
            "stock_number": "344_2"
        },
        {
            "status": "on_loan",
            "stock_number": "344_3"
        }
    ],
    "metrics": {
        "rating_votes": 2349,
        "score": 4.12
    },
    "original_book_title": "B08FX3656C",
    "pages": 820,
    "url": "https://www.goodreads.com/book/show/56443216-unnatural",
    "year_published": 2020
}