{
    "author": "Lee   Kelly",
    "base_id": "346",
    "description": "It has been nearly two decades since the breakout of the Third World War, and Manhattan is now a prisoner-of-war camp ruled by island native Rolladin, who controls the city’s survivors with an iron fist. For Skyler Miller, Manhattan is a cage that keeps her from the world beyond the city’s borders. But for Sky’s younger sister, Phee, the Central Park POW camp is the only home she’d ever want.When strangers arrive in the park, carrying a shocking message, Sky and Phee discover there’s more to Manhattan—and their family—than either of them had imagined. As disturbing secrets about the island begin to surface, Sky and Phee have no choice but to break the rules to uncover the full truth of their long-shrouded history. When their search for answers erupts into violence, the girls must flee into Manhattan’s depths, where their quest for a better future will force them to confront the island’s dark and shocking past.Lee Kelly’s gripping debut novel is a pulse-pounding journey through a city that’s as strange as it is familiar, where nothing is black-and-white and buried secrets can haunt.",
    "editions": [
        "english",
        "spanish",
        "french"
    ],
    "genres": {
        "adventure": 12,
        "apocalyptic (post apocalyptic)": 30,
        "audiobook": 12,
        "fantasy": 14,
        "fiction": 30,
        "science fiction": 50,
        "science fiction (apocalyptic)": 10,
        "science fiction (dystopia)": 106,
        "thriller": 17,
        "young adult": 117
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_id": "346_1"
        },
        {
            "status": "on_loan",
            "stock_id": "346_2"
        }
    ],
    "metrics": {
        "rating_votes": 2028,
        "score": 3.71
    },
    "pages": 277,
    "title": "City of Savages",
    "url": "https://www.goodreads.com/book/show/22556945-city-of-savages",
    "year_published": 2015
}