{
  "author": "P.J. Manney",
  "id": "347",
  "description": "Scientist Peter Bernhardt has dedicated his life to nanotechnology, the science of manipulating matter on the atomic scale. As the founder of Biogineers, he is on the cusp of revolutionizing brain therapies with microscopic nanorobots that will make certain degenerative diseases become a thing of the past. But after his research is stolen by an unknown enemy, seventy thousand people die in Las Vegas in one abominable moment. No one is more horrified than Peter, as this catastrophe sets in motion events that will forever change not only his life but also the course of human evolution.Peter’s company is torn from his grasp as the public clamors for his blood. Desperate, he turns to an old friend, who introduces him to the Phoenix Club, a cabal of the most powerful people in the world. To make himself more valuable to his new colleagues, Peter infuses his brain with experimental technology, exponentially upgrading his mental prowess and transforming him irrevocably.As he’s exposed to unimaginable wealth and influence, Peter’s sense of reality begins to unravel. Do the club members want to help him, or do they just want to claim his technology? What will they do to him once they have their prize? And while he’s already evolved beyond mere humanity, is he advanced enough to take on such formidable enemies and win?",
  "editions": [
    "english",
    "spanish",
    "french"
  ],
  "genres": [
    "audiobook",
    "business (amazon)",
    "fiction",
    "science (technology)",
    "science fiction",
    "science fiction (cyberpunk)",
    "science fiction (dystopia)",
    "science fiction fantasy",
    "thriller",
    "unfinished"
  ],
  "inventory": [
    {
      "status": "on_loan",
      "stock_id": "347_1"
    },
    {
      "status": "available",
      "stock_id": "347_2"
    },
    {
      "status": "available",
      "stock_id": "347_3"
    }
  ],
  "metrics": {
    "rating_votes": 4002,
    "score": 3.55
  },
  "pages": 222,
  "title": "R)evolution",
  "url": "https://www.goodreads.com/book/show/25207141-r-evolution",
  "year_published": 2015
}
