{
    "author": "Kai Meyer",
    "base_id": "349",
    "description": "In Venice, magic is not unusual. Merle is apprenticed to a magic mirror maker, and Serafin -- a boy who was once a master thief -- works for a weaver of magic cloth. Merle and Serafin are used to the mermaids who live in the canals of the city -- beautiful creatures with hideous mouths that split their faces from ear to ear -- and to the guards who patrol the streets on living stone lions. Merle herself possesses something magical: a mirror whose surface is water. She can reach her whole arm into it and never get wet.But Venice is under siege by the Egyptian Empire; its terrifying mummy warriors and flying sunbarks are waiting to strike. All that protects the Venetians is the Flowing Queen. Nobody knows who or what she is -- only that her power flows through the canals and keeps the Egyptians at bay.When Merle and Serafin overhear a plot to capture the Flowing Queen, they are catapulted into desperate danger. They must do everything they can to rescue the Queen and save the city -- even if it means getting help from the Ancient Traitor himself.Kai Meyer's bold, original fantasy conjures up a land of magic and menace as Merle and Serafin begin a journey to unimagined realms in the extraordinary world of Dark Reflections.",
    "editions": [
        "english",
        "spanish"
    ],
    "genres": {
        "adventure": 38,
        "childrens": 25,
        "childrens (middle grade)": 22,
        "european literature (german literature)": 27,
        "fantasy": 432,
        "fantasy (magic)": 29,
        "fiction": 53,
        "mythology (mermaids)": 17,
        "young adult": 131,
        "young adult (young adult fantasy)": 17
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "349_1"
        },
        {
            "status": "on_loan",
            "stock_id": "349_2"
        }
    ],
    "metrics": {
        "rating_votes": 4899,
        "score": 3.86
    },
    "pages": 1297,
    "title": "The Water Mirror",
    "url": "https://www.goodreads.com/book/show/929373.The_Water_Mirror",
    "year_published": 2001
}