{
  "author": "Marie Brennan",
  "id": "3601",
  "description": "You, dear reader, continue at your own risk. It is not for the faint of heart—no more so than the study of dragons itself. But such study offers rewards beyond compare: to stand in a dragon's presence, even for the briefest of moments—even at the risk of one's life—is a delight that, once experienced, can never be forgotten. . . .All the world, from Scirland to the farthest reaches of Eriga, know Isabella, Lady Trent, to be the world's preeminent dragon naturalist. She is the remarkable woman who brought the study of dragons out of the misty shadows of myth and misunderstanding into the clear light of modern science. But before she became the illustrious figure we know today, there was a bookish young woman whose passion for learning, natural history, and, yes, dragons defied the stifling conventions of her day.Here at last, in her own words, is the true story of a pioneering spirit who risked her reputation, her prospects, and her fragile flesh and bone to satisfy her scientific curiosity; of how she sought true love and happiness despite her lamentable eccentricities; and of her thrilling expedition to the perilous mountains of Vystrana, where she made the first of many historic discoveries that would change the world forever.",
  "editions": [
    "english"
  ],
  "genres": [
    "adult",
    "adventure",
    "audiobook",
    "fantasy",
    "fantasy (dragons)",
    "fiction",
    "historical",
    "historical (historical fiction)",
    "science fiction fantasy",
    "young adult"
  ],
  "inventory": [
    {
      "status": "available",
      "stock_id": "3601_1"
    },
    {
      "status": "on_loan",
      "stock_id": "3601_2"
    },
    {
      "status": "on_loan",
      "stock_id": "3601_3"
    },
    {
      "status": "maintenance",
      "stock_id": "3601_4"
    },
    {
      "status": "available",
      "stock_id": "3601_5"
    },
    {
      "status": "on_loan",
      "stock_id": "3601_6"
    },
    {
      "status": "maintenance",
      "stock_id": "3601_7"
    },
    {
      "status": "maintenance",
      "stock_id": "3601_8"
    }
  ],
  "metrics": {
    "rating_votes": 28620,
    "score": 3.81
  },
  "pages": 1086,
  "title": "A Natural History of Dragons",
  "url": "https://www.goodreads.com/book/show/12974372-a-natural-history-of-dragons",
  "year_published": 2013
}
