{
    "author": "John Wyndham",
    "base_id": "3606",
    "description": "In 1951 John Wyndham published his novel The Day of the Triffids to moderate acclaim. Fifty-two years later, this horrifying story is a science fiction classic, touted by The Times (London) as having “all the reality of a vividly realized nightmare.”Bill Masen, bandages over his wounded eyes, misses the most spectacular meteorite shower England has ever seen. Removing his bandages the next morning, he finds masses of sightless people wandering the city. He soon meets Josella, another lucky person who has retained her sight, and together they leave the city, aware that the safe, familiar world they knew a mere twenty-four hours before is gone forever.But to survive in this post-apocalyptic world, one must survive the Triffids, strange plants that years before began appearing all over the world. The Triffids can grow to over seven feet tall, pull their roots from the ground to walk, and kill a man with one quick lash of their poisonous stingers. With society in shambles, they are now poised to prey on humankind. Wyndham chillingly anticipates bio-warfare and mass destruction, fifty years before their realization, in this prescient account of Cold War paranoia.",
    "editions": [
        "english",
        "spanish",
        "french"
    ],
    "genres": {
        "apocalyptic (post apocalyptic)": 361,
        "classics": 944,
        "fantasy": 180,
        "fiction": 1137,
        "horror": 524,
        "novels": 96,
        "science fiction": 2480,
        "science fiction (apocalyptic)": 159,
        "science fiction (dystopia)": 312,
        "science fiction fantasy": 160
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_id": "3606_1"
        },
        {
            "status": "maintenance",
            "stock_id": "3606_2"
        },
        {
            "status": "maintenance",
            "stock_id": "3606_3"
        },
        {
            "status": "available",
            "stock_id": "3606_4"
        },
        {
            "status": "on_loan",
            "stock_id": "3606_5"
        },
        {
            "status": "maintenance",
            "stock_id": "3606_6"
        },
        {
            "status": "maintenance",
            "stock_id": "3606_7"
        },
        {
            "status": "maintenance",
            "stock_id": "3606_8"
        }
    ],
    "metrics": {
        "rating_votes": 91866,
        "score": 4.02
    },
    "pages": 967,
    "title": "The Day of the Triffids",
    "url": "https://www.goodreads.com/book/show/530965.The_Day_of_the_Triffids",
    "year_published": 1951
}