{
    "author": "Honey Phillips",
    "base_id": 362,
    "description": "Can a weary warrior and an abducted mother save each other?Abby Wentworth never regretted abandoning her corporate career to adopt her orphaned niece and run a maternity home. But she certainly never expected to find herself and her girls abducted by aliens who intend to sell them as breeders.When they are rescued by a massive alien and his crew, desires she has long suppressed start to surface. She finds herself unexpectedly drawn to the captain who treats both her and her daughter with unwavering devotion.Until his ship intercepts an illegal Vedeckian trader, Captain Hrebec is resigned to spending his life alone. The Cires lost their females to a plague many years ago. Now for the first time, this luscious human female has him longing for a mate and a family.But Abby has to get her girls back to Earth, and Hrebec may have one last chance to save his race. Will their duties force them apart? Or will they finally find a family of their own?Mama and the Alien Warrior is a standalone science fiction romance. This sweet and steamy HEA is intended for adults only.",
    "editions": [
        "English"
    ],
    "genres": {
        "aliens": 51,
        "fantasy": 12,
        "futuristic": 3,
        "male female romance": 4,
        "paranormal": 9,
        "paranormal romance": 8,
        "romance": 44,
        "science fiction": 40,
        "science fiction romance": 18,
        "space": 5
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "362_1"
        },
        {
            "status": "on_loan",
            "stock_id": "362_2"
        },
        {
            "status": "on_loan",
            "stock_id": "362_3"
        },
        {
            "status": "available",
            "stock_id": "362_4"
        },
        {
            "status": "on_loan",
            "stock_id": "362_5"
        },
        {
            "status": "maintenance",
            "stock_id": "362_6"
        },
        {
            "status": "on_loan",
            "stock_id": "362_7"
        },
        {
            "status": "available",
            "stock_id": "362_8"
        },
        {
            "status": "maintenance",
            "stock_id": "362_9"
        }
    ],
    "metrics": {
        "rating_votes": 3338,
        "score": 4.11
    },
    "pages": 410,
    "title": "Mama and the Alien Warrior",
    "url": "https://www.goodreads.com/book/show/45416836-mama-and-the-alien-warrior",
    "year_published": 2019
}