{
    "author": "Will McIntosh",
    "base_id": 371,
    "description": "Seventeen-year-old David Sullivan’s life is about to change—all because of one tiny, priceless item found in the murky bottom of a Brooklyn water tower.Sully is a sphere dealer at a flea market. It doesn’t pay much—Alex Holliday’s stores have muscled out most of the independent sellers—but it helps him and his mom make rent.No one knows where the brilliant-colored spheres came from. One day they were just there, hidden all over the earth like huge gemstones. Burn a pair and they make you a little better: an inch taller, skilled at math, better-looking. The rarer the sphere, the more expensive—and the greater the improvement.When Sully meets Hunter, a girl with a natural talent for finding spheres, the two start searching together. One day they find a Gold—a color no one has ever seen. And when Alex Holliday learns what they have, he will go to any lengths, will use all of his wealth and power, to take it from them.There’s no question the Gold is worth millions, but what does it actually do? None of them is aware of it yet, but the fate of the world rests on this little golden orb. Because all the world fights over the spheres, but no one knows where they come from, what their powers are, or why they’re here.",
    "editions": [
        "English"
    ],
    "genres": {
        "adventure": 14,
        "aliens": 17,
        "contemporary": 10,
        "dystopia": 18,
        "fantasy": 90,
        "fiction": 32,
        "romance": 15,
        "science fiction": 96,
        "teen": 9,
        "young adult": 134
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_id": "371_1"
        },
        {
            "status": "maintenance",
            "stock_id": "371_2"
        },
        {
            "status": "on_loan",
            "stock_id": "371_3"
        },
        {
            "status": "on_loan",
            "stock_id": "371_4"
        },
        {
            "status": "on_loan",
            "stock_id": "371_5"
        },
        {
            "status": "on_loan",
            "stock_id": "371_6"
        },
        {
            "status": "on_loan",
            "stock_id": "371_7"
        }
    ],
    "metrics": {
        "rating_votes": 1685,
        "score": 3.61
    },
    "pages": 316,
    "title": "Burning Midnight",
    "url": "https://www.goodreads.com/book/show/25489041-burning-midnight",
    "year_published": 2016
}