{
    "author": "Jennifer L. Armentrout",
    "base_id": 374,
    "description": "Now available together for the first time, don't miss Opal and Origin, the third and fourth books in Jennifer L. Armentrout's bestselling Lux series. Also includes bonus content exclusive to the print edition! \"A thrilling ride from start to finish,\" says RT Book Reviews.OpalAfter everything, I’m no longer the same Katy. I’m different…and I’m not sure what that will mean in the end. When each step we take in discovering the truth puts us in the path of the secret organization responsible for torturing and testing hybrids, the more I realize there is no end to what I’m capable of. The death of someone close still lingers, help comes from the most unlikely source, and friends will become the deadliest of enemies, but we won’t turn back. Even if the outcome will shatter our worlds forever.OriginDaemon will do anything to get Katy back. After the successful but disastrous raid on Mount Weather, he’s facing the impossible. Katy is gone. Taken. Everything becomes about finding her. But the most dangerous foe has been there all along, and when the truths are exposed and the lies come crumbling down, which side will Daemon and Katy be standing on? And will they even be together?",
    "editions": [
        "English"
    ],
    "genres": {
        "aliens": 55,
        "fantasy": 55,
        "fiction": 9,
        "paranormal": 60,
        "paranormal romance": 14,
        "romance": 48,
        "science fiction": 41,
        "supernatural": 11,
        "urban fantasy": 9,
        "young adult": 88
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "374_1"
        },
        {
            "status": "on_loan",
            "stock_id": "374_2"
        },
        {
            "status": "available",
            "stock_id": "374_3"
        },
        {
            "status": "available",
            "stock_id": "374_4"
        },
        {
            "status": "maintenance",
            "stock_id": "374_5"
        },
        {
            "status": "available",
            "stock_id": "374_6"
        }
    ],
    "metrics": {
        "rating_votes": 4332,
        "score": 4.64
    },
    "pages": 716,
    "title": "Consequences: Opal & Origin",
    "url": "https://www.goodreads.com/book/show/19081402-consequences",
    "year_published": 2014
}