{
    "author": "Polly Shulman",
    "base_id": "376",
    "description": "Leo never imagined that time travel might really be possible, or that the objects in H. G. Wells’ science fiction novels might actually exist. And when a miniature time machine appears in Leo’s bedroom, he has no idea who the tiny, beautiful girl is riding it. But in the few moments before it vanishes, returning to wherever—and whenever—it came from, he recognizes the other tiny rider: himself! His search for the time machine, the girl, and his fate leads him to the New-York Circulating Material Repository, a magical library that lends out objects instead of books. Hidden away in the Repository basement is the Wells Bequest, a secret collection of powerful objects straight out of classic science fiction novels: robots, rockets, submarines, a shrink ray—and one very famous time machine. And when Leo’s adventure of a lifetime suddenly turns deadly, he must attempt a journey to 1895 to warn real-life scientist Nikola Tesla about a dangerous invention. A race for time is on! In this grand time-travel adventure full of paradoxes and humor, Polly Shulman gives readers a taste of how fascinating science can be, deftly blending classic science fiction elements with the contemporary fantasy world readers fell in love with in The Grimm Legacy.",
    "editions": [
        "english",
        "spanish",
        "french"
    ],
    "genres": {
        "adventure": 35,
        "childrens (middle grade)": 61,
        "fantasy": 172,
        "fantasy (magic)": 17,
        "fiction": 30,
        "mystery": 17,
        "science fiction": 60,
        "science fiction (time travel)": 63,
        "young adult": 94,
        "young adult (teen)": 15
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_id": "376_1"
        },
        {
            "status": "maintenance",
            "stock_id": "376_2"
        },
        {
            "status": "maintenance",
            "stock_id": "376_3"
        },
        {
            "status": "maintenance",
            "stock_id": "376_4"
        },
        {
            "status": "available",
            "stock_id": "376_5"
        },
        {
            "status": "on_loan",
            "stock_id": "376_6"
        },
        {
            "status": "available",
            "stock_id": "376_7"
        },
        {
            "status": "available",
            "stock_id": "376_8"
        }
    ],
    "metrics": {
        "rating_votes": 2773,
        "score": 3.86
    },
    "pages": 772,
    "title": "The Wells Bequest",
    "url": "https://www.goodreads.com/book/show/16101024-the-wells-bequest",
    "year_published": 2013
}