{
  "author": "Ryan Boudinot",
  "id": "381",
  "description": "From the “wickedly talented” (Boston Globe) and “darkly funny” (New York Times Book Review) Ryan Boudinot, Blueprints of the Afterlife is a tour de force.It is the Afterlife. The end of the world is a distant, distorted memory called “the Age of F***ed Up Shit.” A sentient glacier has wiped out most of North America. Medical care is supplied by open-source nanotechnology, and human nervous systems can be hacked.Abby Fogg is a film archivist with a niggling feeling that her life is not really her own. She may be right. Al Skinner is a former mercenary for the Boeing Army, who’s been dragging his war baggage behind him for nearly a century. Woo-jin Kan is a virtuoso dishwasher with the Hotel and Restaurant Management Olympics medals to prove it. Over them all hovers a mysterious man named Dirk Bickle, who sends all these characters to a full-scale replica of Manhattan under construction in Puget Sound. An ambitious novel that writes large the hopes and anxieties of our time—climate change, social strife, the depersonalization of the digital age — Blueprints of the Afterlife will establish Ryan Boudinot as an exceptional novelist of great daring.Blueprints of the Afterlife alternates between a richly imagined future in which the apocalypse is a distant, hazy memory, and a present in which a man recounts his search for a secret organization bent on harnessing the brightest minds to control human destiny and life on earth. There are giant heads that appear in the sky. The world's greatest dishwasher. Over 600 clones of an ancient pop singer's backup dancer. Red carpet events. A mystical refrigerator.",
  "editions": [
    "english"
  ],
  "genres": [
    "apocalyptic (post apocalyptic)",
    "fantasy",
    "fiction",
    "humor",
    "novels",
    "science fiction",
    "science fiction (apocalyptic)",
    "science fiction (dystopia)",
    "science fiction fantasy",
    "speculative fiction"
  ],
  "inventory": [
    {
      "status": "on_loan",
      "stock_id": "381_1"
    },
    {
      "status": "on_loan",
      "stock_id": "381_2"
    },
    {
      "status": "available",
      "stock_id": "381_3"
    }
  ],
  "metrics": {
    "rating_votes": 2195,
    "score": 3.7
  },
  "pages": 515,
  "title": "Blueprints of the Afterlife",
  "url": "https://www.goodreads.com/book/show/8856041-blueprints-of-the-afterlife",
  "year_published": 2012
}
