{
    "author": "Simon Hawke",
    "base_id": "39",
    "description": "In the 27th Century, international disputes are resolved through time travel, \"clocking\" soldiers from the future into conflicts of the past. It seemed like an elegant idea: wartime industries drove the economy without actually putting nations through the physical ravages of war. And since the past already happened, history could not be changed. So went the theory. What could possibly go wrong?Lucas Priest found out the hard way. Enlisting in the U.S. Army Temporal Corps seemed like an adventure compared to his boring corporate job, but after marching with the Roman legions against Hannibal, fighting Custer's 7th Cavalry with Crazy Horse, and raiding with Attila's savage Huns, he could have used a little boredom. And it was about to get much worse. History, it turned out, COULD be changed, and a plot to kidnap and impersonate King Richard the Lion-hearted was discovered barely in the nick of time. But could it be stopped before a madman changed the course of history? Two elite commando teams had tried and failed in their attempts. Now Priest was drafted to take part in a third.The team was tasked to infiltrate the past with impersonations of their own to prevent a timestream split. But it would be hard enough passing themselves off as Sir Ivanhoe, Robin Hood, and Little John without having to assassinate a king....",
    "editions": [
        "english",
        "spanish"
    ],
    "genres": {
        "adventure": 8,
        "fantasy": 13,
        "fiction": 13,
        "historical": 2,
        "historical (historical fiction)": 8,
        "science fiction": 50,
        "science fiction (military science fiction)": 2,
        "science fiction (time travel)": 34,
        "science fiction fantasy": 4,
        "speculative fiction": 2
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_id": "39_1"
        },
        {
            "status": "maintenance",
            "stock_id": "39_2"
        },
        {
            "status": "available",
            "stock_id": "39_3"
        },
        {
            "status": "maintenance",
            "stock_id": "39_4"
        },
        {
            "status": "maintenance",
            "stock_id": "39_5"
        },
        {
            "status": "maintenance",
            "stock_id": "39_6"
        },
        {
            "status": "available",
            "stock_id": "39_7"
        },
        {
            "status": "maintenance",
            "stock_id": "39_8"
        }
    ],
    "metrics": {
        "rating_votes": 653,
        "score": 3.88
    },
    "pages": 527,
    "title": "The Ivanhoe Gambit",
    "url": "https://www.goodreads.com/book/show/597049.The_Ivanhoe_Gambit",
    "year_published": 1984
}