{
    "author": "Pittacus Lore",
    "base_id": 3954,
    "description": "Alternate cover for this ISBN can be found hereThe Garde are finally reunited, but do they have what it takes to win the war against the Mogadorians?John Smith—Number Four—thought that things would change once the Garde found each other. They would stop running. They would fight the Mogadorians. And they would win.But he was wrong. After facing off with the Mogadorian ruler and almost being annihilated, the Garde know they are drastically unprepared and hopelessly outgunned. Now they’re hiding out in Nine’s Chicago penthouse, trying to figure out their next move.The six of them are powerful, but they’re not strong enough yet to take on an entire army—even with the return of an old ally. To defeat their enemy, the Garde must master their Legacies and learn to work together as a team. More importantly, they’ll have to discover the truth about the Elders and their plan for the Loric survivors.And when the Garde receive a sign from Number Five—a crop circle in the shape of a Loric symbol—they know they are so close to being reunited. But could it be a trap? Time is running out, and the only thing they know for certain is that they have to get to Five before it’s too late.The Garde may have lost battles, but they will not lose this war.Lorien will rise again.",
    "editions": [
        "English"
    ],
    "genres": {
        "action": 60,
        "adventure": 112,
        "aliens": 230,
        "fantasy": 619,
        "fiction": 221,
        "paranormal": 100,
        "romance": 82,
        "science fiction": 523,
        "teen": 60,
        "young adult": 790
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "3954_1"
        },
        {
            "status": "maintenance",
            "stock_id": "3954_2"
        },
        {
            "status": "maintenance",
            "stock_id": "3954_3"
        },
        {
            "status": "available",
            "stock_id": "3954_4"
        },
        {
            "status": "maintenance",
            "stock_id": "3954_5"
        }
    ],
    "metrics": {
        "rating_votes": 58938,
        "score": 4.23
    },
    "pages": 431,
    "title": "The Fall of Five",
    "url": "https://www.goodreads.com/book/show/15861491-the-fall-of-five",
    "year_published": 2013
}