{
  "author": "Pierce Brown",
  "id": "4030",
  "description": "They call him father, liberator, warlord, Reaper. But he feels a boy as he falls toward the pale blue planet, his armor red, his army vast, his heart heavy. It is the tenth year of war and the thirty-second of his life. A decade ago, Darrow was the hero of the revolution he believed would break the chains of the Society. But the Rising has shattered everything: Instead of peace and freedom, it has brought endless war. Now he must risk everything he has fought for on one last desperate mission. Darrow still believes he can save everyone, but can he save himself? And throughout the worlds, other destinies entwine with Darrow’s to change his fate forever:  A young Red girl flees tragedy in her refugee camp and achieves for herself a new life she could never have imagined. An ex-soldier broken by grief is forced to steal the most valuable thing in the galaxy—or pay with his life. And Lysander au Lune, the heir in exile to the sovereign, wanders the stars with his mentor, Cassius, haunted by the loss of the world that Darrow transformed, and dreaming of what will rise from its ashes. Red Rising was the story of the end of one universe, and Iron Gold is the story of the creation of a new one. Witness the beginning of a stunning new saga of tragedy and triumph from masterly New York Times bestselling author Pierce Brown.",
  "editions": [
    "english",
    "spanish",
    "french"
  ],
  "genres": [
    "adult",
    "audiobook",
    "fantasy",
    "fiction",
    "science fiction",
    "science fiction (dystopia)",
    "science fiction fantasy",
    "space",
    "space (space opera)",
    "young adult"
  ],
  "inventory": [
    {
      "status": "maintenance",
      "stock_id": "4030_1"
    },
    {
      "status": "on_loan",
      "stock_id": "4030_2"
    },
    {
      "status": "maintenance",
      "stock_id": "4030_3"
    }
  ],
  "metrics": {
    "rating_votes": 47926,
    "score": 4.22
  },
  "pages": 843,
  "title": "Iron Gold",
  "url": "https://www.goodreads.com/book/show/33257757-iron-gold",
  "year_published": 2018
}
