{
  "author": "Diane Chamberlain",
  "id": "4080",
  "description": "From bestselling author Diane Chamberlain comes an irresistible new novel. When Caroline Sears receives the news that her unborn baby girl has a heart defect, she is devastated. It is 1970 and there seems to be little that can be done. But her brother-in-law, a physicist, tells her that perhaps there is. Hunter appeared in their lives just a few years before—and his appearance was as mysterious as his past. With no family, no friends, and a background shrouded in secrets, Hunter embraced the Sears family and never looked back. Now, Hunter is telling her that something can be done about her baby's heart. Something that will shatter every preconceived notion that Caroline has. Something that will require a kind of strength and courage that Caroline never knew existed. Something that will mean a mind-bending leap of faith on Caroline's part.And all for the love of her unborn child.A rich, genre-spanning, breathtaking novel about one mother's quest to save her child, unite her family, and believe in the unbelievable. Diane Chamberlain pushes the boundaries of faith and science to deliver a novel that you will never forget.",
  "editions": [
    "english"
  ],
  "genres": [
    "adult",
    "adult fiction",
    "audiobook",
    "contemporary",
    "fantasy",
    "fiction",
    "historical",
    "historical (historical fiction)",
    "science fiction",
    "science fiction (time travel)"
  ],
  "inventory": [
    {
      "status": "available",
      "stock_id": "4080_1"
    },
    {
      "status": "on_loan",
      "stock_id": "4080_2"
    },
    {
      "status": "available",
      "stock_id": "4080_3"
    },
    {
      "status": "maintenance",
      "stock_id": "4080_4"
    },
    {
      "status": "available",
      "stock_id": "4080_5"
    }
  ],
  "metrics": {
    "rating_votes": 23098,
    "score": 4.24
  },
  "pages": 975,
  "title": "The Dream Daughter",
  "url": "https://www.goodreads.com/book/show/37638145-the-dream-daughter",
  "year_published": 2018
}
