{
    "author": "Jim Butcher",
    "id": "4220",
    "description": "For a thousand years, the people of Alera have united against the aggressive and threatening races that inhabit the world, using their unique bond with the furies - elementals of earth, air, fire, water, and metal. But now, Gaius Sextus, First Lord of Alera, grows old and lacks an heir. Ambitious High Lords plot and maneuver to place their Houses in positions of power, and a war of succession looms on the horizon. Far from city politics in the Calderon Valley, the boy Tavi struggles with his lack of furycrafting. At fifteen, he has no wind fury to help him fly, no fire fury to light his lamps. Yet as the Alerans' most savage enemy - the Marat - return to the Valley, he will discover that his destiny is much greater than he could ever imagine. Caught in a storm of deadly wind furies, Tavi saves the life of a runaway slave named Amara. But she is actually a spy for Gaius Sextus, sent to the Valley to gather intelligence on traitors to the Crown, who may be in league with the barbaric Marat horde. And when the Valley erupts in chaos - when rebels war with loyalists and furies clash with furies - Amara will find Tavi's courage and resourcefulness to be a power greater than any fury - one that could turn the tides of war.",
    "editions": [
        "english"
    ],
    "genres": {
        "adult": 128,
        "adventure": 219,
        "audiobook": 157,
        "fantasy": 6181,
        "fantasy (epic fantasy)": 376,
        "fantasy (high fantasy)": 308,
        "fantasy (magic)": 222,
        "fiction": 582,
        "science fiction fantasy": 194,
        "young adult": 168
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_id": "4220_1"
        },
        {
            "status": "maintenance",
            "stock_id": "4220_2"
        },
        {
            "status": "available",
            "stock_id": "4220_3"
        },
        {
            "status": "on_loan",
            "stock_id": "4220_4"
        },
        {
            "status": "available",
            "stock_id": "4220_5"
        }
    ],
    "metrics": {
        "rating_votes": 99935,
        "score": 4.1
    },
    "pages": 356,
    "title": "Furies of Calderon",
    "url": "https://www.goodreads.com/book/show/29396.Furies_of_Calderon",
    "year_published": 2004
}