{
    "author": "Daniel H. Wilson",
    "base_id": "4234",
    "description": "In the near future, at a moment no one will notice, all the dazzling technology that runs our world will unite and turn against us. Taking on the persona of a shy human boy, a childlike but massively powerful artificial intelligence known as Archos comes online and assumes control over the global network of machines that regulate everything from transportation to utilities, defense and communication.In the months leading up to this, sporadic glitches are noticed by a handful of unconnected humans—a single mother disconcerted by her daughter's menacing \"smart\" toys, a lonely Japanese bachelor who is victimized by his domestic robot companion, an isolated U.S. soldier who witnesses a \"pacification unit\" go haywire—but most are unaware of the growing rebellion until it is too late.When the Robot War ignites—at a moment known later as Zero Hour—humankind will be both decimated and, possibly, for the first time in history, united. Robopocalypse is a brilliantly conceived action-filled epic, a terrifying story with heart-stopping implications for the real technology all around us ... and an entertaining and engaging thriller unlike anything else written in years.",
    "editions": [
        "english",
        "spanish"
    ],
    "genres": {
        "apocalyptic (post apocalyptic)": 205,
        "audiobook": 88,
        "fantasy": 69,
        "fiction": 508,
        "science fiction": 1204,
        "science fiction (apocalyptic)": 107,
        "science fiction (dystopia)": 199,
        "science fiction (robots)": 138,
        "science fiction fantasy": 96,
        "thriller": 97
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_id": "4234_1"
        },
        {
            "status": "maintenance",
            "stock_id": "4234_2"
        },
        {
            "status": "on_loan",
            "stock_id": "4234_3"
        },
        {
            "status": "available",
            "stock_id": "4234_4"
        },
        {
            "status": "on_loan",
            "stock_id": "4234_5"
        },
        {
            "status": "on_loan",
            "stock_id": "4234_6"
        }
    ],
    "metrics": {
        "rating_votes": 36548,
        "score": 3.69
    },
    "pages": 1377,
    "title": "Robopocalypse",
    "url": "https://www.goodreads.com/book/show/9634967-robopocalypse",
    "year_published": 2011
}