{
    "author_name": "Jim C. Hines",
    "base_id": 428,
    "book_description": "When the Krakau came to Earth, they planned to invite humanity into a growing alliance of sentient species. This would have worked out better for all involved if they hadn’t arrived after a mutated plague wiped out half the planet, turned the rest into shambling, near-unstoppable animals, and basically destroyed human civilization. You know—your standard apocalypse. The Krakau’s first impulse was to turn their ships around and go home. After all, it’s hard to establish diplomatic relations with mindless savages who eat your diplomats. Their second impulse was to try to fix us. A century later, human beings might not be what they once were, but at least they’re no longer trying to eat everyone. Mostly.Marion “Mops” Adamopoulos is surprisingly bright (for a human). As a Lieutenant on the Earth Mercenary Corps Ship Pufferfish, she’s in charge of the Shipboard Hygiene and Sanitation team. When a bioweapon attack by an alien race wipes out the Krakau command crew and reverts the rest of the humans to their feral state, only Mops and her team are left with their minds intact.Escaping the attacking aliens—not to mention her shambling crewmates—is only the beginning. Sure, Mops and her assortment of space janitors and plumbers can clean the ship, but flying the damn thing is another matter. As they struggle to keep the Pufferfish functioning and find a cure for their crew, they stumble onto a conspiracy that could threaten the entire alliance.A conspiracy born from the truth of what happened on Earth all those years ago…",
    "book_title": "Terminal Alliance",
    "editions": [
        "English"
    ],
    "genres": {
        "adventure": 12,
        "aliens": 22,
        "comedy": 13,
        "fantasy": 13,
        "fiction": 48,
        "humor": 74,
        "post apocalyptic": 16,
        "science fiction": 201,
        "space": 24,
        "space opera": 38
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_number": "428_1"
        },
        {
            "status": "available",
            "stock_number": "428_2"
        }
    ],
    "metrics": {
        "rating_votes": 2263,
        "score": 4.02
    },
    "original_book_title": "\n0756412749\n(ISBN13: 9780756412746)\n",
    "pages": 1008,
    "url": "https://www.goodreads.com/book/show/31363503-terminal-alliance",
    "year_published": 2017
}