{
    "author": "G.L. Carriger",
    "base_id": 433,
    "description": "A species that has no word for murder, has a murderer aboard their spaceship.ALIEN Tristol lives in exile. But he’s built a life for himself aboard a human space station. He’s even begun to understand the complex nuances of human courting rituals. Detective Hastion is finally flirting back! MURDER Except that Tristol’s beloved space station is unexpectedly contacted by the galoi – a xenophobic species with five genders, purple skin, and serious attitude. They need the help of a human detective because there’s a murderer aboard their spaceship. Murder is so rare, the galoi don’t even have a word for it. Tristol knows this because he is galoi. ROMANCE Which means that he and Detective Hastion are on the case… together. Delicate Sensibilities? Contains men who love other men in graphic detail, regardless of gender, biology, or skin color... and lots of emotively sexy tentacle hair. New York Times best selling author Gail Carriger (writing as G.L. Carriger) brings you a light-hearted romantic cozy mystery featuring an adorable lavender alien and his human crush.",
    "editions": [
        "English"
    ],
    "genres": {
        "aliens": 64,
        "fantasy": 27,
        "fiction": 20,
        "lgbt": 38,
        "male male romance": 75,
        "mystery": 79,
        "queer": 21,
        "romance": 131,
        "science fiction": 121,
        "science fiction romance": 9
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_id": "433_1"
        },
        {
            "status": "available",
            "stock_id": "433_2"
        },
        {
            "status": "on_loan",
            "stock_id": "433_3"
        },
        {
            "status": "available",
            "stock_id": "433_4"
        },
        {
            "status": "available",
            "stock_id": "433_5"
        },
        {
            "status": "available",
            "stock_id": "433_6"
        },
        {
            "status": "on_loan",
            "stock_id": "433_7"
        }
    ],
    "metrics": {
        "rating_votes": 1889,
        "score": 4.24
    },
    "pages": 1239,
    "title": "The 5th Gender",
    "url": "https://www.goodreads.com/book/show/44554614-the-5th-gender",
    "year_published": 2019
}