{
    "author_name": "Ruby Dixon",
    "base_id": 436,
    "book_description": "A lush, tropical island on an icy planet makes no sense.Then again, not much makes sense anymore after waking up and finding myself not in bed but on a strange world populated by aliens. Since that moment, I’ve learned that nothing is normal anymore and I’ve got to roll with the punches. I can handle this, though. I’m strong and capable.So… washed up on a tropical island? Got it handled.Separated from the others in my group? Handled.Stranded alone with a brutal but delicious alien man that can’t speak English but has great… ahem… body language? Yup, handled.Add in the fact that my cootie – a symbiont I need to survive – has chosen my big, hulking alien friend as my fated mate? Let’s just say that the situation isn’t the only thing that’s going to be handled. But it isn’t long before I learn that the tropical island paradise is a death trap and we’re all in grave danger, aliens and humans alike. To survive this, I'll need my tempting guy to give me a hand with the situation… good thing he's got four of them.This romance features all of the adventure, humor and community you’ve come to expect in the Ice Planet Barbarians series, but it stands on its own. You do not need to read the other series (or be caught up) in order to read LAUREN'S BARBARIAN.",
    "book_title": "Lauren's Barbarian",
    "editions": [
        "English"
    ],
    "genres": {
        "adult": 19,
        "aliens": 129,
        "audiobook": 12,
        "erotica": 29,
        "fantasy": 46,
        "paranormal": 33,
        "paranormal romance": 30,
        "romance": 113,
        "science fiction": 106,
        "science fiction romance": 37
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_number": "436_1"
        },
        {
            "status": "available",
            "stock_number": "436_2"
        },
        {
            "status": "maintenance",
            "stock_number": "436_3"
        },
        {
            "status": "on_loan",
            "stock_number": "436_4"
        },
        {
            "status": "maintenance",
            "stock_number": "436_5"
        },
        {
            "status": "maintenance",
            "stock_number": "436_6"
        },
        {
            "status": "maintenance",
            "stock_number": "436_7"
        },
        {
            "status": "on_loan",
            "stock_number": "436_8"
        }
    ],
    "metrics": {
        "rating_votes": 5836,
        "score": 4.05
    },
    "original_book_title": "Lauren's Barbarian",
    "pages": 1272,
    "url": "https://www.goodreads.com/book/show/36383830-lauren-s-barbarian",
    "year_published": 2017
}