{
    "author_name": "Evangeline Anderson",
    "base_id": 441,
    "book_description": "This Book is a Super Plus length novel--129,000 words longOne Woman, Two Hot Guys, A Galaxy of Problems...Kat O’Connor is no pushover. She’s a no nonsense girl with a commonsense approach to life. But there’s nothing common about what’s happening to her lately…First she was forced to have a kinky mind ménage with two of the hottest and most irritating men in the galaxy—Twin Kindred warriors, Deep and Lock—in order to locate her kidnapped friend. Then she couldn’t get their feelings out of her head. And now she’s on her way to their home planet, Twin Moons, to find a cure for the debilitating illness their unorthodox joining caused, when all she really wants to do is go home.Locks Tight, the light twin of the two, is already in love with Kat. Her curvy plus-sized body is the epitome of beauty on his home planet and her sharp mind makes her doubly attractive. But though he fell for her the moment he saw her, Twin Kindred are unable to mate a woman alone. Lock knows nothing can happen between them without his brother…Stabs Deep. The dark twin has a secret agony in his past—a tragedy he feels he and he alone is to blame for. He too, hungers for Kat, but he hides his fear of rejection behind an impenetrable wall of angry sarcasm. For if he lets anyone get too close, the unbearable pain he has already endured once may happen again. Now Kat and her twin warriors are on a quest—but they’re all looking for different things. Kat wants to find a way to dissolve the half-formed bond between them so she can be alone in her own head again. Lock wants to convince both her and his brother to complete the bond which will keep them together forever. And Deep is trying to protect his heart and love Kat from afar…though it grows more and more difficult to deny the hunger he feels for her growing inside him.Their travels will take them from the uncharted wilds of Twin Moons to the Deadworld of the Scourge home planet. Will Kat find a cure for having other people’s emotions crowding her mind? Will Lock convince his brother and the woman they both love that they’re all meant to be together forever? And will Deep ever unshield his heart long enough to let Kat in?You’ll have to read Sought, the third book in the Brides of the Kindred series, to find out…",
    "book_title": "Sought",
    "editions": [
        "English"
    ],
    "genres": {
        "adult": 35,
        "aliens": 134,
        "erotica": 127,
        "fantasy": 56,
        "paranormal": 94,
        "paranormal romance": 66,
        "romance": 195,
        "science fiction": 155,
        "science fiction romance": 70
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_number": "441_1"
        }
    ],
    "metrics": {
        "rating_votes": 8135,
        "score": 3.92
    },
    "original_book_title": "B005BT583Y",
    "pages": 1103,
    "url": "https://www.goodreads.com/book/show/11995467-sought",
    "year_published": 2011
}