{
    "author": "H.G. Wells",
    "id": "4423",
    "description": "Ranked among the classic novels of the English language and the inspiration for several unforgettable movies, this early work of H. G. Wells was greeted in 1896 by howls of protest from reviewers, who found it horrifying and blasphemous. They wanted to know more about the wondrous possibilities of science shown in his first book, The Time Machine, not its potential for misuse and terror. In The Island of Dr. Moreau, a shipwrecked gentleman named Edward Prendick, stranded on a Pacific island lorded over by the notorious Dr. Moreau, confronts dark secrets, strange creatures, and a reason to run for his life.While this riveting tale was intended to be a commentary on evolution, divine creation, and the tension between human nature and culture, modern readers familiar with genetic engineering will marvel at Wells’s prediction of the ethical issues raised by producing “smarter” human beings or bringing back extinct species. These levels of interpretation add a richness to Prendick’s adventures on Dr. Moreau’s island of lost souls without distracting from what is still a rip-roaring good read.",
    "editions": [
        "english",
        "spanish"
    ],
    "genres": {
        "adventure": 141,
        "classics": 3280,
        "fantasy": 403,
        "fiction": 1625,
        "horror": 1158,
        "literature": 198,
        "literature (19th century)": 168,
        "novels": 156,
        "science fiction": 2451,
        "science fiction fantasy": 176
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "4423_1"
        },
        {
            "status": "available",
            "stock_id": "4423_2"
        }
    ],
    "metrics": {
        "rating_votes": 99517,
        "score": 3.73
    },
    "pages": 1200,
    "title": "The Island of Doctor Moreau",
    "url": "https://www.goodreads.com/book/show/29981.The_Island_of_Doctor_Moreau",
    "year_published": 1896
}