{
    "author": "Sherrilyn Kenyon",
    "base_id": 472,
    "description": "Every Life Has A Price™One of the fiercest soldiers the Phrixians have ever produced, Maris Sulle has been an outsider from the moment he was born different from the rest of his royal military family. And once his deadly secret was exposed, it cost him everything—his birthright, his family, and his stellar military career.Ture Xans spent his entire life hiding from everyone around him—his family, his friends, and anyone who wanted to get close to him—while trying desperately to fit in and keep his head low. Badly hurt by everyone he’s ever known, he trusts no one except his own best friend. But honestly, he can’t understand why he trusts her. Nor can he believe her when she describes a loyalty between the League allies the likes of which he’s never seen.Yet when Ture is captured by the League in a coup he wanted no part of, his life is saved by a hero he thought only existed in fables. A man who is every bit as scarred and mistrusting as he is. One who has no interest in being dragged into another war for any reason. Having spent his life as a living study of doomed relationships, Maris is well aware of the fiasco that invariably follows. Still, there is something about Ture he can’t resist. Something that won’t let him walk away when he knows he should. But when old enemies return to threaten them both, they either have to stand together or die alone.",
    "editions": [
        "English"
    ],
    "genres": {
        "adult": 22,
        "aliens": 28,
        "fantasy": 72,
        "futuristic": 24,
        "male male romance": 61,
        "paranormal": 81,
        "paranormal romance": 92,
        "romance": 152,
        "science fiction": 75,
        "science fiction romance": 27
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "472_1"
        },
        {
            "status": "maintenance",
            "stock_id": "472_2"
        },
        {
            "status": "available",
            "stock_id": "472_3"
        },
        {
            "status": "available",
            "stock_id": "472_4"
        },
        {
            "status": "on_loan",
            "stock_id": "472_5"
        },
        {
            "status": "on_loan",
            "stock_id": "472_6"
        },
        {
            "status": "on_loan",
            "stock_id": "472_7"
        },
        {
            "status": "maintenance",
            "stock_id": "472_8"
        },
        {
            "status": "available",
            "stock_id": "472_9"
        }
    ],
    "metrics": {
        "rating_votes": 6616,
        "score": 4.31
    },
    "pages": 425,
    "title": "Cloak and Silence",
    "url": "https://www.goodreads.com/book/show/36640259-cloak-and-silence",
    "year_published": 2013
}