{
  "author": "Warren Ellis",
  "id": "492",
  "description": "A smart, tight, provocative techno-thriller straight out of the very near future—by an iconic visionary writerSome people call it \"abyss gaze.\" Gaze into the abyss all day and the abyss will gaze into you. There are two types of people who think professionally about the future: foresight strategists are civil futurists who think about geo-engineering and smart cities and ways to evade Our Coming Doom; strategic forecasters are spook futurists, who think about geopolitical upheaval and drone warfare and ways to prepare clients for Our Coming Doom. The former are paid by nonprofits and charities, the latter by global security groups and corporate think tanks. For both types, if you're good at it, and you spend your days and nights doing it, then it's something you can't do for long. Depression sets in. Mental illness festers. And if the \"abyss gaze\" takes hold there's only one place to recover: Normal Head, in the wilds of Oregon, within the secure perimeter of an experimental forest. When Adam Dearden, a foresight strategist, arrives at Normal Head, he is desperate to unplug and be immersed in sylvan silence. But then a patient goes missing from his locked bedroom, leaving nothing but a pile of insects in his wake. A staff investigation ensues; surveillance becomes total. As the mystery of the disappeared man unravels in Warren Ellis's Normal, Dearden uncovers a conspiracy that calls into question the core principles of how and why we think about the future—and the past, and the now.",
  "editions": [
    "english",
    "spanish",
    "french"
  ],
  "genres": [
    "fiction",
    "mystery",
    "novella",
    "novels",
    "science fiction",
    "science fiction (cyberpunk)",
    "science fiction (dystopia)",
    "science fiction fantasy",
    "speculative fiction",
    "thriller"
  ],
  "inventory": [
    {
      "status": "maintenance",
      "stock_id": "492_1"
    },
    {
      "status": "maintenance",
      "stock_id": "492_2"
    },
    {
      "status": "maintenance",
      "stock_id": "492_3"
    },
    {
      "status": "maintenance",
      "stock_id": "492_4"
    },
    {
      "status": "maintenance",
      "stock_id": "492_5"
    }
  ],
  "metrics": {
    "rating_votes": 3259,
    "score": 3.67
  },
  "pages": 1159,
  "title": "Normal",
  "url": "https://www.goodreads.com/book/show/20518817-normal",
  "year_published": 2016
}
