{
    "author": "Alessandra Hazard",
    "base_id": 496,
    "description": "\"I hate you.\" Please touch me. \"You sicken me.\" Hold me closer. \"I want to be free of you.\" I can't live without you.The messed-up part is, he means everything he says.The youngest prince of his clan, Seyn has been betrothed to the crown prince of another clan since birth. Everyone says he's so lucky to marry one of the most respected, powerful men on the planet, but Seyn knows better.He hates him with every fiber of his being. Ksar is a cold, uncaring, overbearing bastard who uses underhanded tactics to achieve his goals and who either ignores Seyn or criticizes everything about him. Seyn can't stand him, and he's willing to do anything to get out of the arranged marriage to a man he abhors.But the line between feverish hatred and passion can be very thin, and it turns out that freedom isn't as appealing as it once seemed.Is it messed-up to miss a man you loathe?Is it sick to want his hands on you?Seyn knows it's insane. He knows he should stop going back.But knowing something and doing it are two different things.Publisher's note: Second Edition (2020). This book contains explicit MM content and graphic language. Book 2 in Calluvia's Royalty series. The books should be read in order.",
    "editions": [
        "English"
    ],
    "genres": {
        "adult": 12,
        "aliens": 68,
        "erotica": 16,
        "fantasy": 75,
        "gay": 13,
        "lgbt": 38,
        "male male romance": 176,
        "paranormal": 36,
        "romance": 101,
        "science fiction": 115
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_id": "496_1"
        },
        {
            "status": "on_loan",
            "stock_id": "496_2"
        }
    ],
    "metrics": {
        "rating_votes": 3593,
        "score": 4.18
    },
    "pages": 453,
    "title": "That Irresistible Poison",
    "url": "https://www.goodreads.com/book/show/56276755-that-irresistible-poison",
    "year_published": 2018
}