{
    "author": "Jim C. Hines",
    "base_id": "507",
    "description": "Isaac Vainio’s life was almost perfect. He should have known it couldn’t last.Living and working as a part-time librarian in Michigan’s Upper Peninsula, Isaac had finally earned the magical research position he dreamed of with Die Zwelf Portenære, better known as the Porters. He was seeing a smart, fun, gorgeous dryad named Lena Greenwood. He had been cleared by Johannes Gutenberg to do libriomancy once again, to reach into books and create whatever he chose from their pages. Best of all, it had been more than two months since anything tried to kill him.And then Isaac, Lena, and Porter psychiatrist Nidhi Shah are called to the small mining town of Tamarack, Michigan, where a pair of septuagenarian werewolves have discovered the brutally murdered body of a wendigo.What begins as a simple monster-slaying leads to deeper mysteries and the discovery of an organization thought to have been wiped out more than five centuries ago by Gutenberg himself. Their magic rips through Isaac’s with ease, and their next target is Lena Greenwood.They know Lena’s history, her strengths and her weaknesses. Born decades ago from the pages of a pulp fantasy novel, she was created to be the ultimate fantasy woman, shaped by the needs and desires of her companions. Her powers are unique, and Gutenberg’s enemies mean to use her to destroy everything he and the Porters have built. But their plan could unleash a far darker power, an army of entropy and chaos, bent on devouring all it touches.The Upper Peninsula is about to become ground zero in a magical war like nothing the world has seen in more than five hundred years. But the more Isaac learns about Gutenberg and the Porters, the more he questions whether he’s fighting for the right cause.One way or another, Isaac must find a way to stop a power he doesn’t fully understand. And even if he succeeds, the outcome will forever change him, the Porters, and the whole world.",
    "editions": [
        "english"
    ],
    "genres": {
        "fantasy": 411,
        "fantasy (magic)": 46,
        "fantasy (paranormal)": 19,
        "fantasy (urban fantasy)": 312,
        "fiction": 46,
        "paranormal (vampires)": 16,
        "science fiction": 24,
        "science fiction fantasy": 16,
        "shapeshifters (werewolves)": 11,
        "writing (books about books)": 20
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "507_1"
        },
        {
            "status": "maintenance",
            "stock_id": "507_2"
        },
        {
            "status": "on_loan",
            "stock_id": "507_3"
        },
        {
            "status": "on_loan",
            "stock_id": "507_4"
        },
        {
            "status": "on_loan",
            "stock_id": "507_5"
        },
        {
            "status": "on_loan",
            "stock_id": "507_6"
        },
        {
            "status": "maintenance",
            "stock_id": "507_7"
        }
    ],
    "metrics": {
        "rating_votes": 5382,
        "score": 3.92
    },
    "pages": 915,
    "title": "Codex Born",
    "url": "https://www.goodreads.com/book/show/15824178-codex-born",
    "year_published": 2013
}