{
    "author": "Scott Lynch",
    "base_id": "5094",
    "description": "With what should have been the greatest heist of their career gone spectacularly sour, Locke and his trusted partner, Jean, have barely escaped with their lives. Or at least Jean has. But Locke is slowly succumbing to a deadly poison that no alchemist or physiker can cure. Yet just as the end is near, a mysterious Bondsmage offers Locke an opportunity that will either save him or finish him off once and for all.Magi political elections are imminent, and the factions are in need of a pawn. If Locke agrees to play the role, sorcery will be used to purge the venom from his body - though the process will be so excruciating he may well wish for death. Locke is opposed, but two factors cause his will to crumble: Jean's imploring - and the Bondsmage's mention of a woman from Locke's past: Sabetha. She is the love of his life, his equal in skill and wit, and now, his greatest rival. Locke was smitten with Sabetha from his first glimpse of her as a young fellow orphan and thief-in-training. But after a tumultuous courtship, Sabetha broke away. Now they will reunite in yet another clash of wills. For faced with his one and only match in both love and trickery, Locke must choose whether to fight Sabetha - or to woo her. It is a decision on which both their lives may depend.",
    "editions": [
        "english",
        "spanish",
        "french"
    ],
    "genres": {
        "adult": 115,
        "adventure": 215,
        "audiobook": 157,
        "fantasy": 5234,
        "fantasy (epic fantasy)": 202,
        "fantasy (high fantasy)": 181,
        "fantasy (magic)": 84,
        "fiction": 586,
        "mystery (crime)": 76,
        "science fiction fantasy": 104
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_id": "5094_1"
        },
        {
            "status": "maintenance",
            "stock_id": "5094_2"
        },
        {
            "status": "on_loan",
            "stock_id": "5094_3"
        },
        {
            "status": "maintenance",
            "stock_id": "5094_4"
        },
        {
            "status": "available",
            "stock_id": "5094_5"
        },
        {
            "status": "maintenance",
            "stock_id": "5094_6"
        },
        {
            "status": "maintenance",
            "stock_id": "5094_7"
        }
    ],
    "metrics": {
        "rating_votes": 88502,
        "score": 4.2
    },
    "pages": 348,
    "title": "The Republic of Thieves",
    "url": "https://www.goodreads.com/book/show/2890090-the-republic-of-thieves",
    "year_published": 2013
}