{
    "author": "James Frey",
    "base_id": "528",
    "description": "The sequel to the New York Times bestseller and international multimedia phenomenon, Endgame: The Calling.Endgame is here. Earth Key has been found. Two keys—and nine Players—remain. The keys must be found, and only one Player can win.Queens, New York. Aisling Kopp believes the unthinkable: that Endgame can be stopped. But before she can get home to regroup, she is approached by the CIA. They know about Endgame. And they have their own ideas about how it should be Played. Ideas that could change everything.Kingdom of Aksum, Ethiopia. Hilal ibn Isa al-Salt narrowly survived an attack that leaves him horribly disfigured. He now knows something the other Players do not. But the Aksumites have a secret that is unique to their line. A secret that can help redeem humanity—and maybe even be used to help defeat the beings behind Endgame.London, England. Sarah Alopay has found the first key. She is with Jago—and they are winning.But getting Earth Key has come at a great cost to Sarah. The only thing that keeps the demons at bay is Playing. Playing to win.Sky Key—wherever it is, whatever it is—is next. And the nine remaining Players will stop at nothing to get it.",
    "editions": [
        "english",
        "spanish"
    ],
    "genres": {
        "action": 7,
        "adventure": 15,
        "fantasy": 81,
        "fiction": 17,
        "mystery": 7,
        "science fiction": 48,
        "science fiction (aliens)": 15,
        "science fiction (dystopia)": 47,
        "thriller": 8,
        "young adult": 82
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "528_1"
        },
        {
            "status": "on_loan",
            "stock_id": "528_2"
        }
    ],
    "metrics": {
        "rating_votes": 5929,
        "score": 3.98
    },
    "pages": 947,
    "title": "Sky Key",
    "url": "https://www.goodreads.com/book/show/24465662-sky-key",
    "year_published": 2015
}