{
    "author": "Neal Stephenson",
    "id": "5382",
    "description": "Cryptonomicon zooms all over the world, careening conspiratorially back and forth between two time periods—World War II and the present. Our 1940s heroes are the brilliant mathematician Lawrence Waterhouse, crypt analyst extraordinaire, and gung-ho, morphine-addicted marine Bobby Shaftoe. They're part of Detachment 2702, an Allied group trying to break Axis communication codes while simultaneously preventing the enemy from figuring out that their codes have been broken. Their job boils down to layer upon layer of deception. Dr. Alan Turing is also a member of 2702, and he explains the unit's strange workings to Waterhouse. \"When we want to sink a convoy, we send out an observation plane first... Of course, to observe is not its real duty—we already know exactly where the convoy is. Its real duty is to be observed... Then, when we come round and sink them, the Germans will not find it suspicious.\"All of this secrecy resonates in the present-day story line, in which the grandchildren of the WWII heroes—inimitable programming geek Randy Waterhouse and the lovely and powerful Amy Shaftoe—team up to help create an offshore data haven in Southeast Asia and maybe uncover some gold once destined for Nazi coffers. To top off the paranoiac tone of the book, the mysterious Enoch Root, key member of Detachment 2702 and the Societas Eruditorum, pops up with an unbreakable encryption scheme left over from WWII to befuddle the 1990s protagonists with conspiratorial ties.",
    "editions": [
        "english",
        "spanish"
    ],
    "genres": {
        "fantasy": 153,
        "fiction": 2411,
        "historical": 213,
        "historical (historical fiction)": 844,
        "novels": 119,
        "science fiction": 1966,
        "science fiction (cyberpunk)": 391,
        "science fiction fantasy": 175,
        "thriller": 254,
        "war": 175
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "5382_1"
        }
    ],
    "metrics": {
        "rating_votes": 100686,
        "score": 4.24
    },
    "pages": 679,
    "title": "Cryptonomicon",
    "url": "https://www.goodreads.com/book/show/816.Cryptonomicon",
    "year_published": 1999
}