{
    "author": "Brian Herbert",
    "id": "545",
    "description": "Frank Herbert's Dune series is one of the great creations of imaginative literature, science fiction's answer to The Lord of the Rings.Decades after Herbert's original novels, the Dune saga was continued by Frank Herbert's son, Brian Herbert, in collaboration with Kevin J. Anderson. Working from Frank Herbert's own notes, the acclaimed authors reveal the chapter of the Dune saga most eagerly anticipated by readers: the Butlerian Jihad.Throughout the Dune novels, Frank Herbert frequently referred to the war in which humans wrested their freedom from \"thinking machines.\" In Dune: The Butlerian Jihad, Brian Herbert and Kevin J. Anderson bring to life the story of that war, a tale previously seen only in tantalizing hints and clues. Finally, we see how Serena Butler's passionate grief ignites the struggle that will liberate humans from their machine masters; here is the amazing tale of the Zensunni Wanderers, who escape bondage to flee to the desert world where they will declare themselves the Free Men of Dune. And here is the backward, nearly forgotten planet of Arrakis, where traders have discovered the remarkable properties of the spice melange....",
    "editions": [
        "english",
        "spanish",
        "french"
    ],
    "genres": {
        "adventure": 17,
        "audiobook": 16,
        "epic": 11,
        "fantasy": 100,
        "fiction": 179,
        "novels": 13,
        "science fiction": 712,
        "science fiction fantasy": 52,
        "space": 23,
        "space (space opera)": 35
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_id": "545_1"
        },
        {
            "status": "available",
            "stock_id": "545_2"
        },
        {
            "status": "maintenance",
            "stock_id": "545_3"
        }
    ],
    "metrics": {
        "rating_votes": 22459,
        "score": 3.71
    },
    "pages": 442,
    "title": "The Butlerian Jihad",
    "url": "https://www.goodreads.com/book/show/99219.The_Butlerian_Jihad",
    "year_published": 2002
}