{
    "author": "Alastair Reynolds",
    "id": "553",
    "description": "Spearpoint, the last human city, is an atmosphere-piercing spire of vast size. Clinging to its skin are the zones, a series of semi-autonomous city-states, each of which enjoys a different—and rigidly enforced—level of technology. Horsetown is pre-industrial; in Neon Heights they have television and electric trains . . .Following an infiltration mission that went tragically wrong, Quillon has been living incognito, working as a pathologist in the district morgue. But when a near-dead angel drops onto his dissecting table, Quillon's world is wrenched apart one more time, for the angel is a winged posthuman from Spearpoint's Celestial Levels—and with the dying body comes bad news.If Quillon is to save his life, he must leave his home and journey into the cold and hostile lands beyond Spearpoint's base, starting an exile that will take him further than he could ever imagine. But there is far more at stake than just Quillon's own survival, for the limiting technologies of the zones are determined not by governments or police, but by the very nature of reality—and reality itself is showing worrying signs of instability . . .Terminal World is a snarling, drooling, crazy-eyed mongrel of a book: equal parts steampunk, western, planetary romance, and far-future SF.",
    "editions": [
        "english",
        "spanish"
    ],
    "genres": {
        "adventure": 10,
        "apocalyptic (post apocalyptic)": 19,
        "audiobook": 22,
        "fantasy": 35,
        "fiction": 90,
        "science fiction": 394,
        "science fiction (steampunk)": 86,
        "science fiction fantasy": 13,
        "space (space opera)": 24,
        "speculative fiction": 9
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_id": "553_1"
        },
        {
            "status": "on_loan",
            "stock_id": "553_2"
        },
        {
            "status": "available",
            "stock_id": "553_3"
        },
        {
            "status": "on_loan",
            "stock_id": "553_4"
        }
    ],
    "metrics": {
        "rating_votes": 6500,
        "score": 3.73
    },
    "pages": 310,
    "title": "Terminal World",
    "url": "https://www.goodreads.com/book/show/6237781-terminal-world",
    "year_published": 2009
}