{
  "author": "Tom Perrotta",
  "id": "5802",
  "description": "What if — whoosh, right now, with no explanation — a number of us simply vanished? Would some of us collapse? Would others of us go on, one foot in front of the other, as we did before the world turned upside down? That's what the bewildered citizens of Mapleton, who lost many of their neighbors, friends and lovers in the event known as the Sudden Departure, have to figure out. Because nothing has been the same since it happened — not marriages, not friendships, not even the relationships between parents and children.Kevin Garvey, Mapleton's new mayor, wants to speed up the healing process, to bring a sense of renewed hope and purpose to his traumatized community. Kevin's own family has fallen apart in the wake of the disaster: his wife, Laurie, has left to join the Guilty Remnant, a homegrown cult whose members take a vow of silence; his son, Tom, is gone, too, dropping out of college to follow a sketchy prophet named Holy Wayne. Only Kevin's teenaged daughter, Jill, remains, and she's definitely not the sweet \"A\" student she used to be. Kevin wants to help her, but he's distracted by his growing relationship with Nora Durst, a woman who lost her entire family on October 14th and is still reeling from the tragedy, even as she struggles to move beyond it and make a new start.With heart, intelligence and a rare ability to illuminate the struggles inherent in ordinary lives, Tom Perrotta has written a startling, thought-provoking novel about love, connection and loss.",
  "editions": [
    "english"
  ],
  "genres": [
    "adult",
    "adult fiction",
    "audiobook",
    "contemporary",
    "fantasy",
    "fiction",
    "literary fiction",
    "novels",
    "science fiction",
    "science fiction (dystopia)"
  ],
  "inventory": [
    {
      "status": "maintenance",
      "stock_id": "5802_1"
    }
  ],
  "metrics": {
    "rating_votes": 43689,
    "score": 3.41
  },
  "pages": 1368,
  "title": "The Leftovers",
  "url": "https://www.goodreads.com/book/show/10762469-the-leftovers",
  "year_published": 2011
}
