{
    "author": "China Miéville",
    "base_id": "5906",
    "description": "When a murdered woman is found in the city of Beszel, somewhere at the edge of Europe, it looks to be a routine case for Inspector Tyador Borlú of the Extreme Crime Squad. But as he investigates, the evidence points to conspiracies far stranger and more deadly than anything he could have imagined.Borlú must travel from the decaying Beszel to the only metropolis on Earth as strange as his own. This is a border crossing like no other, a journey as psychic as it is physical, a shift in perception, a seeing of the unseen. His destination is Beszel’s equal, rival, and intimate neighbor, the rich and vibrant city of Ul Qoma. With Ul Qoman detective Qussim Dhatt, and struggling with his own transition, Borlú is enmeshed in a sordid underworld of rabid nationalists intent on destroying their neighboring city, and unificationists who dream of dissolving the two into one. As the detectives uncover the dead woman’s secrets, they begin to suspect a truth that could cost them and those they care about more than their lives. What stands against them are murderous powers in Beszel and in Ul Qoma: and, most terrifying of all, that which lies between these two cities.Casting shades of Kafka and Philip K. Dick, Raymond Chandler and 1984, The City & the City is a murder mystery taken to dazzling metaphysical and artistic heights.",
    "editions": [
        "english",
        "spanish"
    ],
    "genres": {
        "fantasy": 1834,
        "fantasy (urban fantasy)": 262,
        "fantasy (weird fiction)": 111,
        "fiction": 1409,
        "mystery": 950,
        "mystery (crime)": 404,
        "science fiction": 1081,
        "science fiction fantasy": 179,
        "speculative fiction": 204,
        "weird fiction (new weird)": 114
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_id": "5906_1"
        }
    ],
    "metrics": {
        "rating_votes": 57338,
        "score": 3.91
    },
    "pages": 471,
    "title": "The City & the City",
    "url": "https://www.goodreads.com/book/show/4703581-the-city-the-city",
    "year_published": 2009
}