{
    "author": "Sandra Newman",
    "base_id": "591",
    "description": "A work of rare literary brilliance and emotional power, The Heavens is a mesmerizing novel of love and time, of dreams and politics, that asks how we come to inhabit our world New York, late summer, 2000. A party in a spacious Manhattan apartment, hosted by a wealthy young activist. Dozens of idealistic twenty-somethings have impassioned conversations over takeout dumplings and champagne. The evening shines with the heady optimism of a progressive new millennium. A young man, Ben, meets a young woman, Kate—and they begin to fall in love.From their first meeting, Ben knows Kate is unworldly and fanciful, so at first he isn’t that concerned when she tells him about the recurring dream she’s had since childhood. In the dream, she’s transported to the past, where she lives a second life as Emilia, the mistress of a nobleman in Elizabethan England.But for Kate, the dream becomes increasingly real and compelling until it threatens to overwhelm her life. And soon she’s waking from it to find the world changed—pictures on her wall she doesn’t recognize, new buildings in the neighborhood that have sprung up overnight. As she tries to make sense of what’s happening, Ben worries the woman he’s fallen in love with is losing her grip on reality.Transporting the reader between a richly detailed past and a frighteningly possible future, The Heavens is a powerful reminder of the consequences of our actions, a poignant testament to how the people we love are destined to change, and a masterful exploration of the power of dreams.",
    "editions": [
        "english"
    ],
    "genres": {
        "adult fiction": 13,
        "contemporary": 18,
        "fantasy": 45,
        "fiction": 181,
        "historical": 25,
        "historical (historical fiction)": 89,
        "literary fiction": 16,
        "magical realism": 15,
        "science fiction": 35,
        "science fiction (time travel)": 58
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_id": "591_1"
        },
        {
            "status": "on_loan",
            "stock_id": "591_2"
        },
        {
            "status": "available",
            "stock_id": "591_3"
        },
        {
            "status": "on_loan",
            "stock_id": "591_4"
        },
        {
            "status": "maintenance",
            "stock_id": "591_5"
        },
        {
            "status": "available",
            "stock_id": "591_6"
        }
    ],
    "metrics": {
        "rating_votes": 3495,
        "score": 3.35
    },
    "pages": 1295,
    "title": "The Heavens",
    "url": "https://www.goodreads.com/book/show/36642622-the-heavens",
    "year_published": 2019
}