{
  "author": "Sean Ferrell",
  "id": "593",
  "description": "Say you're a time traveler and you've already toured the entirety of human history. After a while, the outside world might lose a little of its luster. That's why this time traveler celebrates his birthday partying with himself. Every year, he travels to an abandoned hotel in New York City in 2071, the hundredth anniversary of his birth, and drinks twelve-year-old Scotch (lots of it) with all the other versions of who he has been and who he will be. Sure, the party is the same year after year, but at least it's one party where he can really, well, be himself.The year he turns 39, though, the party takes a stressful turn for the worse. Before he even makes it into the grand ballroom for a drink he encounters the body of his forty-year-old self, dead of a gunshot wound to the head. As the older versions of himself at the party point out, the onus is on him to figure out what went wrong--he has one year to stop himself from being murdered, or they're all goners. As he follows clues that he may or may not have willingly left for himself, he discovers rampant paranoia and suspicion among his younger selves, and a frightening conspiracy among the Elders. Most complicated of all is a haunting woman possibly named Lily who turns up at the party this year, the first person besides himself he's ever seen at the party. For the first time, he has something to lose. Here's hoping he can save some version of his own life.",
  "editions": [
    "english"
  ],
  "genres": [
    "adult fiction",
    "audiobook",
    "fantasy",
    "fiction",
    "mystery",
    "mystery (crime)",
    "novels",
    "science fiction",
    "science fiction (time travel)",
    "science fiction fantasy"
  ],
  "inventory": [
    {
      "status": "maintenance",
      "stock_id": "593_1"
    },
    {
      "status": "on_loan",
      "stock_id": "593_2"
    },
    {
      "status": "on_loan",
      "stock_id": "593_3"
    }
  ],
  "metrics": {
    "rating_votes": 2713,
    "score": 3.13
  },
  "pages": 441,
  "title": "Man in the Empty Suit",
  "url": "https://www.goodreads.com/book/show/13531802-man-in-the-empty-suit",
  "year_published": 2013
}
