{
    "author": "Kiki Burrelli",
    "base_id": 60,
    "description": "All his life, Loshka has been trained to be one thing, a pleasure slave. Led by a higher calling, he was taught the path to eternal glory was paved with obedience. His will is not important, not when compared to the will of his future master.But his faith is tested when Loshka is given to a brutal alien master who enjoys Loshka’s screams of pain more than his pleasure. As Loshka resigns himself to a short life with the cruel monster, he is kidnapped by a group of warriors.Malik and his warrior family are searching the forsaken lands for a missing boy when they find Loshka. Malik never expected his mate would be an alien man who is as soft as he is vulnerable. He doesn’t have the hard scales or sharp claws that Malik and his kind use to survive daily in the harsh desert landscape.Loshka is not just afraid, but completely unaware of what it means to belong to another, not as an object, but as a mate. It takes every ounce of Malik’s patience to convince Loshka that he deserves more than the life handed to him.But just as Loshka learns that with love, a future and a family are not impossible, his past returns to drag him back into a life of forced servitude. The fated mates have already been through so much, can they survive one more threat to their bond?Malik is the first book in The Kif Warriors, an alien mpreg series. This is the first co-write between Crista and Kiki. They’ve joined forces to bring you all the humor, magic, steam and action that you enjoy!",
    "editions": [
        "None"
    ],
    "genres": {
        "action": 2,
        "aliens": 20,
        "fantasy": 4,
        "gay": 4,
        "lgbt": 7,
        "male male romance": 21,
        "omegaverse": 2,
        "romance": 15,
        "science fiction": 14,
        "science fiction romance": 2
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_id": "60_1"
        },
        {
            "status": "on_loan",
            "stock_id": "60_2"
        },
        {
            "status": "on_loan",
            "stock_id": "60_3"
        },
        {
            "status": "on_loan",
            "stock_id": "60_4"
        },
        {
            "status": "maintenance",
            "stock_id": "60_5"
        },
        {
            "status": "on_loan",
            "stock_id": "60_6"
        },
        {
            "status": "on_loan",
            "stock_id": "60_7"
        },
        {
            "status": "on_loan",
            "stock_id": "60_8"
        },
        {
            "status": "maintenance",
            "stock_id": "60_9"
        }
    ],
    "metrics": {
        "rating_votes": 628,
        "score": 3.82
    },
    "pages": 1359,
    "title": "Malik",
    "url": "https://www.goodreads.com/book/show/52666889-malik",
    "year_published": 2019
}