{
    "author": "Lee Bacon",
    "id": "603",
    "description": "Listening Length: 3 hours and 42 minutesFugitive. Criminal. Robot.Eve looks like an ordinary 12-year-old girl, but there’s nothing ordinary about her. She has no last name. No parents or guardian. She’s on the run from a dangerous and secretive organization that will stop at nothing to track her down. And most astonishing of all: She’s a robot, a product of Eden Labratories. When she discovers the truth, she realizes everything she thought she knew about herself is a lie. Eve manages to escape, fleeing the lab, the only home she’s ever known. After being arrested for shoplifting, Eve is interviewed by Petra Amis from Child Welfare Services. Her incredible story unfolds during the interrogation, with flashbacks to her life inside Eden Laboratories, which has a dark secret. Exploring a range of topics that drive our society and our lives - topics such as artificial intelligence and human nature - Interview with the Robot is a story told by a startlingly original protagonist, a story that explores the vast potential of technology and the deep complexities of humanity.",
    "editions": [
        "english",
        "spanish"
    ],
    "genres": {
        "audiobook": 82,
        "childrens": 14,
        "childrens (middle grade)": 31,
        "fantasy": 19,
        "fiction": 59,
        "novella": 8,
        "science fiction": 95,
        "science fiction (robots)": 10,
        "short stories": 6,
        "young adult": 61
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "603_1"
        },
        {
            "status": "available",
            "stock_id": "603_2"
        },
        {
            "status": "on_loan",
            "stock_id": "603_3"
        },
        {
            "status": "available",
            "stock_id": "603_4"
        },
        {
            "status": "on_loan",
            "stock_id": "603_5"
        },
        {
            "status": "on_loan",
            "stock_id": "603_6"
        }
    ],
    "metrics": {
        "rating_votes": 3826,
        "score": 3.87
    },
    "pages": 505,
    "title": "Interview with the Robot",
    "url": "https://www.goodreads.com/book/show/50031773-interview-with-the-robot",
    "year_published": 2020
}