{
    "author": "Susanna Clarke",
    "id": "6100",
    "description": "Piranesi's house is no ordinary building: its rooms are infinite, its corridors endless, its walls are lined with thousands upon thousands of statues, each one different from all the others. Within the labyrinth of halls an ocean is imprisoned; waves thunder up staircases, rooms are flooded in an instant. But Piranesi is not afraid; he understands the tides as he understands the pattern of the labyrinth itself. He lives to explore the house.There is one other person in the house—a man called The Other, who visits Piranesi twice a week and asks for help with research into A Great and Secret Knowledge. But as Piranesi explores, evidence emerges of another person, and a terrible truth begins to unravel, revealing a world beyond the one Piranesi has always known.For readers of Neil Gaiman's The Ocean at the End of the Lane and fans of Madeline Miller's Circe, Piranesi introduces an astonishing new world, an infinite labyrinth, full of startling images and surreal beauty, haunted by the tides and the clouds.From the New York Times bestselling author of Jonathan Strange & Mr Norrell, an intoxicating, hypnotic new novel set in a dreamlike alternative reality.",
    "editions": [
        "english"
    ],
    "genres": {
        "adult": 180,
        "fantasy": 2567,
        "fantasy (mythology)": 145,
        "fiction": 945,
        "literary fiction": 85,
        "magical realism": 173,
        "mystery": 326,
        "novels": 64,
        "science fiction": 88,
        "science fiction fantasy": 71
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "6100_1"
        },
        {
            "status": "available",
            "stock_id": "6100_2"
        },
        {
            "status": "maintenance",
            "stock_id": "6100_3"
        },
        {
            "status": "available",
            "stock_id": "6100_4"
        },
        {
            "status": "maintenance",
            "stock_id": "6100_5"
        }
    ],
    "metrics": {
        "rating_votes": 30999,
        "score": 4.34
    },
    "pages": 963,
    "title": "Piranesi",
    "url": "https://www.goodreads.com/book/show/50202953-piranesi",
    "year_published": 2020
}