{
    "author_name": "Jordan L. Hawk",
    "base_id": 637,
    "book_description": "Introverted scholar Percival Endicott Whyborne wants nothing more than to live quietly with his lover, ex-Pinkerton detective Griffin Flaherty. Unfortunately, Whyborne's railroad tycoon father has other ideas, namely hiring Griffin to investigate mysterious events at a coal mine.Whyborne, Griffin, and their friend Christine travel to Threshold Mountain, a place of dark legend even before the mine burrowed into its heart. A contingent of Pinkertons-including Griffin's ex-lover Elliot-already guard the mine. But Griffin knows better than anyone just how unprepared the detectives are to face the otherworldly forces threatening them.Soon, Whyborne and Griffin are on the trail of mysterious disappearances, deadly accidents, and whispered secrets. Is Elliot an ally, or does he only want to rekindle his relationship with Griffin? And if so, how can Whyborne possibly hope to compete with the stunningly handsome Pinkerton-especially when Griffin is hiding secrets about his past?For in a town where friends become enemies and horror lurks behind a human mask, Whyborne can't afford to trust anything-including his own heart.",
    "book_title": "Threshold",
    "editions": [
        "English"
    ],
    "genres": {
        "fantasy": 248,
        "historical": 296,
        "historical fiction": 98,
        "horror": 89,
        "lgbt": 81,
        "magic": 85,
        "male male romance": 270,
        "mystery": 151,
        "paranormal": 237,
        "romance": 217
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_number": "637_1"
        },
        {
            "status": "maintenance",
            "stock_number": "637_2"
        },
        {
            "status": "on_loan",
            "stock_number": "637_3"
        },
        {
            "status": "on_loan",
            "stock_number": "637_4"
        },
        {
            "status": "on_loan",
            "stock_number": "637_5"
        }
    ],
    "metrics": {
        "rating_votes": 4693,
        "score": 4.13
    },
    "original_book_title": "Threshold",
    "pages": 892,
    "url": "https://www.goodreads.com/book/show/17840306-threshold",
    "year_published": 2013
}