{
  "author": "Christopher Priest",
  "id": "643",
  "description": "The city is winched along tracks through a devastated land full of hostile tribes. Rails must be freshly laid ahead of the city & carefully removed in its wake. Rivers & mountains present nearly insurmountable challenges to the ingenuity of the city's engineers. But if the city does not move, it will fall farther & farther behind the optimum & into the crushing gravitational field that has transformed life on Earth. The only alternative to progress is death. The secret directorate that governs the city makes sure that its inhabitants know nothing of this. Raised in common in creches, nurtured on synthetic food, prevented above all from venturing outside the closed circuit of the city, they're carefully sheltered from the dire necessities that have come to define human existence. Yet the city is in crisis. People are growing restive. The population is dwindling. The rulers know that, for all their efforts, slowly but surely the city is slipping ever farther behind the optimum. Helward Mann is a member of the city's elite. Better than anyone, he knows how tenuous is the city's continued existence. But the world he's about to discover is infinitely stranger than the strange world he believes he knows so well.",
  "editions": [
    "english",
    "spanish",
    "french"
  ],
  "genres": [
    "apocalyptic (post apocalyptic)",
    "classics",
    "european literature (british literature)",
    "fantasy",
    "fiction",
    "novels",
    "science fiction",
    "science fiction (dystopia)",
    "science fiction fantasy",
    "speculative fiction"
  ],
  "inventory": [
    {
      "status": "maintenance",
      "stock_id": "643_1"
    },
    {
      "status": "available",
      "stock_id": "643_2"
    },
    {
      "status": "maintenance",
      "stock_id": "643_3"
    }
  ],
  "metrics": {
    "rating_votes": 7071,
    "score": 3.91
  },
  "pages": 1307,
  "title": "The Inverted World",
  "url": "https://www.goodreads.com/book/show/142181.The_Inverted_World",
  "year_published": 1974
}
