{
    "author": "Wesley Chu",
    "base_id": "648",
    "description": "Convicted criminal James Griffin-Mars is no one’s hero. In his time, Earth is a toxic, abandoned world and humans have fled into the outer solar system to survive, eking out a fragile, doomed existence among the other planets and their moons. Those responsible for delaying humanity’s demise believe time travel holds the key, and they have identified James, troubled though he is, as one of a select and expendable few ideally suited for the most dangerous job in history. James is a chronman, undertaking missions into Earth's past to recover resources and treasure without altering the timeline. The laws governing use of time travel are absolute; break any one of them and, one way or another, your life is over. Most chronmen never reach old age; the stress of each jump through time, compounded by the risk to themselves and to the future, means that many chronmen rapidly reach their breaking point, and James Griffin-Mars is nearing his.On a final mission that is to secure his retirement, James meets Elise Kim, an intriguing scientist from a previous century, who is fated to die during the destruction of an oceanic rig. Against his training and his common sense, and in violation of the chronmen’s highest law, James brings Elise back to the future with him, saving her life, but turning them both into fugitives. Remaining free means losing themselves in the wild and poisonous wastes of Earth, somehow finding allies, and perhaps discovering what hope may yet remain for humanity's home world.",
    "editions": [
        "english"
    ],
    "genres": {
        "adult": 20,
        "audiobook": 14,
        "fantasy": 42,
        "fiction": 107,
        "novels": 12,
        "science fiction": 357,
        "science fiction (dystopia)": 50,
        "science fiction (time travel)": 187,
        "science fiction fantasy": 25,
        "speculative fiction": 12
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "648_1"
        },
        {
            "status": "maintenance",
            "stock_id": "648_2"
        },
        {
            "status": "maintenance",
            "stock_id": "648_3"
        }
    ],
    "metrics": {
        "rating_votes": 4138,
        "score": 3.68
    },
    "pages": 622,
    "title": "Time Salvager",
    "url": "https://www.goodreads.com/book/show/23168818-time-salvager",
    "year_published": 2015
}