{
  "author": "Rachel Heng",
  "id": "669",
  "description": "In this debut set in near future NYC—where lives last 300 years and the pursuit of immortality is all-consuming—Lea must choose between her estranged father and her chance to live forever.Lea Kirino is a “Lifer,” which means that a roll of the genetic dice has given her the potential to live forever—if she does everything right. And Lea is an overachiever. She’s a successful trader on the New York exchange—where instead of stocks, human organs are now bought and sold—she has a beautiful apartment, and a fiancé who rivals her in genetic perfection. And with the right balance of HealthTech™, rigorous juicing, and low-impact exercise, she might never die. But Lea’s perfect life is turned upside down when she spots her estranged father on a crowded sidewalk. His return marks the beginning of her downfall as she is drawn into his mysterious world of the Suicide Club, a network of powerful individuals and rebels who reject society’s pursuit of immortality, and instead chose to live—and die—on their own terms. In this future world, death is not only taboo; it’s also highly illegal. Soon Lea is forced to choose between a sanitized immortal existence and a short, bittersweet time with a man she has never really known, but who is the only family she has left in the world.Advance Praise for Suicide ClubBustle: 15 New Books You Need To KnowBitch Media: 11 Books Feminists Should ReadBook Riot: 10 July New Releases to Put on Hold at the Library Right NowNylon: Great Books To Read This SummerThe Rumpus: What to Read When You've Made it Halfway Through 2018Gizmodo: New Scifi and Fantasy Books to Add to Your Reading List in JulyThe Millions: Most Anticipated\"Fans of modern speculative fiction and readers who love stories that warn us to be careful what we wish for will be enthralled by Heng's highly imaginative debut, which deftly asks 'What does it really mean to be alive?'\" - Library Journal (starred)\"Refreshingly original\" - Book Riot\"Heng expertly threads a ribbon of dread through her glittering vistas and gleaming characters...[This is] a complicated and promising debut that spoofs the current health culture craze even as it anticipates its appalling culmination.\" - Kirkus\"Audacious... beautifully paced... How can such a young writer know all these things? Rachel Heng’s first novel is as keen as a sharpened blade. Suicide Club is on the money about where our current obsessions are leading us and yet she makes us care about her characters in deep and old-fashioned ways. It reminded me again and again of Orwell and Huxley. I have the feeling that this is the beginning of a long and illustrious career.\" - James Magnuson, author of Famous Writers I Have Known\"“In exquisitely crafted prose, Rachel Heng gives us a startling look at a version of the world that seems simultaneously wild and plausible. Heng is a bold new talent and a writer to watch.” - Liz Moore, author of Heft and The Unseen World",
  "editions": [
    "english",
    "spanish",
    "french"
  ],
  "genres": [
    "adult",
    "adult fiction",
    "audiobook",
    "contemporary",
    "fantasy",
    "fiction",
    "science fiction",
    "science fiction (dystopia)",
    "science fiction fantasy",
    "speculative fiction"
  ],
  "inventory": [
    {
      "status": "on_loan",
      "stock_id": "669_1"
    },
    {
      "status": "maintenance",
      "stock_id": "669_2"
    },
    {
      "status": "on_loan",
      "stock_id": "669_3"
    },
    {
      "status": "maintenance",
      "stock_id": "669_4"
    },
    {
      "status": "available",
      "stock_id": "669_5"
    }
  ],
  "metrics": {
    "rating_votes": 3427,
    "score": 3.24
  },
  "pages": 1217,
  "title": "Suicide Club",
  "url": "https://www.goodreads.com/book/show/36434556-suicide-club",
  "year_published": 2018
}
