{
    "author": "Mark  Lawrence",
    "base_id": "6831",
    "description": "Before the thorns taught me their sharp lessons and bled weakness from me I had but one brother, and I loved him well. But those days are gone and what is left of them lies in my mother's tomb. Now I have many brothers, quick with knife and sword, and as evil as you please. We ride this broken empire and loot its corpse. They say these are violent times, the end of days when the dead roam and monsters haunt the night. All that's true enough, but there's something worse out there, in the dark. Much worse.From being a privileged royal child, raised by a loving mother, Jorg Ancrath has become the Prince of Thorns, a charming, immoral boy leading a grim band of outlaws in a series of raids and atrocities. The world is in chaos: violence is rife, nightmares everywhere. Jorg has the ability to master the living and the dead, but there is still one thing that puts a chill in him. Returning to his father's castle Jorg must confront horrors from his childhood and carve himself a future with all hands turned against him.Mark Lawrence's debut novel tells a tale of blood and treachery, magic and brotherhood and paints a compelling and brutal, and sometimes beautiful, picture of an exceptional boy on his journey toward manhood and the throne.",
    "editions": [
        "english"
    ],
    "genres": {
        "adult": 172,
        "apocalyptic (post apocalyptic)": 118,
        "dark": 163,
        "fantasy": 6584,
        "fantasy (dark fantasy)": 351,
        "fantasy (epic fantasy)": 310,
        "fantasy (high fantasy)": 261,
        "fiction": 420,
        "science fiction": 111,
        "young adult": 196
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "6831_1"
        },
        {
            "status": "available",
            "stock_id": "6831_2"
        },
        {
            "status": "available",
            "stock_id": "6831_3"
        },
        {
            "status": "available",
            "stock_id": "6831_4"
        },
        {
            "status": "maintenance",
            "stock_id": "6831_5"
        },
        {
            "status": "maintenance",
            "stock_id": "6831_6"
        },
        {
            "status": "available",
            "stock_id": "6831_7"
        }
    ],
    "metrics": {
        "rating_votes": 98742,
        "score": 3.85
    },
    "pages": 679,
    "title": "Prince of Thorns",
    "url": "https://www.goodreads.com/book/show/9579634-prince-of-thorns",
    "year_published": 2011
}