{
    "author": "Orson Scott Card",
    "id": "696",
    "description": "The story of The First Formic War continues in Earth Awakens.Nearly 100 years before the events of Orson Scott Card's bestselling novel Ender's Game, humans were just beginning to step off Earth and out into the Solar System. A thin web of ships in both asteroid belts; a few stations; a corporate settlement on Luna. No one had seen any sign of other space-faring races; everyone expected that First Contact, if it came, would happen in the future, in the empty reaches between the stars. Then a young navigator on a distant mining ship saw something moving too fast, heading directly for our sun.When the alien ship screamed through the solar system, it disrupted communications between the far-flung human mining ships and supply stations, and between them and Earth. So Earth and Luna were unaware that they had been invaded until the ship pulled into Earth orbit, and began landing terra-forming crews in China. Politics and pride slowed the response on Earth, and on Luna, corporate power struggles seemed more urgent than distant deaths. But there are a few men and women who see that if Earth doesn't wake up and pull together, the planet could be lost.",
    "editions": [
        "english",
        "spanish",
        "french"
    ],
    "genres": {
        "audiobook": 34,
        "fantasy": 18,
        "fiction": 125,
        "science fiction": 369,
        "science fiction (aliens)": 23,
        "science fiction fantasy": 28,
        "space": 18,
        "space (space opera)": 15,
        "war": 15,
        "young adult": 21
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_id": "696_1"
        },
        {
            "status": "available",
            "stock_id": "696_2"
        },
        {
            "status": "available",
            "stock_id": "696_3"
        },
        {
            "status": "maintenance",
            "stock_id": "696_4"
        },
        {
            "status": "maintenance",
            "stock_id": "696_5"
        },
        {
            "status": "available",
            "stock_id": "696_6"
        },
        {
            "status": "maintenance",
            "stock_id": "696_7"
        },
        {
            "status": "maintenance",
            "stock_id": "696_8"
        }
    ],
    "metrics": {
        "rating_votes": 10825,
        "score": 4.09
    },
    "pages": 1044,
    "title": "Earth Awakens",
    "url": "https://www.goodreads.com/book/show/18490707-earth-awakens",
    "year_published": 2014
}