{
  "author": "Isaac Asimov",
  "id": "6968",
  "description": "Isaac Asimov's I, Robot launches readers on an adventure into a not-so-distant future where man and machine , struggle to redefinelife, love, and consciousness—and where the stakes are nothing less than survival. Filled with unforgettable characters, mind-bending speculation, and nonstop action, I, Robot is a powerful reading experience from one of the master storytellers of our time. I, ROBOT They mustn't harm a human being, they must obey hitman orders, and they must protect their own existence...but only so long as that doesn't violate rules one and two. With these Three Laws of Robotics, humanity embarked on perhaps its greatest adventure: the invention of the first positronic man. It was a bold new era of evolution that would open up enormous possibilities—and unforeseen risks. For the scientists who invented the earliest robots weren't content that their creations should ' remain programmed helpers, companions, and semisentient worker-machines. And soon the robots themselves; aware of their own intelligence, power, and humanity, aren't either. As humans and robots struggle to survive together—and sometimes against each other—on earth and in space, the future of both hangs in the balance. Human men and women confront robots gone mad, telepathic robots, robot politicians, and vast robotic intelligences that may already secretly control the world. And both are asking the same questions: What is human? And is humanity obsolete? In l, Robot Isaac Asimov changes forever our perception of robots, and human beings and updates the timeless myth of man's dream to play god. with all its rewards—and terrors.--front flap",
  "editions": [
    "english"
  ],
  "genres": [
    "audiobook",
    "classics",
    "fantasy",
    "fiction",
    "novels",
    "science fiction",
    "science fiction (robots)",
    "science fiction fantasy",
    "short stories",
    "speculative fiction"
  ],
  "inventory": [
    {
      "status": "on_loan",
      "stock_id": "6968_1"
    },
    {
      "status": "on_loan",
      "stock_id": "6968_2"
    },
    {
      "status": "on_loan",
      "stock_id": "6968_3"
    },
    {
      "status": "available",
      "stock_id": "6968_4"
    },
    {
      "status": "on_loan",
      "stock_id": "6968_5"
    },
    {
      "status": "on_loan",
      "stock_id": "6968_6"
    }
  ],
  "metrics": {
    "rating_votes": 283028,
    "score": 4.2
  },
  "pages": 479,
  "title": "I, Robot",
  "url": "https://www.goodreads.com/book/show/41804.I_Robot",
  "year_published": 1950
}
