{
  "author": "S.G. Redling",
  "id": "699",
  "description": "When Feno Chemical spilled an experimental pesticide in rural Iowa, scores of people died. Those who survived contamination were herded into a US Army medically maintained quarantine and cut off from the world. Dosed with powerful drugs to combat the poison, their bodies give off a sickly sweet smell and the containment zone becomes known simply as Flowertown. Seven years later, the infrastructure is crumbling, supplies are dwindling, and nobody is getting clean. Ellie Cauley doesn’t care anymore. Despite her paranoid best friend's insistence that conspiracies abound, she focuses on three things: staying high, hooking up with the Army sergeant she's not supposed to be fraternizing with and, most importantly, trying to ignore her ever-simmering rage. But when a series of deadly events rocks the compound, Ellie suspects her friend is right—something dangerous is going down in Flowertown and all signs point to a twisted plan of greed and abuse. She and the other residents of Flowertown have been betrayed by someone with a deadly agenda and their plan is just getting started. Time is running out. With nobody to trust and nowhere to go, Ellie decides to fight with the last weapon she has—her rage.Flowertown is a high-intensity conspiracy thriller that brings the worst-case scenario vividly to life and will keep readers riveted until the final haunting page.",
  "editions": [
    "english",
    "spanish"
  ],
  "genres": [
    "apocalyptic (post apocalyptic)",
    "fiction",
    "horror",
    "mystery",
    "science fiction",
    "science fiction (apocalyptic)",
    "science fiction (dystopia)",
    "suspense",
    "thriller",
    "young adult"
  ],
  "inventory": [
    {
      "status": "on_loan",
      "stock_id": "699_1"
    },
    {
      "status": "available",
      "stock_id": "699_2"
    }
  ],
  "metrics": {
    "rating_votes": 7482,
    "score": 3.79
  },
  "pages": 467,
  "title": "Flowertown",
  "url": "https://www.goodreads.com/book/show/13031388-flowertown",
  "year_published": 2012
}
