{
  "author": "John  Stephens",
  "id": "704",
  "description": "After the tumultuous events of last winter, Kate, Michael, and Emma long to continue the hunt for their missing parents. But they themselves are now in great danger, and so the wizard Stanislaus Pym hides the children at the Edgar Allan Poe Home for Hopeless and Incorrigible Orphans. There, he says, they will be safe. How wrong he is.  The children are soon discovered by their enemies, and a frantic chase sends Kate a hundred years into the past, to a perilous, enchanted New York City. Searching for a way back to her brother and sister, she meets a mysterious boy whose fate is intricately—and dangerously—tied to her own. Meanwhile, Michael and Emma have set off to find the second of the Books of Beginning. A series of clues leads them into a hidden world where they must brave harsh polar storms, track down an ancient order of warriors, and confront terrible monsters. Will Michael and Emma find the legendary book of fire—and master its powers—before Kate is lost to them forever?  Exciting, suspenseful, and brimming with humor and heart, the next installment of the bestselling Books of Beginning trilogy will lead Kate, Michael, and Emma closer to their family—and to the magic that could save, or destroy, them all.",
  "editions": [
    "english",
    "spanish",
    "french"
  ],
  "genres": [
    "adventure",
    "audiobook",
    "childrens",
    "childrens (juvenile)",
    "childrens (middle grade)",
    "fantasy",
    "fantasy (magic)",
    "fiction",
    "science fiction (time travel)",
    "young adult"
  ],
  "inventory": [
    {
      "status": "maintenance",
      "stock_id": "704_1"
    },
    {
      "status": "maintenance",
      "stock_id": "704_2"
    },
    {
      "status": "maintenance",
      "stock_id": "704_3"
    },
    {
      "status": "available",
      "stock_id": "704_4"
    },
    {
      "status": "available",
      "stock_id": "704_5"
    },
    {
      "status": "available",
      "stock_id": "704_6"
    },
    {
      "status": "on_loan",
      "stock_id": "704_7"
    },
    {
      "status": "available",
      "stock_id": "704_8"
    }
  ],
  "metrics": {
    "rating_votes": 8110,
    "score": 4.23
  },
  "pages": 1139,
  "title": "The Fire Chronicle",
  "url": "https://www.goodreads.com/book/show/13262797-the-fire-chronicle",
  "year_published": 2012
}
