{
    "author": "Jennifer L. Armentrout",
    "base_id": 710,
    "description": "Now available together for the first time, don't miss Obsidian and Onyx, the first two books in Jennifer L. Armentrout's bestselling Lux series. Also includes bonus content exclusive to the print edition! \"A thrilling ride from start to finish,\" says RT Book Reviews.ObsidianThere’s an alien next door. And with his looming height and eerie green eyes, he’s hot… until he opens his mouth. He’s infuriating. Arrogant. Stab-worthy. But when a stranger attacks me and Daemon literally freezes time with a wave of his hand, he marks me. Turns out he has a galaxy of enemies wanting to steal his abilities and the only way I’m getting out of this alive is by sticking close to him until my alien mojo fades. If I don’t kill him first, that is.OnyxDaemon’s determined to prove what he feels for me is more than a product of our bizarro connection. So I’ve sworn him off, even though he’s running more hot than cold these days. But we’ve got bigger problems. I’ve seen someone who shouldn’t be alive. And I have to tell Daemon, even though I know he’s never going to stop searching until he gets the truth. What happened to his brother? Who betrayed him? And what does the DOD want from them—from me?",
    "editions": [
        "English"
    ],
    "genres": {
        "aliens": 70,
        "fantasy": 91,
        "fiction": 17,
        "paranormal": 92,
        "paranormal romance": 21,
        "romance": 91,
        "science fiction": 61,
        "supernatural": 15,
        "young adult": 140,
        "young adult fantasy": 10
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_id": "710_1"
        },
        {
            "status": "available",
            "stock_id": "710_2"
        },
        {
            "status": "available",
            "stock_id": "710_3"
        },
        {
            "status": "available",
            "stock_id": "710_4"
        },
        {
            "status": "maintenance",
            "stock_id": "710_5"
        },
        {
            "status": "maintenance",
            "stock_id": "710_6"
        },
        {
            "status": "on_loan",
            "stock_id": "710_7"
        }
    ],
    "metrics": {
        "rating_votes": 6249,
        "score": 4.57
    },
    "pages": 359,
    "title": "Beginnings: Obsidian & Onyx",
    "url": "https://www.goodreads.com/book/show/19081403-beginnings",
    "year_published": 2014
}