{
    "author_name": "Robert A. Heinlein",
    "base_id": 715,
    "book_description": "First came the news that a flying saucer had landed in Iowa. Then came the announcement that the whole thing was a hoax. End of story. Case closed.Except that two agents of the most secret intelligence agency in the U.S. government were on the scene and disappeared without reporting back. Then four more follow up agents also disappeared. So the head of the agency and his two top agents went in and managed to get out with their discovery: an invasion is underway by slug-like aliens who can touch a human and completely control his or her mind. What the humans know, they know. What the slugs want, no matter what, the human will do. And most of Iowa is already under their control.Sam Cavanaugh was one of the agents who discovered the truth. Unfortunately, that was just before he was taken over by one of the aliens and began working for the invaders, with no will of his own. And he has just learned that a high official in the Treasury Department is now under control of the aliens. Since the Treasury Department includes the Secret Service, which safeguards the President of the United States, control of the entire nation is near at hand.",
    "book_title": "The Puppet Masters",
    "editions": [
        "English"
    ],
    "genres": {
        "adventure": 16,
        "aliens": 28,
        "audiobook": 24,
        "classics": 44,
        "fantasy": 25,
        "fiction": 229,
        "horror": 40,
        "science fiction": 976,
        "science fiction fantasy": 54,
        "speculative fiction": 23
    },
    "inventory": [
        {
            "status": "available",
            "stock_number": "715_1"
        },
        {
            "status": "on_loan",
            "stock_number": "715_2"
        },
        {
            "status": "available",
            "stock_number": "715_3"
        },
        {
            "status": "on_loan",
            "stock_number": "715_4"
        }
    ],
    "metrics": {
        "rating_votes": 30715,
        "score": 3.88
    },
    "original_book_title": "The Puppet Masters",
    "pages": 1318,
    "url": "https://www.goodreads.com/book/show/7171856-the-puppet-masters",
    "year_published": 1951
}