{
    "author": "Farah Naz Rishi",
    "base_id": 738,
    "description": "Seven days. Seven days. The Earth might end in seven days.When news stations start reporting that Earth has been contacted by a planet named Alma, the world is abuzz with rumors that the alien entity is giving mankind only few days to live before they hit the kill switch on civilization.For high school truant Jesse Hewitt, though, nothing has ever felt permanent. Not the guys he hooks up with. Not the jobs his underpaid mom works so hard to hold down. Life has dealt him one bad blow after another — so what does it matter if it all ends now? Cate Collins, on the other hand, is desperate to use this time to find the father she’s never met, the man she grew up hearing wild stories about, most of which she didn’t believe. And then there’s Adeem Khan. While coding and computer programming have always come easily to him, forgiveness doesn’t. He can’t seem to forgive his sister for leaving, even though it’s his last chance.With only seven days to face their truths and right their wrongs, Jesse, Cate, and Adeem’s paths collide even as their worlds are pulled apart.",
    "editions": [
        "English"
    ],
    "genres": {
        "aliens": 31,
        "audiobook": 23,
        "contemporary": 113,
        "dystopia": 18,
        "fantasy": 32,
        "fiction": 67,
        "lgbt": 176,
        "queer": 48,
        "science fiction": 247,
        "young adult": 270
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "738_1"
        },
        {
            "status": "maintenance",
            "stock_id": "738_2"
        },
        {
            "status": "on_loan",
            "stock_id": "738_3"
        },
        {
            "status": "maintenance",
            "stock_id": "738_4"
        },
        {
            "status": "available",
            "stock_id": "738_5"
        }
    ],
    "metrics": {
        "rating_votes": 2966,
        "score": 3.56
    },
    "pages": 1124,
    "title": "I Hope You Get This Message",
    "url": "https://www.goodreads.com/book/show/43699608-i-hope-you-get-this-message",
    "year_published": 2019
}