{
    "author": "Sherrilyn Kenyon",
    "base_id": 756,
    "description": "In a universe where assassins make the law, everyone lives in fear--except for Syn. Born of an illicit scandal that once rocked a dynasty, he always knew how to survive on the bloodthirsty streets. But that was then, and the future is now…Syn was raised as a tech-thief until his livelihood uncovered a truth that could end his life. He tried to destroy the evidence, and has been on the run ever since. Now trained as an assassin, he allows no one to threaten him. Ever. He is the darkness that swallows his enemies whole.Shahara Dagan is the best bounty hunter in the universe. When Syn comes back on the radar, she's the only one who can bring him to justice. There's only one problem: Syn is a close family friend who's helped out the Dagans countless times. But if she saves him, both of their lives will be on the line. Is Syn's protection worth the risk? The only hope Shahara has is to find the evidence he buried long ago. Now it's kill or be killed--and they, the predators, have just become the hunted…",
    "editions": [
        "English"
    ],
    "genres": {
        "adult": 59,
        "aliens": 65,
        "fantasy": 178,
        "futuristic": 60,
        "paranormal": 196,
        "paranormal romance": 275,
        "romance": 400,
        "science fiction": 218,
        "science fiction romance": 59,
        "urban fantasy": 47
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "756_1"
        },
        {
            "status": "available",
            "stock_id": "756_2"
        },
        {
            "status": "available",
            "stock_id": "756_3"
        },
        {
            "status": "on_loan",
            "stock_id": "756_4"
        }
    ],
    "metrics": {
        "rating_votes": 17342,
        "score": 4.34
    },
    "pages": 654,
    "title": "Born of Fire",
    "url": "https://www.goodreads.com/book/show/3246224-born-of-fire",
    "year_published": 1996
}