{
    "author": "Adam Sternbergh",
    "base_id": "769",
    "description": "Spademan used to be a garbage man. That was before the dirty bomb hit Times Square, before his wife was killed, and before the city became a bombed-out shell of its former self. Now he's a hitman.In a New York City split between those who are wealthy enough to \"tap into\" a sophisticated virtual reality for months at a time and those left to fend for themselves in the ravaged streets, Spademan chose the streets. His clients like that he doesn't ask questions, that he works quickly, and that he's handy with a box cutter. He finds that killing people for money is not that different from collecting trash, and the pay is better. His latest client hires him to kill the daughter of a powerful evangelist. Finding her is easy, but the job quickly gets complicated: his mark has a shocking secret and his client has an agenda far beyond a simple kill. Now Spademan must navigate the dual levels of his world-the gritty reality and the slick fantasy-to finish the job, to keep his conscience clean, and to stay alive.",
    "editions": [
        "english",
        "spanish"
    ],
    "genres": {
        "apocalyptic (post apocalyptic)": 27,
        "audiobook": 18,
        "fiction": 145,
        "mystery": 75,
        "mystery (crime)": 33,
        "mystery (noir)": 49,
        "science fiction": 150,
        "science fiction (dystopia)": 60,
        "thriller": 67,
        "thriller (mystery thriller)": 22
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_id": "769_1"
        },
        {
            "status": "available",
            "stock_id": "769_2"
        },
        {
            "status": "on_loan",
            "stock_id": "769_3"
        },
        {
            "status": "maintenance",
            "stock_id": "769_4"
        }
    ],
    "metrics": {
        "rating_votes": 5031,
        "score": 3.47
    },
    "pages": 448,
    "title": "Shovel Ready",
    "url": "https://www.goodreads.com/book/show/17834909-shovel-ready",
    "year_published": 2014
}