{
    "author": "Orson Scott Card",
    "id": "833",
    "description": "Features a new exclusive introduction read by author Orson Scott Card.From the author of Ender’s Game, the major motion picture!A complex fate. A deadly path. Book two in the New York Times bestselling series Publishers Weekly calls “an epic in the best sense.”When Rigg and his friends crossed the Wall between the only world they knew and a world they could not imagine, he hoped he was leading them to safety. But the dangers in this new wallfold are more difficult to see. Rigg, Umbo, and Param know that they cannot trust the expendable, Vadesh—a machine shaped like a human, created to deceive—but they are no longer certain that they can even trust one another. But they will have little choice. Because although Rigg can decipher the paths of the past, he can’t yet see the horror that lies ahead: A destructive force with deadly intentions is hurtling toward Garden. If Rigg, Umbo, and Param can’t work together to alter the past, there will be no future.The adventure, suspense, and time travel continue in this second installment in the critically acclaimed New York Times and Publishers Weekly bestselling Pathfinder series.",
    "editions": [
        "english"
    ],
    "genres": {
        "adventure": 15,
        "audiobook": 20,
        "fantasy": 270,
        "fiction": 79,
        "science fiction": 206,
        "science fiction (dystopia)": 13,
        "science fiction (time travel)": 33,
        "science fiction fantasy": 35,
        "young adult": 127,
        "young adult (teen)": 13
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "833_1"
        },
        {
            "status": "maintenance",
            "stock_id": "833_2"
        },
        {
            "status": "available",
            "stock_id": "833_3"
        },
        {
            "status": "maintenance",
            "stock_id": "833_4"
        },
        {
            "status": "available",
            "stock_id": "833_5"
        },
        {
            "status": "maintenance",
            "stock_id": "833_6"
        }
    ],
    "metrics": {
        "rating_votes": 10189,
        "score": 3.89
    },
    "pages": 943,
    "title": "Ruins",
    "url": "https://www.goodreads.com/book/show/10148930-ruins",
    "year_published": 2012
}