{
    "author": "Brandon Sanderson",
    "base_id": "8399",
    "description": "Three hundred years after the events of the Mistborn trilogy, Scadrial is now on the verge of modernity, with railroads to supplement the canals, electric lighting in the streets and the homes of the wealthy, and the first steel-framed skyscrapers racing for the clouds.Kelsier, Vin, Elend, Sazed, Spook, and the rest are now part of history—or religion. Yet even as science and technology are reaching new heights, the old magics of Allomancy and Feruchemy continue to play a role in this reborn world. Out in the frontier lands known as the Roughs, they are crucial tools for the brave men and women attempting to establish order and justice.One such is Waxillium Ladrian, a rare Twinborn who can Push on metals with his Allomancy and use Feruchemy to become lighter or heavier at will. After twenty years in the Roughs, Wax has been forced by family tragedy to return to the metropolis of Elendel. Now he must reluctantly put away his guns and assume the duties and dignity incumbent upon the head of a noble house. Or so he thinks, until he learns the hard way that the mansions and elegant tree-lined streets of the city can be even more dangerous than the dusty plains of the Roughs.",
    "editions": [
        "english",
        "spanish"
    ],
    "genres": {
        "adult": 202,
        "adventure": 177,
        "audiobook": 224,
        "fantasy": 7913,
        "fantasy (epic fantasy)": 326,
        "fantasy (high fantasy)": 294,
        "fantasy (magic)": 182,
        "fiction": 675,
        "science fiction (steampunk)": 534,
        "science fiction fantasy": 174
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "8399_1"
        },
        {
            "status": "on_loan",
            "stock_id": "8399_2"
        },
        {
            "status": "on_loan",
            "stock_id": "8399_3"
        },
        {
            "status": "on_loan",
            "stock_id": "8399_4"
        },
        {
            "status": "available",
            "stock_id": "8399_5"
        },
        {
            "status": "available",
            "stock_id": "8399_6"
        }
    ],
    "metrics": {
        "rating_votes": 143934,
        "score": 4.2
    },
    "pages": 303,
    "title": "The Alloy of Law",
    "url": "https://www.goodreads.com/book/show/10803121-the-alloy-of-law",
    "year_published": 2011
}