{
    "author_name": "Marissa Meyer",
    "base_id": 8451,
    "book_description": "The universe of the Lunar Chronicles holds stories—and secrets—that are wondrous, vicious, and romantic. How did Cinder first arrive in New Beijing? How did the brooding soldier Wolf transform from young man to killer? When did Princess Winter and the palace guard Jacin realize their destinies? With nine stories—five of which have never before been published—and an excerpt from Marissa Meyer’s novel, Heartless, about the Queen of Hearts from Alice in Wonderland, Stars Above is essential for fans of the bestselling and beloved Lunar Chronicles. CONTENTSThe Keeper: A prequel to the Lunar Chronicles, showing a young Scarlet and how Princess Selene came into the care of Michelle Benoit. Glitches: In this prequel to Cinder, we see the results of the plague play out, and the emotional toll it takes on Cinder. Something that may, or may not, be a glitch…. The Queen’s Army: In this prequel to Scarlet, we’re introduced to the army Queen Levana is building, and one soldier in particular who will do anything to keep from becoming the monster they want him to be. Carswell’s Guide to Being Lucky: Thirteen-year-old Carswell Thorne has big plans involving a Rampion spaceship and a no-return trip out of Los Angeles. After Sunshine Passes By: In this prequel to Cress, we see how a nine-year-old Cress ended up alone on a satellite, spying on Earth for Luna. The Princess and the Guard: In this prequel to Winter, we see a young Winter and Jacin playing a game called the Princess and the Guard… The Little Android: A retelling of Hans Christian Andersen’s “The Little Mermaid,” set in the world of The Lunar Chronicles. The Mechanic: In this prequel to Cinder, we see Kai and Cinder’s first meeting from Kai’s perspective. Something Old, Something New: In this epilogue to Winter, friends gather for the wedding of the century…",
    "book_title": "Stars Above",
    "editions": [
        "English"
    ],
    "genres": {
        "audiobook": 267,
        "dystopia": 385,
        "fairy tales": 303,
        "fantasy": 1877,
        "fiction": 312,
        "retellings": 636,
        "romance": 604,
        "science fiction": 1269,
        "short stories": 689,
        "young adult": 1928
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_number": "8451_1"
        },
        {
            "status": "maintenance",
            "stock_number": "8451_2"
        },
        {
            "status": "maintenance",
            "stock_number": "8451_3"
        },
        {
            "status": "maintenance",
            "stock_number": "8451_4"
        },
        {
            "status": "maintenance",
            "stock_number": "8451_5"
        },
        {
            "status": "maintenance",
            "stock_number": "8451_6"
        },
        {
            "status": "on_loan",
            "stock_number": "8451_7"
        }
    ],
    "metrics": {
        "rating_votes": 67873,
        "score": 4.19
    },
    "original_book_title": "Stars Above",
    "pages": 661,
    "url": "https://www.goodreads.com/book/show/25689074-stars-above",
    "year_published": 2016
}