{
  "author": "Kim Harrison",
  "id": "857",
  "description": "#1 New York Times bestselling author Kim Harrison returns to her beloved Hollows series with The Turn, the official prequel to the series that will introduce fans and readers to a whole new side of Rachel Morgan's world as they've never seen it before!Can science save us when all else fails? Trisk and her hated rival, Kalamack, have the same goal: save their species from extinction. Death comes in the guise of hope when a genetically modified tomato . Plague takes the world, giving the paranormal species an uncomfortable choice . Under accusations of scientific misconduct, Trisk and Kal flee across a plague torn United States to convince leaders of the major paranormal species to save their supposedly weaker kin, but not everyone thinks humanity should be saved. Trisk fights the prejudices of two societies to prove that not only does humanity have something to offer, but that long-accepted beliefs against women, dark magic, and humanity itself can turn to understanding; that when people are at their worst that the best show their true strength, and that love can hold the world together as a new balance is found.",
  "editions": [
    "english"
  ],
  "genres": [
    "fairies (fae)",
    "fantasy",
    "fantasy (magic)",
    "fantasy (paranormal)",
    "fantasy (supernatural)",
    "fantasy (urban fantasy)",
    "fiction",
    "paranormal (demons)",
    "paranormal (vampires)",
    "paranormal (witches)"
  ],
  "inventory": [
    {
      "status": "available",
      "stock_id": "857_1"
    },
    {
      "status": "available",
      "stock_id": "857_2"
    },
    {
      "status": "on_loan",
      "stock_id": "857_3"
    },
    {
      "status": "maintenance",
      "stock_id": "857_4"
    },
    {
      "status": "maintenance",
      "stock_id": "857_5"
    },
    {
      "status": "maintenance",
      "stock_id": "857_6"
    }
  ],
  "metrics": {
    "rating_votes": 6504,
    "score": 4.16
  },
  "pages": 683,
  "title": "The Turn: The Hollows Begins with Death",
  "url": "https://www.goodreads.com/book/show/31180840-the-turn",
  "year_published": 2017
}
