{
    "author": "James K. Decker",
    "id": "87",
    "description": "Plagued by overpopulation, disease, and starvation, humanity was headed for extinction—until an alien race called the haan arrived. And then the real trouble began. It’s been a rough day for Sam Shao. As part of a program that requires humans to act as surrogates to haan infants, Sam has been genetically enhanced to bond with them. So when three soldiers invade her apartment and arrest her guardian for smuggling a dangerous weapon into the country, Sam can sense that something isn’t right. One of his abductors is a haan masquerading as a human, and the supposedly fragile haan seems to be anything but. Racing through the city slums, trying to stay one step ahead of the mysterious haan soldier, Sam tries to find the man who, in her twenty years, has been the only father she’s ever known. Could he truly have done what he is accused of? Or did he witness something both human and haan would kill to keep hidden? The only thing certain is that the weapon is real—and lost now somewhere in a city of millions. Fighting the clock, Sam finds an ally in Nix, a haan envoy devoted to coexisting with humans, or so it seems. But what she really needs are answers. Fast. Or else everything she knows—and everyone she loves—will burn.",
    "editions": [
        "english",
        "spanish",
        "french"
    ],
    "genres": {
        "adult": 2,
        "fantasy": 5,
        "fiction": 9,
        "futuristic": 4,
        "science fiction": 39,
        "science fiction (aliens)": 11,
        "science fiction (cyberpunk)": 4,
        "science fiction (dystopia)": 8,
        "science fiction fantasy": 2,
        "thriller": 3
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_id": "87_1"
        },
        {
            "status": "maintenance",
            "stock_id": "87_2"
        }
    ],
    "metrics": {
        "rating_votes": 330,
        "score": 3.55
    },
    "pages": 992,
    "title": "The Burn Zone",
    "url": "https://www.goodreads.com/book/show/15788704-the-burn-zone",
    "year_published": 2013
}