{
    "author": "Tiffany Roberts",
    "base_id": 87,
    "description": "An undercover alien. A curvy human female he’s desperate to claim. One month to make her his.Tabitha Mathews has never had much luck with men. Her past relationships only left her heart aching and her self-esteem beaten down. But who needs them? She’s doing just fine on her own. She has a booming home business, an adorable, mischievous dog, and she just became a first-time homeowner…right next door to the hottest man she’s ever seen.Oh, did she mention that he happens to be an alien? An alien with dreamy, glowing eyes, wicked fangs and claws, and a tail.But she’s not supposed to know that, and only finds out after her wonderfully considerate dog leaves a big, odorous gift in her neighbor’s back yard—which promptly results in her being kidnapped.Now she’s tied to the alien’s bed, because of course he’s come to Earth in search of a mate—and he wants Tabitha to fill that role. More specifically, he wants her to carry his baby.Saying he’s moving fast seems like a bit of an understatement. Is Tabitha willing to accept her alien abductor as a mate? Is she ready to be a mother?And he’s generous enough to give her four whole weeks to decide.It’s not like it’s the biggest decision of her life or anything…right?",
    "editions": [
        "English"
    ],
    "genres": {
        "aliens": 18,
        "paranormal romance": 2,
        "romance": 5,
        "science fiction": 7,
        "science fiction romance": 3
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_id": "87_1"
        },
        {
            "status": "available",
            "stock_id": "87_2"
        },
        {
            "status": "available",
            "stock_id": "87_3"
        },
        {
            "status": "maintenance",
            "stock_id": "87_4"
        },
        {
            "status": "available",
            "stock_id": "87_5"
        }
    ],
    "metrics": {
        "rating_votes": 546,
        "score": 4.15
    },
    "pages": 951,
    "title": "Taken by the Alien Next Door",
    "url": "https://www.goodreads.com/book/show/55681599-taken-by-the-alien-next-door",
    "year_published": 2020
}