{
    "author": "Christopher Paolini",
    "id": "9208",
    "description": "Oaths sworn... loyalties tested... forces collide.It's been only months since Eragon first uttered \"brisingr\", an ancient language term for fire. Since then, he's not only learned to create magic with words — he's been challenged to his very core. Following the colossal battle against the Empires warriors on the Burning Plains, Eragon and his dragon, Saphira, have narrowly escaped with their lives. Still, there is more adventure at hand for the Rider and his dragon, as Eragon finds himself bound by a tangle of promises he may not be able to keep.First is Eragon's oath to his cousin, Roran: to help rescue Roran's beloved from King Galbatorix's clutches. But Eragon owes his loyalty to others, too. The Varden are in desperate need of his talents and strength — as are the elves and dwarves. When unrest claims the rebels and danger strikes from every corner, Eragon must make choices — choices that will take him across the Empire and beyond, choices that may lead to unimagined sacrifice.Eragon is the greatest hope to rid the land of tyranny. Can this once simple farm boy unite the rebel forces and defeat the king?",
    "editions": [
        "english"
    ],
    "genres": {
        "adventure": 646,
        "fantasy": 11520,
        "fantasy (dragons)": 1453,
        "fantasy (epic fantasy)": 307,
        "fantasy (high fantasy)": 478,
        "fantasy (magic)": 588,
        "fiction": 1599,
        "science fiction fantasy": 281,
        "young adult": 2840,
        "young adult (young adult fantasy)": 249
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "9208_1"
        },
        {
            "status": "available",
            "stock_id": "9208_2"
        }
    ],
    "metrics": {
        "rating_votes": 312852,
        "score": 4.05
    },
    "pages": 209,
    "title": "Brisingr",
    "url": "https://www.goodreads.com/book/show/2248573.Brisingr",
    "year_published": 2008
}