{
    "author": "Philip Reeve",
    "base_id": "941",
    "description": "Fever Crumb is a girl who has been adopted and raised by Dr. Crumb, a member of the order of Engineers, where she serves as apprentice. In a time and place where women are not seen as reasonable creatures, Fever is an anomaly, the only female to serve in the order.Soon though, she must say goodbye to Dr. Crumb - nearly the only person she's ever known - to assist archeologist Kit Solent on a top-secret project. As her work begins, Fever is plagued by memories that are not her own and Kit seems to have a particular interest in finding out what they are. Fever has also been singled out by city-dwellers who declare her part Scriven.The Scriveners, not human, ruled the city some years ago but were hunted down and killed in a victorious uprising by the people. If there are any remaining Scriven, they are to be eliminated.All Fever knows is what she's been told: that she is an orphan. Is Fever a Scriven? Whose memories does she hold? Is the mystery of Fever, adopted daughter of Dr. Crumb, the key to the secret that lies at the heart of London?Haunting, arresting, and astonishingly original, Fever Crumb will delight and surprise readers at every fast-paced, breathless turn.",
    "editions": [
        "english"
    ],
    "genres": {
        "adventure": 50,
        "audiobook": 34,
        "fantasy": 252,
        "fiction": 109,
        "science fiction": 225,
        "science fiction (dystopia)": 96,
        "science fiction (steampunk)": 368,
        "young adult": 323,
        "young adult (teen)": 68,
        "young adult (young adult fantasy)": 23
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_id": "941_1"
        },
        {
            "status": "available",
            "stock_id": "941_2"
        },
        {
            "status": "maintenance",
            "stock_id": "941_3"
        },
        {
            "status": "available",
            "stock_id": "941_4"
        },
        {
            "status": "maintenance",
            "stock_id": "941_5"
        },
        {
            "status": "available",
            "stock_id": "941_6"
        }
    ],
    "metrics": {
        "rating_votes": 8326,
        "score": 3.72
    },
    "pages": 1316,
    "title": "Fever Crumb",
    "url": "https://www.goodreads.com/book/show/6839020-fever-crumb",
    "year_published": 2009
}