{
    "author": "Alena Graedon",
    "base_id": "965",
    "description": "In the not-so-distant future, the forecasted “death of print” has become a reality. Bookstores, libraries, newspapers, and magazines are things of the past, and we spend our time glued to handheld devices called Memes that not only keep us in constant communication but also have become so intuitive that they hail us cabs before we leave our offices, order takeout at the first growl of a hungry stomach, and even create and sell language itself in a marketplace called the Word Exchange.Anana Johnson works with her father, Doug, at the North American Dictionary of the English Language (NADEL), where Doug is hard at work on the last edition that will ever be printed. Doug is a staunchly anti-Meme, anti-tech intellectual who fondly remembers the days when people used email (everything now is text or videoconference) to communicate—or even actually spoke to one another, for that matter. One evening, Doug disappears from the NADEL offices, leaving a single written clue: ALICE. It’s a code word he devised to signal if he ever fell into harm’s way. And thus begins Anana’s journey down the proverbial rabbit hole . . .Joined by Bart, her bookish NADEL colleague, Anana’s search for Doug will take her into dark  basements and subterranean passageways; the stacks and reading rooms of the Mercantile Library; and secret meetings of the underground resistance, the Diachronic Society. As Anana penetrates the mystery of her father’s disappearance and a pandemic of decaying language called “word flu” spreads, The Word Exchange becomes a cautionary tale that is at once a technological thriller and a meditation on the high cultural costs of digital technology.",
    "editions": [
        "english"
    ],
    "genres": {
        "audiobook": 17,
        "fantasy": 24,
        "fiction": 236,
        "mystery": 51,
        "science fiction": 133,
        "science fiction (dystopia)": 99,
        "science fiction fantasy": 17,
        "thriller": 20,
        "unfinished": 18,
        "writing (books about books)": 47
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "965_1"
        },
        {
            "status": "maintenance",
            "stock_id": "965_2"
        },
        {
            "status": "on_loan",
            "stock_id": "965_3"
        },
        {
            "status": "maintenance",
            "stock_id": "965_4"
        },
        {
            "status": "maintenance",
            "stock_id": "965_5"
        },
        {
            "status": "available",
            "stock_id": "965_6"
        },
        {
            "status": "available",
            "stock_id": "965_7"
        }
    ],
    "metrics": {
        "rating_votes": 3856,
        "score": 3.34
    },
    "pages": 900,
    "title": "The Word Exchange",
    "url": "https://www.goodreads.com/book/show/18209339-the-word-exchange",
    "year_published": 2014
}