{
    "author": "Alastair Reynolds",
    "base_id": "972",
    "description": "The galaxy has seen great empires rise and fall. Planets have shattered and been remade. Amongst the ruins of alien civilizations, building our own from the rubble, humanity still thrives. And there are vast fortunes to be made, if you know where to find them.Captain Rackamore and his crew do. It's their business to find the tiny, enigmatic worlds which have been hidden away, booby-trapped, surrounded by layers of protection—and to crack them open for the ancient relics and barely-remembered technologies inside. But while they ply their risky trade with integrity, not everyone is so scrupulous. Adrana and Fura Ness are the newest members of Rackamore's crew, signed on to save their family from bankruptcy. Only Rackamore has enemies, and there might be more waiting for them in space than adventure and fortune: the fabled and feared Bosa Sennen in particular. Revenger is a science fiction adventure story set in the rubble of our solar system in the dark, distant future—a tale of space pirates, buried treasure, and phantom weapons, of unspeakable hazards and single-minded heroism and of vengeance...",
    "editions": [
        "english",
        "spanish"
    ],
    "genres": {
        "adventure": 17,
        "adventure (pirates)": 14,
        "audiobook": 18,
        "fantasy": 18,
        "fiction": 128,
        "science fiction": 485,
        "science fiction (aliens)": 15,
        "space": 23,
        "space (space opera)": 95,
        "young adult": 29
    },
    "inventory": [
        {
            "status": "available",
            "stock_id": "972_1"
        },
        {
            "status": "maintenance",
            "stock_id": "972_2"
        },
        {
            "status": "available",
            "stock_id": "972_3"
        },
        {
            "status": "maintenance",
            "stock_id": "972_4"
        },
        {
            "status": "maintenance",
            "stock_id": "972_5"
        },
        {
            "status": "maintenance",
            "stock_id": "972_6"
        },
        {
            "status": "available",
            "stock_id": "972_7"
        }
    ],
    "metrics": {
        "rating_votes": 9027,
        "score": 3.81
    },
    "pages": 273,
    "title": "Revenger",
    "url": "https://www.goodreads.com/book/show/28962452-revenger",
    "year_published": 2016
}