{
  "author": "Christopher Paolini",
  "id": "9748",
  "description": "Darkness falls…despair abounds…evil reigns…Eragon and his dragon, Saphira, have just saved the rebel state from destruction by the mighty forces of King Galbatorix, cruel ruler of the Empire. Now Eragon must travel to Ellesmera, land of the elves, for further training in the skills of the Dragon Rider. Ages 12+.Darkness falls…despair abounds…evil reigns…Eragon and his dragon, Saphira, have just saved the rebel state from destruction by the mighty forces of King Galbatorix, cruel ruler of the Empire. Now Eragon must travel to Ellesmera, land of the elves, for further training in the skills of the Dragon Rider: magic and swordsmanship. Soon he is on the journey of a lifetime, his eyes open to awe-inspring new places and people, his days filled with fresh adventure. But chaos and betrayal plague him at every turn, and nothing is what it seems. Before long, Eragon doesn't know whom he can trust.Meanwhile, his cousin Roran must fight a new battle–one that might put Eragon in even graver danger.Will the king's dark hand strangle all resistance? Eragon may not escape with even his life. . . .",
  "editions": [
    "english",
    "spanish"
  ],
  "genres": [
    "adventure",
    "fantasy",
    "fantasy (dragons)",
    "fantasy (epic fantasy)",
    "fantasy (high fantasy)",
    "fantasy (magic)",
    "fiction",
    "science fiction fantasy",
    "young adult",
    "young adult (young adult fantasy)"
  ],
  "inventory": [
    {
      "status": "on_loan",
      "stock_id": "9748_1"
    },
    {
      "status": "on_loan",
      "stock_id": "9748_2"
    },
    {
      "status": "maintenance",
      "stock_id": "9748_3"
    },
    {
      "status": "available",
      "stock_id": "9748_4"
    },
    {
      "status": "maintenance",
      "stock_id": "9748_5"
    },
    {
      "status": "on_loan",
      "stock_id": "9748_6"
    },
    {
      "status": "on_loan",
      "stock_id": "9748_7"
    }
  ],
  "metrics": {
    "rating_votes": 369387,
    "score": 3.99
  },
  "pages": 926,
  "title": "Eldest",
  "url": "https://www.goodreads.com/book/show/45978.Eldest",
  "year_published": 2005
}
