{
    "author": "Tamora Pierce",
    "base_id": "980",
    "description": "In the final thrilling installment of Tamora Pierce's Protector of the Small series ( First Test, Page, and Squire), our sturdy young heroine, Keladry of Mindelan (a.k.a. Kel), has finally been knighted. Never one to rest on her laurels, Kel champs at the bit, ready to tackle the horrific magic killing devices she was shown in the Chamber of the Ordeal during her knighthood initiation. The huge, insectlike machines, \"made of iron-coated giants' bones, chains, pulleys, dagger-fingers and -toes, and a long whiplike tail,\" feed on the souls of dead children and are systematically killing off the citizens and warriors of Tortall.  Thoroughly disgusted to discover that not only is she not going to be assigned a combat post, but she has been placed in charge of a refugee camp instead, Kel, in her usual noble, stoic way, swallows her disappointment and sets out being the best refugee camp commander possible. Of course, destiny has a way of sneaking up on a young woman like Kel, and soon she is fulfilling the ordeal the Chamber set out for her... and then some. Tamora Pierce once again draws her legions of fans into her story, blending humor, pathos, exhilarating battles, and gripping drama with a very real, very appealing protagonist. It's easy to make war appear black and white, a matter of good versus evil. Pierce finds the shades of gray. (Ages 12 and older) --Emilie Coulter",
    "editions": [
        "english",
        "spanish"
    ],
    "genres": {
        "adventure": 186,
        "childrens": 115,
        "childrens (middle grade)": 110,
        "fantasy": 2888,
        "fantasy (high fantasy)": 101,
        "fantasy (magic)": 186,
        "fiction": 291,
        "young adult": 1276,
        "young adult (teen)": 103,
        "young adult (young adult fantasy)": 198
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_id": "980_1"
        },
        {
            "status": "available",
            "stock_id": "980_2"
        },
        {
            "status": "maintenance",
            "stock_id": "980_3"
        },
        {
            "status": "on_loan",
            "stock_id": "980_4"
        },
        {
            "status": "maintenance",
            "stock_id": "980_5"
        }
    ],
    "metrics": {
        "rating_votes": 52241,
        "score": 4.26
    },
    "pages": 1233,
    "title": "Lady Knight",
    "url": "https://www.goodreads.com/book/show/153800.Lady_Knight",
    "year_published": 2002
}