{
    "author": "Sam Esmail",
    "base_id": "99",
    "description": "Step inside the frontlines of the hit TV show MR. ROBOT with this new in-world fiction book by series creator and showrunner Sam Esmail and series writer Courtney Looney—the first and only book to tie in to USA’s Golden Globe® Award-winning series. The book will tell a brand-new story, reveal secrets from the show’s second season, and tease developments to come. With removable items from the world of the show, the book will give readers a chance to hold a piece of the series in their own hands.  MR. ROBOT is a psychological thriller that follows Elliot (Rami Malek, The Pacific), a young programmer, who works as a cyber-security engineer by day and as a vigilante hacker by night. Elliot finds himself at a crossroads when the mysterious leader (Christian Slater, Adderall Diaries) of an underground hacker group recruits him to destroy the firm he is paid to protect. The New York Times called it “relentless, sensational, and unabashedly suspenseful,” the New Yorker called it “terrific” and listed it among the year’s best TV, and Rolling Stone said it’s “easily the year’s most audacious drama” and the “best TV show of 2015.” Stars Rami Malek and Christian Slater took home a Critics’ Choice® Award and a Golden Globe Award, respectively, and the show itself received a Golden Globe Award and a Critics’ Choice Award for best television drama, along with the prestigious Peabody award.",
    "editions": [
        "english",
        "spanish",
        "french"
    ],
    "genres": {
        "audiobook": 3,
        "computers (hackers)": 5,
        "fiction": 30,
        "mystery": 5,
        "novels": 2,
        "science fiction": 8,
        "science fiction (cyberpunk)": 3,
        "sequential art (graphic novels)": 2,
        "the united states of america": 2,
        "thriller": 2
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_id": "99_1"
        },
        {
            "status": "on_loan",
            "stock_id": "99_2"
        },
        {
            "status": "available",
            "stock_id": "99_3"
        },
        {
            "status": "on_loan",
            "stock_id": "99_4"
        },
        {
            "status": "on_loan",
            "stock_id": "99_5"
        },
        {
            "status": "on_loan",
            "stock_id": "99_6"
        },
        {
            "status": "on_loan",
            "stock_id": "99_7"
        },
        {
            "status": "on_loan",
            "stock_id": "99_8"
        }
    ],
    "metrics": {
        "rating_votes": 769,
        "score": 4.32
    },
    "pages": 233,
    "title": "Mr. Robot: Red Wheelbarrow: (eps1.91_redwheelbarr0w.txt",
    "url": "https://www.goodreads.com/book/show/29873086-mr-robot",
    "year_published": 2016
}