{
  "author": "Glenn Beck",
  "id": "997",
  "description": "“I was just a baby when we were relocated and I don’t remember much. Everybody has that black hole at the beginning of their life. That time you can’t remember. Your first step. Your first taste of table food. My real memories begin in our assigned living area in Compound 14.”Just a generation ago, this place was called America. Now, after the worldwide implementation of a UN-led program called Agenda 21, it’s simply known as “the Republic.” There is no president. No Congress. No Supreme Court. No freedom.There are only the Authorities.Citizens have two primary goals in the new Republic: to create clean energy and to create new human life. Those who cannot do either are of no use to society. This bleak and barren existence is all that eighteen-year-old Emmeline has ever known. She dutifully walks her energy board daily and accepts all male pairings assigned to her by the Authorities. Like most citizens, she keeps her head down and her eyes closed.Until the day they come for her mother.“You save what you think you’re going to lose.”Woken up to the harsh reality of her life and her family’s future inside the Republic, Emmeline begins to search for the truth. Why are all citizens confined to ubiquitous concrete living spaces? Why are Compounds guarded by Gatekeepers who track all movements? Why are food, water and energy rationed so strictly? And, most important, why are babies taken from their mothers at birth? As Emmeline begins to understand the true objectives of Agenda 21 she realizes that she is up against far more than she ever thought. With the Authorities closing in, and nowhere to run, Emmeline embarks on an audacious plan to save her family and expose the Republic—but is she already too late?",
  "editions": [
    "english"
  ],
  "genres": [
    "adult",
    "adult fiction",
    "apocalyptic (post apocalyptic)",
    "audiobook",
    "fantasy",
    "fiction",
    "politics",
    "science fiction",
    "science fiction (dystopia)",
    "thriller"
  ],
  "inventory": [
    {
      "status": "available",
      "stock_id": "997_1"
    },
    {
      "status": "on_loan",
      "stock_id": "997_2"
    },
    {
      "status": "on_loan",
      "stock_id": "997_3"
    },
    {
      "status": "on_loan",
      "stock_id": "997_4"
    },
    {
      "status": "maintenance",
      "stock_id": "997_5"
    },
    {
      "status": "maintenance",
      "stock_id": "997_6"
    }
  ],
  "metrics": {
    "rating_votes": 7088,
    "score": 3.83
  },
  "pages": 283,
  "title": "Agenda 21",
  "url": "https://www.goodreads.com/book/show/15826004-agenda-21",
  "year_published": 2012
}
