{
    "author_name": "Anna Hackett",
    "base_id": 104,
    "book_description": "Hell Squad soldier Gabe Jackson has lost everything that mattered, including his twin brother. Now he just wants to kill the invading aliens anyway he knows how…and he knows a lot of ways. Previously part of a secret Army super-soldier project, he’s faster, stronger, deadlier…but on the inside, he’s a mass of rage, and pain, and grief—all waiting for a chance to drag him under. Until he finds her.Dr. Emerson Green had her life planned: thrive in the high-stress environment of the ER, build her career, have a great life. Then the raptor alien invasion happened. Now she’s the head of the medical team for the secret base sheltering human survivors outside of Sydney. She’s also in charge of patching up the soldiers who get too close to raptor claws. She’d never planned for this…and she’d never planned for sexy, brooding Gabe Jackson.As Emerson uncovers clues to the aliens’ secret plans for the human race, she and Gabe collide in a storm of volatile passion. But the brooding soldier is as stubborn as he is silent, and Emerson knows she must convince him to reach out to her…because Gabe is a ticking time bomb about to go off.Note to readers: This sci fi romance contains a lot of action (think invading aliens, explosions and gunfights), tough warriors (the sexy, battle-hardened soldiers of Hell Squad) and a steamy romance (lots of sexy times between a warrior woman and a sexy soldier). So if you like it fast, and gritty, and sexy, this is for you!Includes preview of Book 3 of the Hell Squad, Gabe.",
    "book_title": "Gabe",
    "editions": [
        "English"
    ],
    "genres": {
        "action": 7,
        "aliens": 18,
        "dystopia": 10,
        "fantasy": 7,
        "futuristic": 11,
        "military fiction": 11,
        "post apocalyptic": 11,
        "romance": 28,
        "science fiction": 34,
        "science fiction romance": 12
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_number": "104_1"
        },
        {
            "status": "maintenance",
            "stock_number": "104_2"
        },
        {
            "status": "available",
            "stock_number": "104_3"
        },
        {
            "status": "maintenance",
            "stock_number": "104_4"
        },
        {
            "status": "on_loan",
            "stock_number": "104_5"
        },
        {
            "status": "available",
            "stock_number": "104_6"
        },
        {
            "status": "available",
            "stock_number": "104_7"
        },
        {
            "status": "maintenance",
            "stock_number": "104_8"
        }
    ],
    "metrics": {
        "rating_votes": 1206,
        "score": 4.21
    },
    "original_book_title": "B00YAQU2WQ",
    "pages": 1374,
    "url": "https://www.goodreads.com/book/show/25606085-gabe",
    "year_published": 2015
}