{
    "author_name": "Honey Phillips",
    "base_id": 146,
    "book_description": "Can love forge a path between an alien invader and his human mate?When the Yehrin arrive on Earth, Emily Rogers is more intrigued than scared - intrigued enough to work for them on the United Worlds project. But in a single night, everything changes. Sabotage destroys the project and kills the alien male she trusted. Now the gentle Yehrin scholars are replaced by fierce Yehrin fighters.Frightened and alone, Emily runs home to her small North Carolina town - only to be followed by one of the massive horned warriors.Commander T’lan is a Yehrin male of unquestioned honor. Investigating the destruction, he discovers his mate in a delicate human female. But she is pregnant by another, and her pregnancy may be the hope his species so desperately needs.Will the need to protect his race destroy T’lan’s relationship with the one person he has spent his life searching for? After being betrayed by one alien, can Emily learn to trust another?Each book in the Alien Invasion series can be read as a standalone romance. This sweet and steamy HEA is intended for adult readers and contains scenes that may disturb some readers.",
    "book_title": "Alien Conquest",
    "editions": [
        "English"
    ],
    "genres": {
        "aliens": 27,
        "bdsm": 3,
        "erotica": 6,
        "fantasy": 7,
        "futuristic": 2,
        "paranormal": 6,
        "paranormal romance": 4,
        "romance": 17,
        "science fiction": 24,
        "science fiction romance": 11
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_number": "146_1"
        },
        {
            "status": "available",
            "stock_number": "146_2"
        }
    ],
    "metrics": {
        "rating_votes": 1322,
        "score": 4.02
    },
    "original_book_title": "B07S77CK84",
    "pages": 504,
    "url": "https://www.goodreads.com/book/show/46006872-alien-conquest",
    "year_published": 2019
}