{
    "author_name": "J. Barton Mitchell",
    "base_id": 275,
    "book_description": "Earth has been conquered by an alien race known as the Assembly. The human adult population is gone, having succumbed to the Tone---a powerful, telepathic super-signal broadcast across the planet that reduces them to a state of complete subservience. But the Tone has one critical flaw. It only affects the population once they reach their early twenties, which means that there is one group left to resist: Children.Holt Hawkins is a bounty hunter, and his current target is Mira Toombs, an infamous treasure seeker with a price on her head. It’s not long before Holt bags his prey, but their instant connection isn’t something he bargained for. Neither is the Assembly ship that crash-lands near them shortly after. Venturing inside, Holt finds a young girl who remembers nothing except her name: Zoey.As the three make their way to the cavernous metropolis of Midnight City, they encounter young freedom fighters, mutants, otherworldly artifacts, pirates, feuding alien armies, and the amazing powers that Zoey is beginning to exhibit. Powers that suggest she, as impossible as it seems, may just be the key to stopping the Assembly once and for all.",
    "book_title": "Midnight City",
    "editions": [
        "English"
    ],
    "genres": {
        "adventure": 21,
        "aliens": 71,
        "apocalyptic": 12,
        "dystopia": 76,
        "fantasy": 45,
        "fiction": 13,
        "paranormal": 22,
        "post apocalyptic": 42,
        "science fiction": 94,
        "young adult": 103
    },
    "inventory": [
        {
            "status": "available",
            "stock_number": "275_1"
        },
        {
            "status": "available",
            "stock_number": "275_2"
        },
        {
            "status": "available",
            "stock_number": "275_3"
        },
        {
            "status": "maintenance",
            "stock_number": "275_4"
        },
        {
            "status": "available",
            "stock_number": "275_5"
        }
    ],
    "metrics": {
        "rating_votes": 1724,
        "score": 3.91
    },
    "original_book_title": "Midnight City",
    "pages": 1278,
    "url": "https://www.goodreads.com/book/show/13494718-midnight-city",
    "year_published": 2012
}