{
    "author_name": "Jennifer L. Armentrout",
    "base_id": 311,
    "book_description": "In this special eBook version, experience OBSIDIAN, ONYX, and OPAL as told by Daemon Black…This book is enhanced with exclusive content—two original songs inspired by the novel—resulting in a large file that may take longer to download than expected.I knew the moment Katy Swartz moved in next door, there was going to be trouble. Lots of it.And trouble’s the last thing I need, since I’m not exactly from around here. My people arrived on Earth from Lux, a planet thirteen billion light years away. Plus, if there’s one thing I know, it’s that humans can’t be trusted. We scare them. We can do things they only dream about, and honestly, we make them look weak as hell. ‘Cuz they are.But Kat is getting to me in ways no one else has, and I can't stop myself from wanting her—or wanting to use my powers to protect her. She makes me weak, and I’m the strongest of our kind, tasked with protecting us all. So this one simple girl…she can mean the end for us. Because the Luxen have an even bigger enemy—the Arum, and I need to stay on my game.Falling for Katy—a human—won't just place her in danger. It could get us all killed, and that’s one thing I’ll never let happen...",
    "book_title": "Oblivion",
    "editions": [
        "English"
    ],
    "genres": {
        "aliens": 49,
        "fantasy": 48,
        "fiction": 6,
        "paranormal": 46,
        "paranormal romance": 12,
        "romance": 56,
        "science fiction": 27,
        "supernatural": 7,
        "young adult": 67,
        "young adult fantasy": 5
    },
    "inventory": [
        {
            "status": "maintenance",
            "stock_number": "311_1"
        },
        {
            "status": "on_loan",
            "stock_number": "311_2"
        },
        {
            "status": "available",
            "stock_number": "311_3"
        },
        {
            "status": "maintenance",
            "stock_number": "311_4"
        },
        {
            "status": "on_loan",
            "stock_number": "311_5"
        }
    ],
    "metrics": {
        "rating_votes": 2232,
        "score": 4.5
    },
    "original_book_title": "B0122U5BRW",
    "pages": 857,
    "url": "https://www.goodreads.com/book/show/25946985-oblivion",
    "year_published": 2015
}