{
    "author_name": "John Scalzi",
    "base_id": 3374,
    "book_description": "The Ghost Brigades are the Special Forces of the Colonial Defense Forces, elite troops created from the DNA of the dead and turned into the perfect soldiers for the CDF's toughest operations. They’re young, they’re fast and strong, and they’re totally without normal human qualms.The universe is a dangerous place for humanity—and it's about to become far more dangerous. Three races that humans have clashed with before have allied to halt our expansion into space. Their linchpin: the turncoat military scientist Charles Boutin, who knows the CDF’s biggest military secrets. To prevail, the CDF must find out why Boutin did what he did.Jared Dirac is the only human who can provide answers -- a superhuman hybrid, created from Boutin's DNA, Jared’s brain should be able to access Boutin's electronic memories. But when the memory transplant appears to fail, Jared is given to the Ghost Brigades.At first, Jared is a perfect soldier, but as Boutin’s memories slowly surface, Jared begins to intuit the reason’s for Boutin’s betrayal. As Jared desperately hunts for his \"father,\" he must also come to grips with his own choices. Time is running out: The alliance is preparing its offensive, and some of them plan worse things than humanity’s mere military defeat…",
    "book_title": "The Ghost Brigades",
    "editions": [
        "English"
    ],
    "genres": {
        "aliens": 63,
        "audiobook": 86,
        "fiction": 559,
        "military fiction": 175,
        "military science fiction": 62,
        "science fiction": 2304,
        "science fiction fantasy": 118,
        "space": 86,
        "space opera": 236,
        "war": 107
    },
    "inventory": [
        {
            "status": "available",
            "stock_number": "3374_1"
        },
        {
            "status": "on_loan",
            "stock_number": "3374_2"
        }
    ],
    "metrics": {
        "rating_votes": 69103,
        "score": 4.1
    },
    "original_book_title": "The Ghost Brigades",
    "pages": 763,
    "url": "https://www.goodreads.com/book/show/239399.The_Ghost_Brigades",
    "year_published": 2006
}