{
    "author_name": "Edgar Rice Burroughs",
    "base_id": 3640,
    "book_description": "A Princess of Mars is the first of eleven thrilling novels that comprise Edgar Rice Burroughs' most exciting saga, known as The Martian Series. It's the beginning of an incredible odyssey in which John Carter, a gentleman from Virginia and a Civil War veteran, unexpectedly finds himself on to the red planet, scene of continuing combat among rival tribes. Captured by a band of six-limbed, green-skinned savage giants called Tharks, Carter soon is accorded all the honor of a chieftain after it's discovered that his muscles, accustomed to Earth's greater gravity, now give him a decided advantage in strength. And when his captors take as prisoner Dejah Thoris, the lovely human-looking princess of the city of Helium, Carter must call upon every ounce of strength, courage, and ingenuity to rescue her-before Dejah becomes the slave of the depraved Thark leader, Tal Hajus!Excerpt:Her oval face was beautiful in the extreme, her every feature finely chisled and exquisite, her eyes large and lustrous and her head surmounted by a mass of coal black, waving hair, caught loosely into a strange yet becoming coiffure. Similar in face and figure to women of Earth, she was nevertheless a true Martian--and prisoner of the fierce green giants who held me captive, as well!",
    "book_title": "A Princess of Mars",
    "editions": [
        "English"
    ],
    "genres": {
        "Pulp": 141,
        "adventure": 314,
        "audiobook": 92,
        "classics": 693,
        "fantasy": 1006,
        "fiction": 647,
        "novels": 61,
        "romance": 99,
        "science fiction": 1810,
        "science fiction fantasy": 140
    },
    "inventory": [
        {
            "status": "available",
            "stock_number": "3640_1"
        },
        {
            "status": "maintenance",
            "stock_number": "3640_2"
        }
    ],
    "metrics": {
        "rating_votes": 52036,
        "score": 3.81
    },
    "original_book_title": "A Princess of Mars",
    "pages": 386,
    "url": "https://www.goodreads.com/book/show/40395.A_Princess_of_Mars",
    "year_published": 1912
}