{
    "author_name": "Sue Mercury",
    "base_id": 38,
    "book_description": "Kira is shocked when Alex shows up on her doorstep after he’s been missing for six years. She’s thankful her stepbrother is alive, but with his arrival her entire life changes in a matter of hours. Alex confesses he isn’t exactly human, he’s part of a royal alien family, and he’s spent his missing years on his home world completing his final growth cycles and learning about his people.At over seven feet tall and with muscles like a gladiator, Prince Alex looks like a deadly weapon. But she soon realizes he’s still the same Alex she’s always secretly loved, and when he confesses his feelings for her it seems too good to be true. Then his royal highness drops the ultimate bombshell: his Reestrian mating urge is almost upon him and it’s her he aches to claim, but they must leave for Reestria soon.Problems arise when the American president announces the existence of Alex’s species months before schedule, and in the mass panic all Reestrians must evacuate Earth until humans calm the freak down. Alex arrives on his home world with Kira, and it’s all he can do to keep from ripping her clothes off before they reach the privacy of his chambers. But then she goes missing. With the full force of his mating urge upon him, all will be lost if he doesn’t find Kira soon and claim the feisty little human as his. ",
    "book_title": "Step Alien",
    "editions": [
        "English"
    ],
    "genres": {
        "aliens": 17,
        "erotica": 4,
        "futuristic": 2,
        "male female romance": 2,
        "paranormal": 3,
        "romance": 13,
        "science fiction": 15,
        "science fiction romance": 4,
        "short stories": 3
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_number": "38_1"
        },
        {
            "status": "available",
            "stock_number": "38_2"
        },
        {
            "status": "available",
            "stock_number": "38_3"
        },
        {
            "status": "on_loan",
            "stock_number": "38_4"
        },
        {
            "status": "on_loan",
            "stock_number": "38_5"
        },
        {
            "status": "available",
            "stock_number": "38_6"
        },
        {
            "status": "on_loan",
            "stock_number": "38_7"
        }
    ],
    "metrics": {
        "rating_votes": 470,
        "score": 3.47
    },
    "original_book_title": "B00W2JNURM",
    "pages": 245,
    "url": "https://www.goodreads.com/book/show/25356246-step-alien",
    "year_published": 2015
}