{
    "author_name": "Lisa Henry",
    "base_id": 697,
    "book_description": "Brady Garrett needs to go home. He’s a conscripted recruit on Defender Three, one of a network of stations designed to protect the Earth from alien attack. He's also angry, homesick, and afraid. If he doesn’t get home he’ll lose his family, but there’s no way back except in a body bag.Cameron Rushton needs a heartbeat. Four years ago Cam was taken by the Faceless — the alien race that almost destroyed Earth. Now he’s back, and when the doctors make a mess of getting him out of stasis, Brady becomes his temporary human pacemaker. Except they’re sharing more than a heartbeat: they’re sharing thoughts, memories, and some very vivid dreams.Not that Brady’s got time to worry about his growing attraction to another guy, especially the one guy in the universe who can read his mind. It doesn’t mean anything. It’s just biochemistry and electrical impulses. It doesn’t change the truth: Brady’s alone in the universe.Now the Faceless are coming and there’s nothing anyone can do. You can’t stop your nightmares. Cam says everyone will live, but Cam’s probably a traitor and a liar like the military thinks. But that’s okay. Guys like Brady don’t expect happy endings.",
    "book_title": "Dark Space",
    "editions": [
        "English"
    ],
    "genres": {
        "aliens": 106,
        "dark": 38,
        "erotica": 38,
        "fantasy": 53,
        "lgbt": 73,
        "male male romance": 394,
        "military fiction": 101,
        "romance": 189,
        "science fiction": 369
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_number": "697_1"
        },
        {
            "status": "available",
            "stock_number": "697_2"
        },
        {
            "status": "maintenance",
            "stock_number": "697_3"
        },
        {
            "status": "on_loan",
            "stock_number": "697_4"
        },
        {
            "status": "maintenance",
            "stock_number": "697_5"
        },
        {
            "status": "available",
            "stock_number": "697_6"
        }
    ],
    "metrics": {
        "rating_votes": 3886,
        "score": 4.06
    },
    "original_book_title": "Dark Space",
    "pages": 417,
    "url": "https://www.goodreads.com/book/show/16174363-dark-space",
    "year_published": 2012
}