{
    "author_name": "Octavia E. Butler",
    "base_id": 876,
    "book_description": "The stunning conclusion to a postapocalyptic trilogy about an alien species merging with humans—from “one of science fiction’s finest writers” (TheNew York Times). Human and Oankali have been mating since the aliens first came to Earth to rescue the few survivors of an annihilating nuclear war. The Oankali began a massive breeding project, guided by the ooloi, a sexless subspecies capable of manipulating DNA, in the hope of eventually creating a perfect starfaring race. Jodahs is supposed to be just another hybrid of human and Oankali, but as he begins his transformation to adulthood he finds himself becoming ooloi—the first ever born to a human mother. As his body changes, Jodahs develops the ability to shapeshift, manipulate matter, and cure or create disease at will. If this frightened young man is able to master his new identity, Jodahs could prove the savior of what’s left of mankind. Or, if he is not careful, he could become a plague that will destroy this new race once and for all.",
    "book_title": "Imago",
    "editions": [
        "English"
    ],
    "genres": {
        "African American": 19,
        "aliens": 50,
        "audiobook": 19,
        "dystopia": 26,
        "fantasy": 89,
        "fiction": 244,
        "post apocalyptic": 37,
        "science fiction": 561,
        "science fiction fantasy": 57,
        "speculative fiction": 56
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_number": "876_1"
        },
        {
            "status": "on_loan",
            "stock_number": "876_2"
        },
        {
            "status": "on_loan",
            "stock_number": "876_3"
        },
        {
            "status": "available",
            "stock_number": "876_4"
        },
        {
            "status": "maintenance",
            "stock_number": "876_5"
        },
        {
            "status": "available",
            "stock_number": "876_6"
        }
    ],
    "metrics": {
        "rating_votes": 12360,
        "score": 4.19
    },
    "original_book_title": "Imago",
    "pages": 1029,
    "url": "https://www.goodreads.com/book/show/60934.Imago",
    "year_published": 1989
}