{
    "author_name": "Zoey Draven",
    "base_id": 88,
    "book_description": "Welcome to Luxiria, where the twin suns are hot and the alien warriors are hotter…Ever since Taylor Glass was rescued by strong, hulking Luxirians, nothing has been the same. Even worse, she can’t stop having sexy, vivid dreams starring one of her rescuers, a panty-melting alien male with mesmerizing gray eyes and the fiercest scowl she’s ever seen. Outside of her dream world, he clearly wants nothing to do with her and that fits perfectly with Taylor’s well-laid plan of getting back to Earth as soon as possible, no distractions needed. Too bad fate has other plans.Ambassador Vikan has been loyal to his past lover since the day a tragedy ripped her away. But when his Instinct awakens for a human female under his protection, the Luxirian warrior fights against the undeniably pull with everything in him, torn between loyalty and lust, cursing her generous curves and soft lips that make him crazed. When his will fails him however, Vikan does what any sane warrior would do: steal the female away before she can leave for Earth.Determined to get back home, Taylor fights against the intense attraction she has towards her alien captor. But when it becomes difficult to distinguish her too real dreams from reality, Taylor begins to fear that she might not leave Luxiria in one piece after all and that she might be forced to leave her heart behind.Full-length, 55,000+ word, SFR novel! This is the fifth book of the Warriors of Luxiria series and should be read in order for the best experience.Warriors of Luxiria series:The Alien's Prize: Vaxa'an and Kate The Alien's Mate: Vaxa'an and Kate The Alien's Lover: Lihvan and Beks The Alien’s Touch: Rixavox and Cecelia The Alien's Dream: Vikan and Taylor",
    "book_title": "The Alien's Dream",
    "editions": [
        "English"
    ],
    "genres": {
        "adventure": 2,
        "aliens": 17,
        "erotica": 4,
        "fantasy": 4,
        "paranormal": 6,
        "paranormal romance": 4,
        "romance": 16,
        "science fiction": 13,
        "science fiction romance": 5
    },
    "inventory": [
        {
            "status": "on_loan",
            "stock_number": "88_1"
        },
        {
            "status": "maintenance",
            "stock_number": "88_2"
        },
        {
            "status": "maintenance",
            "stock_number": "88_3"
        },
        {
            "status": "maintenance",
            "stock_number": "88_4"
        }
    ],
    "metrics": {
        "rating_votes": 1220,
        "score": 4.11
    },
    "original_book_title": "The Alien's Dream",
    "pages": 1193,
    "url": "https://www.goodreads.com/book/show/40133129-the-alien-s-dream",
    "year_published": 2018
}